*/********START OF SPECIFICATIONS*************************************/ 00100000
*/*                                                                  */ 00150000
*/* $MAC(RACINIT) COMP(SC1BN) PROD(RACF):                            */ 00200000
*/*                                                                  */ 00250000
*/* DESCRIPTIVE NAME = RACF USER INITIALIZATION INTERFACE            */ 00300000
*/*                                                                  */ 00350000
*/*                                                                  */ 00550000
* *01* PROPRIETARY STATEMENT=                                         * 00561300
*  **PROPRIETARY_STATEMENT********************************************* 00572600
*                                                                     * 00583900
*                                                                     * 00595200
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00606500
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                       * 00617800
*   5647-A01 (C) COPYRIGHT IBM CORP. 1980, 2000                       * 00629100
*                                                                     * 00640400
*   STATUS= HBB7703                                               @L9C* 00651700
*                                                                     * 00663000
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00674300
*/*                                                                  */ 00686300
*/*                                                                  */ 00686400
*/*01* EXTERNAL CLASSIFICATION:                                      */ 00686500
*/*02* GUPI:                                                         */ 00686700
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00687100
*/*                                                                  */ 00687300
*/*                                                                  */ 00687500
*/* FUNCTIONAL DESCRIPTION = THIS MACRO PROVIDES THE INTERFACE TO THE*/ 00700000
*/*         RACF USER INITIALIZATION SVC ROUTINE, IGC00131.  IT IS   */ 00750000
*/*         USABLE ONLY BY AUTHORIZED PROGRAMS AND MAY BE ISSUED BOTH*/ 00800000
*/*         IN BAL AND PL/S.                                         */ 00850000
*/*                                                                  */ 00900000
*/*         INPUT TO THE RACINIT SVC ROUTINE PROVIDED BY THIS MACRO  */ 00950000
*/*         CONSISTS OF THE ADDRESS OF A PARAMETER LIST IN REGISTER  */ 01000000
*/*         ONE.  OUTPUT CONSISTS OF A RETURN CODE IN  REG 15.       */ 01050000
*/*                                                                  */ 01100000
*/*                                                                  */ 01350000
*/* MACROS = IHBINNRA                                                */ 01400000
*/*                                                                  */ 01450000
*/* CHANGE ACTIVITY:                                                 */ 01468000
*/*   RACF VERSION 1 RELEASE 3                               @PC003PY*/ 01486000
*/*   OZ57241                                                @ZA57241*/ 01504000
*/*   $T1=UZ90211,SAF/RF15,810702,CNTDSD:                        @T1A*/ 01522000
*/*   $L6=HRF1602,RACF/160,830307,CNTDSD:                        @L6A*/ 01540000
*/*   UZ90283                                                @ZA90283*/ 01558000
*/*   UZ90284                                                @ZA90284*/ 01576000
*/*   UZ90285                                                @ZA90285*/ 01594000
*/*   $L7=HRF1702,RACF/170,840531,CNTDSD:                        @L7A*/ 01612000
*/*   OY09590                                                @YA09590*/ 01630000
*/*   $L8=HRF1802,RACF/180,870323,CNTDSD:                        @L8A*/ 01648000
*/*   $M1=MVSB1   RACF/190 880328 PDI_H1: MVS B1 SECURITY        @M1A*/ 01661200
*/*   $P1=PGW0002 RACF/190 880428 PDI_H1: SUPPORT FOR PGW0002    @P1A*/ 01674400
*/*   $M2=MVSB1   RACF/190 880428 PDV_Z1: MVS B1 SECURITY        @M2A*/ 01687600
*/*   $P2=PGW0012 RACF/190 880428 PDI_H1: SUPPORT FOR PGW0012    @P2A*/ 01700800
*/*   $P3=PGW0010 RACF/190 880615 PDI_H1: SUPPORT FOR PGW0010    @P3A*/ 01714000
*/*   $P4=PGW0020 RACF/190 880615 PDI_H1: SUPPORT FOR PGW0020    @P4A*/ 01727200
*/*   $D1=DCR0044 RACF/190 880615 PDPWB1: DCR 44                 @D1A*/ 01740400
*/*   $D2=DCR0045 RACF/190 890201 PDPWB1: DCR 45                 @D2A*/ 01753600
*/*   $D3=DGU0061 RACF/190 890201 PDRTS1: DCR 61                 @D3A*/ 01766800
*/*   $P5=PGW0058 RACF/190 890308 PDPWB1: SUPPORT FOR PGW0058    @P5A*/ 01780000
*/*   $D4=DGU0080 RACF/190 890310 PDI_H1: DCR 80                 @D4A*/ 01793200
*/*   $P6=PGW0059 RACF/190 890308 PDPWB1: SUPPORT FOR PGW0059    @P6A*/ 01806400
*/*   $P7=PGW0060 RACF/190 890412 PDI_H1: SUPPORT FOR PGW0060    @P7A*/ 01819600
*/*   $D5=DGU0091 RACF/190 890517 PDGTM1: DCRR # DGU0091         @D5A*/ 01832800
*/*   $D6=DGU0099 RACF/190 890614 PDGTM1: DCRR # DGU0099         @D6A*/ 01846000
*/*   $P8=PGP0401 RACF/190 890721 PDPWB1: SUPPORT FOR PGP0401    @P8A*/ 01859200
*/*   $P9=PGP0360 RACF/190 890721 PDB_S1: SUPPORT FOR PGP0360    @P9A*/ 01872400
*/*                   OY24122                                @YA24122*/ 01886200
*/*   $Q1=PGP0611 RACF/190 890920 PDB_S1: SUPPORT FOR PGP0611    @Q1A*/ 01893100
*/*   $D7=TI90003 RACF/190 891020 PDRTS1: DCRR # DGU0112         @D7A*/ 01896500
*/*   $M3=APPCSPE RACF/190 900625 PDFJH1: SUPPORT FOR MVS 4.2    @M3A*/ 01898200
*/*   $M4=APPC    RACF/192 900904 PDTGL:  SUPPORT FOR APPC       @M4A*/ 01898600
*/*   $M5=APPC    RACF/192 901008 PDTGL:  SUPPORT FOR APPC       @M5A*/ 01899000
*/*   $Q2=PJA0029 RACF/192 910524 PDPSB1: SUPPORT FOR PJA0029    @Q2A*/ 01899400
*/*   $01=OY47989 RACF/190 911012 PDDLR1: PE of OY43556          @01A*/ 01899700
*/*   $M6=OW04015 RACF/210 930426 PDKAF1: SUPPORT FOR RACF 2.1   @M6A*/ 01899800
*/*   $M7=OW10709 RACF/220 940510 PDJMV1: SUPPORT FOR RACF 2.2   @M7A*/ 01899900
*/*   $M8=RELID   RACF/230 960422 PDJMV1: SUPPORT FOR RACF 2.3   @M8A*/ 01900800
*/*   $M9=WEBSR   RACF/230 960624 PDEMD1: Performance enhancem.  @M9A*/ 01901200
*/*   $P1=PQC2037 RACF/230 960804 PDRSU1: PQC2037                @P1A*/ 01901400
*/*   $N1=RELID   RACF/240 960904 PDJMV1: SUPPORT FOR RACF 2.4   @N1A*/ 01901500
*/*   $MA=NQN     HBB6605  970228 PDR_B1: Network qualified name @MAA*/ 01901700
*/*   $Q3=PVT0207 HBB6606  971114 PDCAM1: NQN Parmlen change     @Q3A*/ 01901900
*/*   $N2=RELID   HRF2608  980623 PDRDS2: SUPPORT FOR HRF2608    @N2A*/ 01902000
*/*   $L9=DCERT   HBB7703  990324 PDCLC : Digital Cert Ext.      @L9A*/ 01902100
*/*   $P2=PXD0160 HBB7703  990630 PDCLC:  Digital Cert Ext.      @P2A*/ 01902200
*/*   $P3=PXD0181 HBB7703  990707 PDCLC:  Digital Cert Ext.      @P3A*/ 01902300
*/*   $P4=PXD0286 HBB7703  990810 PDCLC:  Digital Cert Ext.      @P4A*/ 01902400
*/*                                                                  */ 01902500
*/*                                                                  */ 01902600
*/* CHANGE DESCRIPTIONS:                                             */ 01905200
*/*   A000000-999999                                         @PC001PY*/ 01907800
*/*   A - SUPPORT FOR KEYWORDS NEW FOR MVS B1 SECURITY           @M1A*/ 01910400
*/*   A - SUPPORT FOR MF=M                                       @P1A*/ 01913000
*/*   A - SUPPORT FOR REMOTE= KEYWORD                            @M2A*/ 01915600
*/*   A - RELEASE 1.9 OR HIGHER FOR RELEASE 1.9 KEYWORDS         @P2A*/ 01918200
*/*   D - REGISTER BOUNDS CHECKING                               @P3A*/ 01920800
*/*   A - SKIP 1.9 KEYWORDS IF RELEASE=1.8                       @P4A*/ 01923400
*/*   A - SET REMOTE/TRUSTED SPECIFIED INDICATORS - DCR0044      @D1A*/ 01926000
*/*   A - ADD TOKNIN/TOKNOUT, REMOVE UTOKEN       - DCR0045      @D2A*/ 01928600
*/*   A - NEW SESSION FOR VERIFYX TO CREATE UNKNOWN USER TOKEN.  @D3A*/ 01931200
*/*   A - SUPPORT FOR SESSION=INTBATCH, EXTBATCH, RJEBATCH,      @D4A*/ 01933800
*/*       AND NJEBATCH                                               */ 01936400
*/*   A - DON'T GENERATE CONSTANTS IN THE MIDDLE OF THE PLIST    @P5A*/ 01939000
*/*   A - DON'T BAL INTO THE PLIST ON MF=S                       @P6A*/ 01941600
*/*   A - CORRECT ERROR MESSAGE FOR REQUEST=VERIFYX RELEASE=1.8  @P7A*/ 01944200
*/*   A - SUPPORT FOR SESSION=NJSYSOUT AND SESSION=NJEBATCH      @D5A*/ 01945000
*/*   C - CHANGE SESSION=NJEUNKN TO SESSION=TKNUNKWN             @D6A*/ 01945800
*/*   C - CORRECT CHANGE ACTIVITY FOR DCR 44 AND DCR 45          @P8A*/ 01946300
*/*   A - SUPPORT TO VALIDATE SUBPOOL                            @P9A*/ 01946500
*/*   C - '&RELEASE' TO '&RELEASE'(1,3) FOR LOGICAL COMPARISON   @Q1A*/ 01946600
*/*       WITH '1.9'                                             @Q1A*/ 01946700
*/*   A - SUPPORT FOR SESSION=INTXBM, EXTXBM, RJEXBM, & NJEXBM.  @D7A*/ 01947200
*/*   A - RACF 1.9 SPE - BASE APPC SUPPORT                       @M3A*/ 01947400
*/*   A - APPC SUPPORT                                           @M4A*/ 01947500
*/*   A - HAVE THE PRESENCE OF TOKNIN SET THE INDICATOR THAT A   @M5A*/ 01947600
*/*       PARAMETER HAS BEEN SPECIFIED THAT IS NOT COMPATIBLE    @M5A*/ 01947700
*/*       WITH SYSTEM=YES.                                       @M5A*/ 01947800
*/*   C - STATUS TO CORRECTLY CORRESPOND TO MVS LEVEL            @Q2A*/ 01947900
*/*   C - Ship code for cover letter error                       @01A*/ 01948100
*/*   A - ALLOW RELEASE=2.1 TO BE SPECIFIED                      @M6A*/ 01948200
*/*   A - ALLOW RELEASE=2.2 TO BE SPECIFIED                      @M7A*/ 01948300
*/*   A - ALLOW RELEASE=2.3 TO BE SPECIFIED                      @M8A*/ 01948800
*/*   A - ALLOW NEW SESSION KEYWORD (OMVSSRV) WHEN RACINIT       @M9A*/ 01948900
*/*       INVOKED BY RACROUTE MACRO.                             @M9A*/ 01949000
*/*   C - Sending a better MNOTE for RACROUTE needing to have    @P1A*/ 01949100
*/*       RELID being 1.9 or greater                             @P1A*/ 01949200
*/*   A - ALLOW RELEASE=2.4 TO BE SPECIFIED                      @N1A*/ 01949400
*/*   A - Add POENET keyword                                     @MAA*/ 01949600
*/*   A - Allow Release=2.6 to regulate size of Parmlen          @Q3A*/ 01949700
*/*   A - ALLOW RELEASE=2608 TO BE SPECIFIED                     @N2A*/ 01949800
*/*   A - Added support for X500NAME keyword on RACROUTE         @L9A*/ 01959800
*/*       REQUEST=VERIFY                                         @L9A*/ 01969800
*/*   C - Don't allow X500NAME on ENVIR=VERIFYX                  @P2A*/ 01972300
*/*   C - Fix typo on label                                      @P3A*/ 01974800
*/*   C - Fix typo on label                                      @P4A*/ 01977300
*/*                                                                  */ 01979800
*/*************END OF SPECIFICATIONS**********************************/ 01989800
*%/* BILINGUAL HEADER                                                   02000000
         MACRO                                                          02050000
&SYMBOL  RACINIT &USERID=,&START=,&PASSWRD=,&GROUP=,&INSTLN=,          *02100000
               &NEWPASS=,&ENVIR=,&MF=S,&PGMNAME=,&ACTINFO=,            *02150000
               &OIDCARD=,&TERMID=,&JOBNAME=,                           *02200000
               &APPL=,&ACEE=,&SMC=,&SUBPOOL=,&PASSCHK=,            @L6A*02250000
               &ENCRYPT=,&STAT=,&LOG=,&LOC=,&RELEASE=,             @L7A*02256600
               &TOKNIN=,                                           @D2C*02263200
               &TOKNOUT=,                                          @D2A*02269800
               &STOKEN=,                                           @M1A*02276400
               &SECLABL=,                                          @M1A*02283000
               &EXENODE=,                                          @M1A*02289600
               &SNODE=,                                            @M1A*02296200
               &SUSERID=,                                          @M1A*02302800
               &SGROUP=,                                           @M1A*02309400
               &POE=,                                              @M1A*02316000
               &POENET=,                                           @MAA*02319300
               &LOGSTR=,                                           @M1A*02322600
               &SESSION=,                                          @M1A*02329200
               &REMOTE=,                                           @P3C*02335800
               &TRUSTED=,                                          @M4C*02339300
               &ENVRIN=,                                           @M4A*02342800
               &ENVROUT=,                                          @L9C*02345200
               &X500NAME=                                          @L9A 02347600
         LCLA  &BIT0,&BIT1,&BIT2,&BIT3,&BIT4,&BIT5,&BIT6,&BIT7     @L6A 02350000
         LCLA  &BIX0,&BIX1,&BIX2,&BIX3,&BIX4,&BIX5,&BIX6,&BIX7     @L6A 02400000
         LCLB  &MFFLAG                                                  02450000
         LCLC  &NAME,&NAME2,&MVALUE                                @M1A 02483300
         LCLA  &OFFSET                                             @P4A 02516600
         LCLA  &PARMLEN                                        @YA24122 02527700
         LCLB  &RLVLCHK                                        @YA24122 02538800
.* DEFINE GLOBAL SET SYMBOLS                                       @T1A 02550000
         GBLB  &ICHRAC               ICHRAC - A FLAG WHICH, WHEN   @T1A 02600000
.*                                   ON, INDICATES THAT THIS MACRO @T1A 02650000
.*                                   IS BEING INVOKED INTERNALLY   @T1A 02700000
.*                                   BY THE RACROUTE MACRO.        @T1A 02750000
         GBLC  &ICHL                 SETS ADDRESSABILITY TO THE    @T1A 02800000
.*                                   PARAMETER LIST FOR THE        @T1A 02850000
.*                                   RACROUTE MACRO.               @T1A 02900000
         GBLC  &ICHRLVL              SYMBOL TO BRANCH TO WHEN      @L7A 02950000
.*                                   INCOMPATIBLE MACRO LEVEL.     @L7A 03000000
&NAME    SETC  'ICH0&SYSNDX'                                            03050000
&PARMLEN SETA  56                    DEFAULT LIST LENGTH       @YA24122 03055300
&OFFSET  SETA  60                    POINT BEYOND LIST         @YA24122 03060600
         AIF   ('&RELEASE(1)' EQ '').LENEND                        @Q1A 03063200
         AIF   ('&RELEASE(1)'(1,3) GE '1.9').LEN19                 @Q1C 03065900
         AGO   .LENEND                                             @P4A 03071300
.LEN19   ANOP                                                      @P4A 03078400
         AIF   ('&RELEASE(1)' NE '1.9').LEN192                     @M4C 03081900
&PARMLEN SETA  100                   SET TO 1.9 PLIST LENGTH   @YA24122 03085400
&OFFSET  SETA  104                   POINT BEYOND LIST             @P6C 03088900
.*                                                                 @M4A 03089400
.LEN192  ANOP                                                      @M4A 03089900
         AIF   ('&RELEASE(1)' NE '1.9.2').LEN210                   @M6C 03090400
&PARMLEN SETA  108                   SET TO 1.9.2. PLIST LENGTH    @M4A 03090900
&OFFSET  SETA  112                   POINT BEYOND LIST             @M4A 03091400
.*                                                                 @M4A 03091900
.LEN210  ANOP                                                      @M6A 03092000
         AIF   ('&RELEASE(1)' NE '2.1').LEN220                     @M7C 03092100
&PARMLEN SETA  108                   SET TO 2.1 PLIST LENGTH       @M6A 03092200
&OFFSET  SETA  112                   POINT BEYOND LIST             @M6A 03092300
.*                                                                 @M6A 03092400
.LEN220  ANOP                                                      @M6A 03093400
         AIF   ('&RELEASE(1)' NE '2.2').LEN230                     @M8A 03094400
&PARMLEN SETA  108                   SET TO 2.2 PLIST LENGTH       @M7A 03095400
&OFFSET  SETA  112                   POINT BEYOND LIST             @M7A 03096400
.*                                                                 @M7A 03097400
.LEN230  ANOP                                                      @M8A 03097500
         AIF   ('&RELEASE(1)' NE '2.3').LEN240                     @N1C 03097600
&PARMLEN SETA  108                   SET TO 2.3 PLIST LENGTH       @M8A 03097700
&OFFSET  SETA  112                   POINT BEYOND LIST             @M8A 03097800
.*                                                                 @M8A 03097900
.LEN240  ANOP                                                      @N1A 03098200
         AIF   ('&RELEASE(1)' NE '2.4').LEN260                     @Q3C 03098500
&PARMLEN SETA  108                   SET TO 2.4 PLIST LENGTH       @N1A 03098800
&OFFSET  SETA  112                   POINT BEYOND LIST             @N1A 03099100
.*                                                                 @N1A 03099400
.LEN260  ANOP                                                      @Q3A 03105700
         AIF   ('&RELEASE(1)' NE '2.6').LEN2608                    @N2C 03112000
&PARMLEN SETA  112                   SET TO 2.6 PLIST LENGTH       @Q3A 03118300
&OFFSET  SETA  116                   POINT BEYOND LIST             @Q3A 03124600
.*                                                                 @Q3A 03130900
.LEN2608 ANOP                                                      @N2C 03131900
         AIF   ('&RELEASE(1)' NE '2608').LEN7703                   @L9C 03132900
&PARMLEN SETA  112                   SET TO 2.6 PLIST LENGTH       @N2A 03133900
&OFFSET  SETA  116                   POINT BEYOND LIST             @N2A 03134900
.LEN7703 ANOP                                                      @L9A 03135200
         AIF   ('&RELEASE(1)' NE '7703').LENEND                    @L9A 03135500
&PARMLEN SETA  120                   SET TO 7703 PLIST LENGTH      @L9A 03135800
&OFFSET  SETA  124                   POINT BEYOND LIST             @L9A 03136100
.*                                                                 @L9A 03136400
.LENEND  ANOP                                                      @P4A 03137200
.* PERFORM PARAMETER ANALYSIS AND DIAGNOSIS                             03143500
.* VALIDATE RELEASE PARAMETER                                      @L7A 03150000
         AIF   (&ICHRAC).RLVL01                                    @L7A 03200000
&ICHRLVL SETC  'ICH&SYSNDX.X'      CREATE LABEL FOR SVC BYPASS     @L7A 03250000
.RLVL01  ANOP                                                      @L7A 03300000
         AIF   ('&RELEASE' EQ '').ERLVL1R                          @L7A 03350000
         AIF   (N'&RELEASE GT 2).ERLVL1  INVALID RELEASE PARAMETER @L7A 03400000
         AIF   ('&RELEASE(1)' NE '1.6' AND '&RELEASE(1)' NE '1.7' AND  X03437500
               '&RELEASE(1)' NE '1.8' AND '&RELEASE(1)' NE '1.8.1' AND X03475000
               '&RELEASE(1)' NE '1.9' AND                              X03500000
               '&RELEASE(1)' NE '1.9.2' AND                            X03516600
               '&RELEASE(1)' NE '2.1'  AND                             X03527700
               '&RELEASE(1)' NE '2.2'  AND                             X03535100
               '&RELEASE(1)' NE '2.3'  AND                             X03540000
               '&RELEASE(1)' NE '2.4'  AND                             X03543300
               '&RELEASE(1)' NE '2.6'  AND                             X03545500
               '&RELEASE(1)' NE '2608'  AND                            X03547000
               '&RELEASE(1)' NE '7703').ERLVL1                     @L9A 03548500
         AIF   (N'&RELEASE EQ 1).NORLVLC CHECK NOT SPECIFIED       @L7A 03550000
         AIF   ('&RELEASE(2)' NE 'CHECK').ERLVL1 INVALID VALUE     @L7A 03600000
         AIF   ('&MF(1)' NE 'E').ERLVL2 CHECK ONLY WITH MF=E       @L7A 03650000
&RLVLCHK SETB  1              INDICATE RELEASE-CHECK REQUESTED @YA24122 03675000
.ERLVL2R ANOP                                                      @L7A 03700000
.NORLVLC ANOP                                                      @L7A 03750000
.ERLVL1R ANOP                                                      @L7A 03800000
.* CHECK FOR RACROUTE AND RELEASE 1.9 AND HIGHER                  @L7A  03806200
         AIF   ('&RELEASE(1)' EQ '').NOERR01                       @Q1A 03812500
         AIF   ('&RELEASE(1)'(1,3) GE '1.9' AND NOT &ICHRAC).ERR14 @P1C 03820800
.ERTN14  ANOP                                                      @P1A 03829100
.NOERR01 ANOP                                                      @Q1A 03837500
.*                                                                 @L7A 03850000
.* PERFORM PARAMETER DIAGNOSIS                                          03900000
.*                                                                 @L7A 03950000
.* CHECK SPECIFIED PARAMETERS AGAINST RACF LEVEL                   @L7A 04000000
         AIF   ('&RELEASE(1)' GE '1.7').ERLVLAR                @YA09590 04050000
         AIF   (T'&LOC NE 'O' OR T'&LOG NE 'O' OR                      X04100000
               T'&STAT NE 'O' AND NOT &ICHRAC).ERLVLA              @L7A 04150000
.ERLVLAR ANOP                                                      @L7A 04200000
.* VALIDATE ENVIR PARAMETER                                             04250000
         AIF   ('&ENVIR' EQ 'DELETE' OR '&ENVIR' EQ '' OR              *04283300
               '&ENVIR' EQ 'CREATE' OR '&ENVIR' EQ 'CHANGE'  OR        *04316600
               '&ENVIR' EQ 'VERIFY').ERTN002                       @M1C 04349900
         AIF   ('&ENVIR' EQ 'VERIFYX').ERTN002                     @M1A 04383200
         AGO   .ERR002                                             @M1A 04416500
.ERTN002 ANOP                                                           04450000
.*  VERIFY ALLOWED ONLY IF RACINIT INVOKED FROM RACROUTE           @L6A 04500000
         AIF   ('&ENVIR' EQ 'VERIFY' AND NOT &ICHRAC).ERR07        @L6A 04550000
         AIF   ('&ENVIR' EQ 'VERIFYX' AND NOT &ICHRAC).ERR11       @M1A 04560000
&MVALUE  SETC  'REQUEST TYPE'                                      @P7C 04568000
         AIF   ('&ENVIR' NE 'VERIFYX').ERTN07                      @Q1A 04576000
         AIF   ('&RELEASE(1)' EQ '').ERR10                         @Q1A 04584000
         AIF   ('&RELEASE(1)'(1,3) LT '1.9').ERR10                 @Q1A 04592000
.ERTN07 ANOP   ,                                                   @L6A 04600000
         AIF   ('&SMC' NE 'YES' AND '&SMC' NE 'NO' AND                 *04650000
                '&SMC' NE '').ERR003                           @PC003PY 04700000
.ERTN003 ANOP                                                  @PC003PY 04750000
         AIF   ('&PASSCHK' NE 'YES' AND '&PASSCHK' NE 'NO' AND         *04800000
                '&PASSCHK' NE '').ERR004                       @PC003PY 04850000
.* VALIDATE STAT PARAMETER                                              04900000
.ERTN004 ANOP                                                  @PC003PY 04950000
         AIF   ('&STAT' NE 'ASIS' AND '&STAT' NE 'NO' AND              *05000000
               '&STAT' NE '').ERR005                               @L6A 05050000
.* VALIDATE ENCRYPT PARAMETER                                           05100000
.ERTN005 ANOP  ,                                                   @L6A 05150000
         AIF   ('&ENCRYPT' NE 'YES' AND                                *05200000
               '&ENCRYPT' NE '' AND                                    *05250000
               '&ENCRYPT' NE 'NO').ERR006                          @L6A 05300000
.* VALIDATE LOG PARAMETER                                          @L7A 05350000
.ERTN006 ANOP  ,                                                   @L6A 05400000
         AIF   ('&LOG' NE 'ASIS' AND '&LOG' NE 'ALL' AND               *05450000
               '&LOG' NE 'NONE' AND '&LOG' NE '').ERR007           @M4C 05500000
.ERTN007 ANOP  ,                                                   @L7A 05550000
.* VALIDATE LOC PARAMETER                                          @L7A 05600000
         AIF   ('&LOC' NE 'BELOW' AND '&LOC' NE 'ANY' AND '&LOC' NE    +05650000
               '').ERR008                                          @L7A 05700000
.ERTN008 ANOP  ,                                                   @L7A 05750000
.* LOC ALLOWED ONLY IF RACINIT INVOKED FROM RACROUTE               @L7A 05800000
         AIF   ('&LOC' NE '' AND NOT &ICHRAC).ERR009               @L7A 05850000
.ERTN009 ANOP  ,                                                   @L7A 05900000
.*------------------------------------------------------------*    @M2A 05900700
.* VALIDATE REMOTE= PARAMETER                                      @M2A 05901400
.*------------------------------------------------------------*    @M2A 05902100
         AIF   ('&REMOTE' NE 'YES' AND '&REMOTE' NE 'NO' AND           *05902800
               '&REMOTE' NE '').ERR012                             @M2A 05903500
.ERTN030 ANOP                                                      @M2A 05904200
.*------------------------------------------------------------*    @M1A 05904900
.* VALIDATE TRUSTED PARAMETER                                      @M1A 05905600
.*------------------------------------------------------------*    @M1A 05906300
         AIF   ('&TRUSTED' NE 'YES' AND '&TRUSTED' NE 'NO' AND         *05907000
               '&TRUSTED' NE '').ERR010                            @M1A 05907700
.ERTN010 ANOP                                                      @M1A 05908400
.*------------------------------------------------------------*    @M1A 05909100
.* VALIDATE SESSION PARAMETER                                      @M1A 05909800
.*------------------------------------------------------------*    @M1A 05910500
         AIF   ('&SESSION' EQ '').ERTN020                          @M1A 05911200
         AIF   ('&SESSION' NE 'SYSAS').SESS01                      @M1A 05911900
         AGO   .ERTN020                                            @M1A 05912600
.SESS01  ANOP                                                      @M1A 05913300
         AIF   ('&SESSION' NE 'COMMAND').SESS02                    @M1A 05914000
         AGO   .ERTN020                                            @M1A 05914700
.SESS02  ANOP                                                      @M1A 05915400
         AIF   ('&SESSION' NE 'CONSOPER').SESS03                   @M1A 05916100
         AGO   .ERTN020                                            @M1A 05916800
.SESS03  ANOP                                                      @M1A 05917500
         AIF   ('&SESSION' NE 'STARTED').SESS04                    @M1A 05918200
         AGO   .ERTN020                                            @M1A 05918900
.SESS04  ANOP                                                      @M1A 05919600
         AIF   ('&SESSION' NE 'MOUNT').SESS05                      @M1A 05920300
         AGO   .ERTN020                                            @M1A 05921000
.SESS05  ANOP                                                      @M1A 05921700
         AIF   ('&SESSION' NE 'TSO').SESS06                        @M1A 05922400
         AGO   .ERTN020                                            @D4D 05923100
.SESS06  ANOP                                                      @M1A 05923800
.SESS07  ANOP                                                      @M1A 05924500
         AIF   ('&SESSION' NE 'INTXBM').SESS7E                     @D7C 05925200
         AGO   .ERTN020                                            @M1A 05925900
.SESS7E  ANOP                                                      @D7A 05926000
         AIF   ('&SESSION' NE 'EXTXBM').SESS7R                     @D7A 05926100
         AGO   .ERTN020                                            @D7A 05926200
.SESS7R  ANOP                                                      @D7A 05926300
         AIF   ('&SESSION' NE 'RJEXBM').SESS7N                     @D7A 05926400
         AGO   .ERTN020                                            @D7A 05926500
.SESS7N  ANOP                                                      @D7A 05926600
         AIF   ('&SESSION' NE 'NJEXBM').SESS08                     @D7A 05926700
         AGO   .ERTN020                                            @D7A 05926800
.SESS08  ANOP                                                      @M1A 05926900
         AIF   ('&SESSION' NE 'RJEOPER').SESS09                    @M1A 05927300
         AGO   .ERTN020                                            @M1A 05928000
.SESS09  ANOP                                                      @M1A 05928700
         AIF   ('&SESSION' NE 'NJEOPER').SESS10                    @D3C 05929400
         AGO   .ERTN020                                            @D3A 05930100
.SESS10  ANOP                                                      @D3A 05930800
         AIF   ('&SESSION' NE 'TKNUNKWN').SESS11                   @D6C 05931500
         AGO   .ERTN020                                            @D4A 05932200
.SESS11  ANOP                                                      @D4A 05932900
         AIF   ('&SESSION' NE 'INTBATCH').SESS12                   @D4A 05933600
         AGO   .ERTN020                                            @D4A 05934300
.SESS12  ANOP                                                      @D4A 05935000
         AIF   ('&SESSION' NE 'EXTBATCH').SESS13                   @D4A 05935700
         AGO   .ERTN020                                            @D4A 05936400
.SESS13  ANOP                                                      @D4A 05937100
         AIF   ('&SESSION' NE 'RJEBATCH').SESS14                   @D4A 05937800
         AGO   .ERTN020                                            @D4A 05938500
.SESS14  ANOP                                                      @D4A 05939200
         AIF   ('&SESSION' NE 'NJEBATCH').SESS15                   @D5C 05939400
         AGO   .ERTN020                                            @D4A 05939600
.SESS15  ANOP                                                      @D5A 05939800
         AIF   ('&SESSION' NE 'NJSYSOUT').SESS16                   @M3C 05939900
         AGO   .ERTN020                                            @D4A 05940000
.SESS16  ANOP                                                      @M3A 05940100
         AIF   ('&SESSION' NE 'APPCTP').SESS17                     @M9C 05940200
         AGO   .ERTN020                                            @M9A 05940300
.SESS17  ANOP                                                      @M9A 05940400
         AIF   ('&SESSION' NE 'OMVSSRV').ERR011                    @M9A 05940500
.ERTN020 ANOP                                                      @M1A 05940600
         AIF   ('&TOKNIN&STOKEN&SECLABL&SNODE&SUSERID&SGROUP&POE&LOGSTR*05941300
               &EXENODE&SESSION&TOKNOUT&POENET&X500NAME' EQ '').ERTN021 05941700
.*                                                                 @LJC 05942100
         AIF   (NOT &ICHRAC ).ERR08                                @P2A 05942500
         AIF   ('&RELEASE(1)' EQ '').ERR09                         @Q1A 05943000
         AIF   ('&RELEASE(1)'(1,3) LT '1.9').ERR09                 @Q1C 05943400
         AIF   ('&POENET' EQ '').ERTN021                           @MAA 05943600
         AIF   ('&RELEASE(1)'(1,3) LT '2.6').ERR15                 @MAA 05943800
.ERTN021 ANOP                                                      @P2A 05944100
.* --------------------------------------------------------------- @P9A 05944500
.* VALIDATE THE VALUE OF THE SUBPOOL                               @P9A 05944900
.* --------------------------------------------------------------- @P9A 05945300
.*                                                                 @P9A 05945700
         AIF   ('&SUBPOOL' EQ '').NOSPCHK                          @P9A 05946100
         AIF   ('&SUBPOOL'(1,1) EQ '(').NOSPCHK                    @P9A 05946500
         AIF   (T'&SUBPOOL NE 'N').NOSPCHK                         @P9A 05946900
         AIF   ('&SUBPOOL' GT '255').ERR013                        @P9A 05947300
.ERTN013 ANOP                                                      @P9A 05947700
.NOSPCHK ANOP                                                      @P9A 05948100
.* --------------------------------------------------------------- @M4A 05948200
.* VALIDATE THE 1.9.2 KEYWORDS                                     @M4A 05948300
.* --------------------------------------------------------------- @M4A 05948400
         AIF   ('&ENVRIN&ENVROUT' EQ '').ERTN022                   @M4A 05948500
         AIF   (NOT &ICHRAC ).ERR08                                @M4A 05948600
         AIF   ('&RELEASE(1)' EQ '').ERR12                         @M4A 05948700
         AIF   ('&RELEASE(1)'(1,5) LT '1.9.2' AND                      X05948800
                '&RELEASE(1)'(1,1) LT '2').ERR12                   @M6C 05948900
.ERTN022 ANOP                                                      @M4A 05949000
         AIF   ('&LOG' NE 'NONE').ERTN023                          @M4A 05949100
         AIF   ('&RELEASE(1)' EQ '').ERR13                         @M4A 05949200
         AIF   ('&RELEASE(1)'(1,5) LT '1.9.2' AND                      X05949300
                '&RELEASE(1)'(1,1) LT '2').ERR13                   @M6C 05949400
.ERTN023 ANOP                                                      @M4A 05949500
.*                                                                 @P9A 05949600
.* REGISTER FORM OF ADDRESS PARAMETER NOT VALID WITH LIST FORM          05950000
         AIF   ('&MF' NE 'L').ERTN01                                    06000000
         AIF   ('&USERID' EQ '').RINT010                                06050000
         AIF   ('&USERID'(1,1) EQ '(').ERR01                            06100000
.RINT010 ANOP                                                           06150000
         AIF   ('&START' EQ '').RINT020                                 06200000
         AIF   ('&START'(1,1) EQ '(').ERR01                             06250000
.RINT020 ANOP                                                           06300000
         AIF   ('&PASSWRD' EQ '').RINT028                               06350000
         AIF   ('&PASSWRD'(1,1) EQ '(').ERR01                           06400000
.RINT028 ANOP                                                           06450000
         AIF   ('&INSTLN' EQ '').RINT030                                06500000
         AIF   ('&INSTLN'(1,1) EQ '(').ERR01                            06550000
.RINT030 ANOP                                                           06600000
         AIF   ('&GROUP' EQ '').RINT031                                 06650000
         AIF   ('&GROUP'(1,1) EQ '(').ERR01                             06700000
.RINT031 ANOP                                                           06750000
         AIF   ('&NEWPASS' EQ '').RINT032                               06800000
         AIF   ('&NEWPASS'(1,1) EQ '(').ERR01                           06850000
.RINT032 ANOP                                                           06900000
         AIF   ('&PGMNAME' EQ '').RINT033                               06950000
         AIF   ('&PGMNAME'(1,1) EQ '(').ERR01                           07000000
.RINT033 ANOP                                                           07050000
         AIF   ('&ACTINFO' EQ '').RINT034                      @PC002PY 07100000
         AIF   ('&ACTINFO'(1,1) EQ '(').ERR01                  @PC002PY 07150000
.RINT034 ANOP                                                  @PC002PY 07200000
         AIF   ('&OIDCARD' EQ '').RINT035                      @PC002PY 07250000
         AIF   ('&OIDCARD'(1,1) EQ '(').ERR01                  @PC002PY 07300000
.RINT035 ANOP                                                  @PC002PY 07350000
         AIF   ('&TERMID' EQ '').RINT036                       @PC002PY 07400000
         AIF   ('&TERMID'(1,1) EQ '(').ERR01                   @PC002PY 07450000
.RINT036 ANOP                                                  @PC002PY 07500000
         AIF   ('&JOBNAME' EQ '').RINT037                      @PM44591 07550000
         AIF   ('&JOBNAME'(1,1) EQ '(').ERR01                  @PM44591 07600000
.RINT037 ANOP                                                  @PM44591 07650000
         AIF   ('&APPL' EQ '').RINT038                         @PC003PY 07700000
         AIF   ('&APPL'(1,1) EQ '(').ERR01                     @PC003PY 07750000
.RINT038 ANOP                                                  @PC003PY 07800000
         AIF   ('&ACEE' EQ '').RINT039                         @PC003PY 07850000
         AIF   ('&ACEE'(1,1) EQ '(').ERR01                     @PC003PY 07900000
.RINT039 ANOP                                                  @PC003PY 07950000
         AIF   ('&SUBPOOL' EQ '').RINT03A                          @M1C 07955800
         AIF   ('&SUBPOOL'(1,1) EQ '(').ERR01                      @M1C 07961600
.RINT03A ANOP                                                      @M1A 07967400
         AIF   ('&TOKNIN' EQ '').RINT03B                           @D2C 07973200
         AIF   ('&TOKNIN'(1,1) EQ '(').ERR01                       @D2C 07979000
.RINT03B ANOP                                                      @M1A 07984800
         AIF   ('&STOKEN' EQ '').RINT03C                           @M1A 07990600
         AIF   ('&STOKEN'(1,1) EQ '(').ERR01                       @M1A 07996400
.RINT03C ANOP                                                      @M1A 08002200
         AIF   ('&SECLABL' EQ '').RINT03D                          @M1A 08008000
         AIF   ('&SECLABL'(1,1) EQ '(').ERR01                      @M1A 08013800
.RINT03D ANOP                                                      @M1A 08019600
         AIF   ('&EXENODE' EQ '').RINT03E                          @M1A 08025400
         AIF   ('&EXENODE'(1,1) EQ '(').ERR01                      @M1A 08031200
.RINT03E ANOP                                                      @M1A 08037000
         AIF   ('&SNODE' EQ '').RINT03F                            @M1A 08042800
         AIF   ('&SNODE'(1,1) EQ '(').ERR01                        @M1A 08048600
.RINT03F ANOP                                                      @M1A 08054400
         AIF   ('&SUSERID' EQ '').RINT03G                          @M1A 08060200
         AIF   ('&SUSERID'(1,1) EQ '(').ERR01                      @M1A 08066000
.RINT03G ANOP                                                      @M1A 08071800
         AIF   ('&SGROUP' EQ '').RINT03H                           @M1A 08077600
         AIF   ('&SGROUP'(1,1) EQ '(').ERR01                       @M1A 08083400
.RINT03H ANOP                                                      @M1A 08089200
         AIF   ('&POE' EQ '').RINT03I                              @M1A 08095000
         AIF   ('&POE'(1,1) EQ '(').ERR01                          @M1A 08100800
.RINT03I ANOP                                                      @M1A 08106600
         AIF   ('&LOGSTR' EQ '').RINT03J                           @M1A 08112400
         AIF   ('&LOGSTR'(1,1) EQ '(').ERR01                       @M1A 08118200
.RINT03J ANOP                                                      @P3D 08124000
         AIF   ('&TOKNOUT' EQ '').RINT03K                          @D2A 08129800
         AIF   ('&TOKNOUT'(1,1) EQ '(').ERR01                      @D2A 08135600
.RINT03K ANOP                                                      @D2A 08141400
         AIF   ('&ENVRIN' EQ '').RINT03L                           @M4A 08142600
         AIF   ('&ENVRIN'(1,1) EQ '(').ERR01                       @M4A 08143800
.RINT03L ANOP                                                      @M4A 08145000
         AIF   ('&ENVROUT' EQ '').RINT03M                          @M4A 08146200
         AIF   ('&ENVROUT'(1,1) EQ '(').ERR01                      @M4A 08147400
.RINT03M ANOP                                                      @M4A 08148600
         AIF   ('&POENET' EQ '').RINT03N                           @MAA 08148900
         AIF   ('&POENET'(1,1) EQ '(').ERR01                       @MAA 08149200
.RINT03N ANOP                                                      @MAA 08149500
         AIF   ('&X500NAME' EQ '').RINT03P                         @L9A 08149600
         AIF   ('&X500NAME'(1,1) EQ '(').ERR01                     @L9A 08149700
.RINT03P ANOP                                                      @L9A 08149800
.ERTN01  ANOP                                                           08150000
.ERTN02  ANOP                                                           11750000
.* CHECK FOR INVALID COMBINATIONS OF ENVIR PARAMETER                    11800000
         AIF   ('&ENVIR' EQ '' OR '&ENVIR' EQ 'CREATE').RINT080         11850000
&NAME2   SETC  'X500NAME'                                          @P2M 11858300
         AIF   ('&X500NAME' NE '').ERR05                           @P2M 11866600
         AIF   ('&ENVIR' EQ 'VERIFYX').RINT080                     @M1A 11875000
         AIF   ('&ENVIR' NE 'VERIFY').RINT072                      @L6A 11900000
&NAME2   SETC  'ACEE'                                              @L6A 11950000
         AIF   ('&ACEE' NE '').ERR05                               @L6A 12000000
         AGO   .RINT080                                            @L6A 12050000
.RINT072 ANOP  ,                                                   @L6A 12100000
&NAME2   SETC  'USERID'                                                 12150000
         AIF   ('&USERID' NE '').ERR05                                  12200000
&NAME2   SETC  'PASSWRD'                                                12250000
         AIF   ('&PASSWRD' NE '').ERR05                                 12300000
&NAME2   SETC  'START'                                                  12350000
         AIF   ('&START' NE '').ERR05                                   12400000
&NAME2   SETC  'NEWPASS'                                                12450000
         AIF   ('&NEWPASS' NE '').ERR05                                 12500000
&NAME2   SETC  'PGMNAME'                                       @PC002PY 12550000
         AIF   ('&PGMNAME' NE '').ERR05                        @PC002PY 12600000
&NAME2   SETC  'ACTINFO'                                       @PC002PY 12650000
         AIF   ('&ACTINFO' NE '').ERR05                        @PC002PY 12700000
&NAME2   SETC  'OIDCARD'                                       @PC002PY 12750000
         AIF   ('&OIDCARD' NE '').ERR05                        @PC002PY 12800000
&NAME2   SETC  'TERMID'                                        @PC002PY 12850000
         AIF   ('&TERMID' NE '').ERR05                         @PC002PY 12900000
&NAME2   SETC  'JOBNAME'                                       @PM44591 12950000
         AIF   ('&JOBNAME' NE '').ERR05                        @PM44591 13000000
&NAME2   SETC  'ENVRIN'                                            @M4A 13010000
         AIF   ('&ENVRIN' NE '').ERR05                             @M4A 13020000
&NAME2   SETC  'ENVROUT'                                           @M4A 13030000
         AIF   ('&ENVROUT' NE '').ERR05                            @M4A 13040000
&NAME2   SETC  'X500NAME'                                          @L9A 13043300
         AIF   ('&X500NAME' NE '').ERR05                           @L9A 13046600
&NAME2   SETC  'GROUP'                                                  13050000
         AIF   ('&ENVIR' EQ 'CHANGE').RINT080                           13100000
         AIF   ('&GROUP' NE '').ERR05                                   13150000
.RINT080 ANOP                                                           13200000
.ERTN05  ANOP                                                           13250000
.* PRODUCE LIST FORM IF REQUESTED                                       13300000
         AIF   ('&MF' NE 'L').RINT175                                   13350000
&SYMBOL  DS    0F                                                       13400000
&NAME    EQU   *                                                        13450000
.RINT090 ANOP                                                           13500000
.* PRODUCE LIST FORM                                                    13550000
&ICHL    DC    AL1(&PARMLEN)    LIST LENGTH                    @YA24122 13600000
         AIF   ('&SUBPOOL' EQ '').RINT091                      @PC003PY 13650000
         AIF   ('&SUBPOOL'(1,1) EQ '(').RINT091                @PC003PY 13700000
         DC    AL1(&SUBPOOL)  - SUBPOOL NUMBER                 @PC003PY 13750000
&BIT3    SETA  1                SUBPOOL SPECIFIED              @PC003PY 13800000
         AGO   .RINT092                                        @PC003PY 13850000
.RINT091 ANOP                                                  @PC003PY 13900000
         DC    AL1(0)           NO SUBPOOL SPECIFIED           @PC003PY 13950000
&BIT3    SETA  0                SUBPOOL NOT SPECIFIED          @PC003PY 14000000
.RINT092 ANOP                                                  @PC003PY 14050000
.* PRODUCE FLAG BYTE 0                                             @L7A 14100000
&BIT0    SETA  0                                                   @L7A 14150000
&BIT1    SETA  0                                                   @L7A 14200000
&BIT4    SETA  0                                                   @M4A 14216600
&BIT5    SETA  0                                                   @M4A 14233200
         AIF   ('&LOC' EQ '').RINT094                              @L7A 14250000
         AIF   ('&LOC' NE 'BELOW').RINT093                         @L7A 14300000
&BIT0    SETA  1               LOC=BELOW SPECIFIED                 @L7A 14350000
         AGO   .RINT094                                            @L7A 14400000
.RINT093 ANOP                                                      @L7A 14450000
&BIT1    SETA  1               LOC=ANY SPECIFIED                   @L7A 14500000
.RINT094 ANOP                                                      @L7A 14550000
.*                                                                 @M4A 14556200
.* CHECK FOR PARAMETERS THAT ARE NOT SUPPORTED FOR SYSTEM=YES.     @M4A 14562400
.* IF ANY ARE PRESENT SET A BIT TO INDICATE THIS.                  @M4A 14568600
.*                                                                 @M4A 14574800
         AIF   ('&NEWPASS&OIDCARD&STOKEN&SNODE&SUSERID&SGROUP&EXENODE&J*14581000
               OBNAME&REMOTE&TOKNIN' EQ '').RIN192A                @M5C 14587200
&BIT4    SETA  1                                                   @M4A 14593400
.RIN192A ANOP                                                      @M4A 14599600
.*                                                                 @M4A 14605800
.* CHECK FOR LOG=NONE                                              @M4A 14612000
.*                                                                 @M4A 14618200
         AIF   ('&LOG' NE 'NONE').RIN192B                          @M4A 14624400
&BIT5    SETA  1                                                   @M4A 14630600
.RIN192B ANOP                                                      @M4A 14636800
         DC    B'&BIT0&BIT1.00&BIT4&BIT5.00'                       @M4C 14643000
.* PRODUCE FLAG BYTE 1 FROM ENVIR PARAMETER                             14650000
&BIT0    SETA  0                                                        14700000
&BIT1    SETA  0                                                        14750000
&BIT2    SETA  0                                               @PC003PY 14800000
&BIT4    SETA  0                                               @PC003PY 14850000
&BIT5    SETA  0                                                   @L6A 14900000
&BIT6    SETA  0                                                   @L6A 14950000
&BIT7    SETA  0                                                   @L6A 15000000
         AIF   ('&ENVIR' EQ '' OR '&ENVIR' EQ 'CREATE').RINT101         15050000
&BIT1    SETA  1                                                        15100000
         AIF   ('&ENVIR' EQ 'CHANGE').RINT101                           15150000
&BIT0    SETA  1                                                        15200000
         AIF   ('&ENVIR' EQ 'VERIFY').RINT101                      @L6A 15250000
&BIT1    SETA  0                                                        15300000
         AIF   ('&ENVIR' EQ 'DELETE').RINT101                           15350000
&BIT0    SETA  0                                                        15400000
.RINT101 ANOP                                                           15450000
         AIF   ('&SMC' NE 'NO').RINT102                        @PC003PY 15500000
&BIT2    SETA  1                                               @PC003PY 15550000
.RINT102 ANOP                                                  @PC003PY 15600000
         AIF   ('&PASSCHK' NE 'NO').RINT103                    @PC003PY 15650000
&BIT4    SETA  1                                               @PC003PY 15700000
.RINT103 ANOP                                                  @PC003PY 15750000
         AIF   ('&STAT' NE 'NO').RINT104                           @L6A 15800000
&BIT5    SETA  1         STAT=NO SPECIFIED                         @L6A 15850000
.RINT104 ANOP  ,                                                   @L6A 15900000
         AIF   ('&ENCRYPT' NE 'NO').RINT105                        @L6A 15950000
&BIT7    SETA  1         ENCRYPT=NO SPECIFIED                      @L6A 16000000
.RINT105 ANOP  ,                                                   @L6A 16050000
         AIF   ('&LOG' NE 'ALL').RINT106                           @L7A 16100000
&BIT6    SETA  1         LOG=ALL SPECIFIED                         @L7A 16150000
.RINT106 ANOP  ,                                                   @L7A 16200000
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'         @L6A 16250000
.* PRODUCE USERID ADDRESS                                               16300000
         AIF   ('&USERID' EQ '').RINT110                                16350000
         AIF   ('&USERID'(1,1) EQ '(').RINT110                          16400000
         DC    A(&USERID) -        USERID ADDRESS FIELD                 16450000
         AGO   .RINT120                                                 16500000
.RINT110 ANOP                                                           16550000
         DC    A(0) -              USERID ADDRESS FIELD                 16600000
.RINT120 ANOP                                                           16650000
.* PRODUCE PASSWORD  ADDRESS                                            16700000
         AIF   ('&PASSWRD' EQ '').RINT130                               16750000
         AIF   ('&PASSWRD'(1,1) EQ '(').RINT130                         16800000
         DC    A(&PASSWRD) -      PASSWORD ADDRESS FIELD                16850000
         AGO   .RINT140                                                 16900000
.RINT130 ANOP                                                           16950000
         DC    A(0) -             PASSWORD ADDRESS FIELD                17000000
.RINT140 ANOP                                                           17050000
.* PRODUCE START ADDRESS                                                17100000
         AIF   ('&START' EQ '').RINT150                                 17150000
         AIF   ('&START'(1,1) EQ '(').RINT150                           17200000
         DC    A(&START) -        PROCEDURE NAME ADDR FIELD             17250000
         AGO   .RINT160                                                 17300000
.RINT150 ANOP                                                           17350000
         DC    A(0) -             PROCEDURE NAME ADDR FIELD             17400000
.RINT160 ANOP                                                           17450000
         AIF   ('&INSTLN' EQ '').RINT161                                17500000
         AIF   ('&INSTLN'(1,1) EQ '(').RINT161                          17550000
         DC    A(&INSTLN) -       INSTALLATION PARAMETERS ADDRESS       17600000
         AGO   .RINT162                                                 17650000
.RINT161 ANOP                                                           17700000
         DC    A(0) -             INSTALLATION PARAMETERS ADDRESS       17750000
.RINT162 ANOP                                                           17800000
         AIF   ('&GROUP' EQ '').RINT163                                 17850000
         AIF   ('&GROUP'(1,1) EQ '(').RINT163                           17900000
         DC    A(&GROUP) -        GROUP ADDRESS FIELD                   17950000
         AGO   .RINT164                                                 18000000
.RINT163 ANOP                                                           18050000
         DC    A(0) -             GROUP ADDRESS FIELD                   18100000
.RINT164 ANOP                                                           18150000
         AIF   ('&NEWPASS' EQ '').RINT165                               18200000
         AIF   ('&NEWPASS'(1,1) EQ '(').RINT165                         18250000
         DC    A(&NEWPASS) -      NEW PASSWORD ADDRESS FIELD            18300000
         AGO   .RINT166                                                 18350000
.RINT165 ANOP                                                           18400000
         DC    A(0) -             NEW PASSWORD ADDRESS FIELD            18450000
.RINT166 ANOP                                                           18500000
         AIF   ('&PGMNAME' EQ '').RINT167                      @PC002PY 18550000
         AIF   ('&PGMNAME'(1,1) EQ '(').RINT167                @PC002PY 18600000
         DC    A(&PGMNAME) -      PGMNAME ADDRESS FIELD        @PC002PY 18650000
         AGO   .RINT168                                        @PC002PY 18700000
.RINT167 ANOP                                                  @PC002PY 18750000
         DC    A(0) -             PGMNAME ADDRESS FIELD        @PC002PY 18800000
.RINT168 ANOP                                                  @PC002PY 18850000
         AIF   ('&ACTINFO' EQ '').RINT169                      @PC002PY 18900000
         AIF   ('&ACTINFO'(1,1) EQ '(').RINT169                @PC002PY 18950000
         DC    A(&ACTINFO) -      ACTINFO ADDRESS FIELD        @PC002PY 19000000
         AGO   .RINT170                                        @PC002PY 19050000
.RINT169 ANOP                                                  @PC002PY 19100000
         DC    A(0) -             ACTINFO ADDRESS FIELD        @PC002PY 19150000
.RINT170 ANOP                                                  @PC002PY 19200000
         AIF   ('&OIDCARD' EQ '').RINT171                      @PC002PY 19250000
         AIF   ('&OIDCARD'(1,1) EQ '(').RINT171                @PC002PY 19300000
         DC    A(&OIDCARD) -      OIDCARD ADDRESS FIELD        @PC002PY 19350000
         AGO   .RINT172                                        @PC002PY 19400000
.RINT171 ANOP                                                  @PC002PY 19450000
         DC    A(0) -             OIDCARD ADDRESS FIELD        @PC002PY 19500000
.RINT172 ANOP                                                  @PC002PY 19550000
         AIF   ('&TERMID' EQ '').RINT173                       @PC002PY 19600000
         AIF   ('&TERMID'(1,1) EQ '(').RINT173                 @PC002PY 19650000
         DC    A(&TERMID) -       TERMID ADDRESS FIELD         @PC002PY 19700000
         AGO   .RINT174                                        @PC002PY 19750000
.RINT173 ANOP                                                  @PC002PY 19800000
         DC    A(0) -             TERMID ADDRESS FIELD         @PC002PY 19850000
.RINT174 ANOP                                                  @PC002PY 19900000
         AIF   ('&JOBNAME' EQ '').RINT17A                      @PM44591 19950000
         AIF   ('&JOBNAME'(1,1) EQ '(').RINT17A                @PM44591 20000000
         DC    A(&JOBNAME) -      JOBNAME ADDRESS FIELD        @PM44591 20050000
         AGO   .RINT17B                                        @PM44591 20100000
.RINT17A ANOP                                                  @PM44591 20150000
         DC    A(0) -             JOBNAME ADDRESS FIELD        @PM44591 20200000
.RINT17B ANOP                                                  @PM44591 20250000
         AIF   ('&APPL' EQ '').RINT17C                         @PC003PY 20300000
         AIF   ('&APPL'(1,1) EQ '(').RINT17C                   @PC003PY 20350000
         AIF   ('&APPL'(1,1) EQ '''').RINT17G                  @PC003PY 20400000
         DC    A(&APPL) -         APPL ADDRESS FIELD           @PC003PY 20450000
         AGO   .RINT17D                                        @PC003PY 20500000
.RINT17G ANOP                                                  @PC003PY 20550000
         DC    A(ICH1&SYSNDX)     APPL NAME ADDRESS            @PC003PY 20600000
         AGO   .RINT17D                                        @PC003PY 20650000
.RINT17C ANOP                                                  @PC003PY 20700000
         DC    A(0) -             APPL ADDRESS FIELD           @PC003PY 20750000
.RINT17D ANOP                                                  @PC003PY 20800000
         AIF   ('&ACEE' EQ '').RINT17E                         @PC003PY 20850000
         AIF   ('&ACEE'(1,1) EQ '(').RINT17E                   @PC003PY 20900000
         DC    A(&ACEE) -         ACEE ADDRESS FIELD           @PC003PY 20950000
         AGO   .RINT17F                                        @PC003PY 21000000
.RINT17E ANOP                                                  @PC003PY 21050000
         DC    A(0) -             ACEE ADDRESS FIELD           @PC003PY 21100000
.RINT17F ANOP                                                  @PC003PY 21150000
         AIF   ('&RELEASE(1)' EQ '').RINNO19                       @Q1A 21150800
         AIF   ('&RELEASE(1)'(1,3) LT '1.9').RINNO19               @Q1C 21151700
.* THE FOLLOWING IS PARAMETERS FOR THE UTOKEN                      @M1A 21153400
.* CHECK SESSION TYPE                                              @M1A 21155100
         AIF   ('&SESSION' EQ '').RINTSEC                          @M1A 21156800
         AIF   ('&SESSION' NE 'SYSAS').SESS10A                     @M1A 21158500
         DC    AL1(1)      SESSION = SYSTEM ADDRESS SPACE          @M1A 21160200
         AGO   .RINT10G                                            @M1A 21161900
.SESS10A ANOP                                                      @M1A 21163600
         AIF   ('&SESSION' NE 'COMMAND').SESS10B                   @M1A 21165300
         DC    AL1(2)      SESSION = COMMAND                       @M1A 21167000
         AGO   .RINT10G                                            @M1A 21168700
.SESS10B ANOP                                                      @M1A 21170400
         AIF   ('&SESSION' NE 'CONSOPER').SESS10D                  @M1A 21172100
         DC    AL1(3)      SESSION = CONSOPER                      @M1A 21173800
         AGO   .RINT10G                                            @M1A 21175500
.SESS10D ANOP                                                      @M1A 21177200
         AIF   ('&SESSION' NE 'STARTED').SESS10E                   @M1A 21178900
         DC    AL1(4)      SESSION = STARTED PROCEDURE             @M1A 21180600
         AGO   .RINT10G                                            @M1A 21182300
.SESS10E ANOP                                                      @M1A 21184000
         AIF   ('&SESSION' NE 'MOUNT').SESS10F                     @M1A 21185700
         DC    AL1(5)      SESSION = MOUNT                         @M1A 21187400
         AGO   .RINT10G                                            @M1A 21189100
.SESS10F ANOP                                                      @M1A 21190800
         AIF   ('&SESSION' NE 'TSO').SESS10G                       @M1A 21192500
         DC    AL1(6)      SESSION = TSO                           @M1A 21194200
         AGO   .RINT10G                                            @M1A 21195900
.SESS10G ANOP                                                      @M1A 21197600
         AIF   ('&SESSION' NE 'INTBATCH').SESS10H                  @D4C 21199300
         DC    AL1(7)      SESSION = INTERNAL BATCH JOB            @M1A 21201000
         AGO   .RINT10G                                            @M1A 21202700
.SESS10H ANOP                                                      @M1A 21204400
         AIF   ('&SESSION' NE 'INTXBM').SESS10I                    @D7C 21206100
         DC    AL1(8)      SESSION = INTERNAL XBM                  @D7C 21207800
         AGO   .RINT10G                                            @M1A 21209500
.SESS10I ANOP                                                      @M1A 21211200
         AIF   ('&SESSION' NE 'RJEOPER').SESS10J                   @M1A 21212900
         DC    AL1(9)      SESSION = RJEOPER                       @M1A 21214600
         AGO   .RINT10G                                            @M1A 21216300
.SESS10J ANOP                                                      @M1A 21218000
         AIF   ('&SESSION' NE 'NJEOPER').SESS10K                   @D3C 21219700
         DC    AL1(10)     SESSION = NJEOPER                       @M1A 21221400
         AGO   .RINT10G                                            @M1A 21223100
.SESS10K ANOP                                                      @D3A 21224800
         AIF   ('&SESSION' NE 'TKNUNKWN').SESS10L                  @D6C 21226500
         DC    AL1(11)     SESSION = NJE UNKNOWN USER              @D3A 21228200
         AGO   .RINT10G                                            @D3A 21229900
.SESS10L ANOP                                                      @D4A 21231600
         AIF   ('&SESSION' NE 'EXTBATCH').SESS10M                  @D4A 21233300
         DC    AL1(12)     SESSION = EXTERNAL BATCH                @D4A 21235000
         AGO   .RINT10G                                            @D4A 21236700
.SESS10M ANOP                                                      @D4A 21238400
         AIF   ('&SESSION' NE 'RJEBATCH').SESS10N                  @D4A 21240100
         DC    AL1(13)     SESSION = RJE JOB                       @D4A 21241800
         AGO   .RINT10G                                            @D4A 21243500
.SESS10N ANOP                                                      @D4A 21245200
         AIF   ('&SESSION' NE 'NJEBATCH').SESS10P                  @D5C 21246900
         DC    AL1(14)     SESSION = NJE JOB                       @D4A 21248600
         AGO   .RINT10G                                            @D4A 21250300
.SESS10P ANOP                                                      @D4A 21250600
         AIF   ('&SESSION' NE 'NJSYSOUT').SESS10Q                  @D7C 21250900
         DC    AL1(15)     SESSION = NJE SYSOUT                    @D5A 21251200
         AGO   .RINT10G                                            @D5A 21251500
.SESS10Q ANOP                                                      @D7A 21251600
         AIF   ('&SESSION' NE 'EXTXBM').SESS10R                    @D7A 21251700
         DC    AL1(16)     SESSION = EXTERNAL XBM                  @D7A 21251800
         AGO   .RINT10G                                            @D7A 21251900
.SESS10R ANOP                                                      @D7A 21252000
         AIF   ('&SESSION' NE 'RJEXBM').SESS10S                    @D7A 21252100
         DC    AL1(17)     SESSION = RJE XBM                       @D7A 21252200
         AGO   .RINT10G                                            @D7A 21252300
.SESS10S ANOP                                                      @D7A 21252400
         AIF   ('&SESSION' NE 'NJEXBM').SESS10T                    @M3C 21252500
         DC    AL1(18)     SESSION = NJE XBM                       @D7A 21252600
         AGO   .RINT10G                                            @D7A 21252700
.SESS10T ANOP                                                      @D7A 21252800
         AIF   ('&SESSION' NE 'APPCTP').SESS10U                    @M9C 21252900
         DC    AL1(19)     SESSION = APPCTP                        @M3A 21253000
         AGO   .RINT10G                                            @M3A 21253100
.SESS10U ANOP                                                      @M9A 21253200
         AIF   ('&SESSION' NE 'OMVSSRV').RINTSEC                   @M9A 21253300
         DC    AL1(20)     SESSION = OMVSSRV                       @M9A 21253400
         AGO   .RINT10G                                            @M9A 21253500
.RINTSEC ANOP                                                      @M1A 21253600
         DC    AL1(0)      SESSION                                 @M1A 21253700
.RINT10G ANOP                                                      @M1A 21255400
.* CHECK FLAG BYTE                                                 @M1A 21257100
&BIT0    SETA  0           PART OF TRUSTED COMP BASE               @M1A 21258800
&BIT1    SETA  0           JOB FROM REMOTE NODE                    @M2A 21260500
&BIT2    SETA  0           TRUSTED KEYWORD SPECIFIED               @M1A 21262200
&BIT3    SETA  0           REMOTE KEYWORD SPECIFIED                @M2A 21263900
         AIF   ('&TRUSTED' NE 'YES').RINT10H                       @M1A 21265600
&BIT0    SETA  1                                                   @M1A 21267300
.RINT10H ANOP                                                      @M1A 21269000
         AIF   ('&REMOTE' NE 'YES').RINT10K                        @M2A 21270700
&BIT1    SETA  1                                                   @M2A 21272400
.RINT10K ANOP                                                      @M2A 21274100
         AIF   ('&TRUSTED' EQ '').RINT10L                          @D1A 21275800
&BIT2    SETA  1                                                   @D1A 21277500
.RINT10L ANOP                                                      @D1A 21279200
         AIF   ('&REMOTE' EQ '').RINT10M                           @D1A 21280900
&BIT3    SETA  1                                                   @D1A 21282600
.RINT10M ANOP                                                      @D1A 21284300
         DC    B'&BIT0&BIT1&BIT2&BIT3.0000'   FLAG2                @D1C 21286000
         DC    AL2(0)      FUTURE USE                              @M1A 21287700
.* PRODUCE SECLABL ADDRESS                                         @M1A 21289400
         AIF   ('&SECLABL' EQ '').RINT19E                          @M1A 21291100
         AIF   ('&SECLABL'(1,1) EQ '(').RINT19E                    @M1A 21292800
         DC    A(&SECLABL) -       SECLABL ADDRESS FIELD           @M1A 21294500
         AGO   .RINT19F                                            @M1A 21296200
.RINT19E ANOP                                                      @M1A 21297900
         DC    A(0) -              SECLABL ADDRESS FIELD           @M1A 21299600
.RINT19F ANOP                                                      @M1A 21301300
.* PRODUCE EXENODE ADDRESS                                         @M1A 21303000
         AIF   ('&EXENODE' EQ '').RINT19G                          @M1A 21304700
         AIF   ('&EXENODE'(1,1) EQ '(').RINT19G                    @M1A 21306400
         DC    A(&EXENODE) -       EXENODE ADDRESS FIELD           @M1A 21308100
         AGO   .RINT19H                                            @M1A 21309800
.RINT19G ANOP                                                      @M1A 21311500
         DC    A(0) -              EXENODE ADDRESS FIELD           @M1A 21313200
.RINT19H ANOP                                                      @M1A 21314900
.* PRODUCE SUSERID ADDRESS                                         @M1A 21316600
         AIF   ('&SUSERID' EQ '').RINT19I                          @M1A 21318300
         AIF   ('&SUSERID'(1,1) EQ '(').RINT19I                    @M1A 21320000
         DC    A(&SUSERID) -       SUSERID ADDRESS FIELD           @M1A 21321700
         AGO   .RINT19J                                            @M1A 21323400
.RINT19I ANOP                                                      @M1A 21325100
         DC    A(0) -              SUSERID ADDRESS FIELD           @M1A 21326800
.RINT19J ANOP                                                      @M1A 21328500
.* PRODUCE SNODE ADDRESS                                           @M1A 21330200
         AIF   ('&SNODE' EQ '').RINT19K                            @M1A 21331900
         AIF   ('&SNODE'(1,1) EQ '(').RINT19K                      @M1A 21333600
         DC    A(&SNODE) -         SNODE ADDRESS FIELD             @M1A 21335300
         AGO   .RINT19L                                            @M1A 21337000
.RINT19K ANOP                                                      @M1A 21338700
         DC    A(0) -              SNODE ADDRESS FIELD             @M1A 21340400
.RINT19L ANOP                                                      @M1A 21342100
.* PRODUCE SGROUP ADDRESS                                          @M1A 21343800
         AIF   ('&SGROUP' EQ '').RINT19M                           @M1A 21345500
         AIF   ('&SGROUP'(1,1) EQ '(').RINT19M                     @M1A 21347200
         DC    A(&SGROUP) -        SGROUP ADDRESS FIELD            @M1A 21348900
         AGO   .RINT19N                                            @M1A 21350600
.RINT19M ANOP                                                      @M1A 21352300
         DC    A(0) -              SGROUP ADDRESS FIELD            @M1A 21354000
.RINT19N ANOP                                                      @M1A 21355700
.* PRODUCE POE ADDRESS                                             @M1A 21357400
         AIF   ('&POE' EQ '').RINT19O                              @M1A 21359100
         AIF   ('&POE'(1,1) EQ '(').RINT19O                        @M1A 21360800
         DC    A(&POE) -           POE ADDRESS FIELD               @M1A 21362500
         AGO   .RINT19P                                            @M1A 21364200
.RINT19O ANOP                                                      @M1A 21365900
         DC    A(0) -              POE ADDRESS FIELD               @M1A 21367600
.RINT19P ANOP                                                      @M1A 21369300
.* PRODUCE INPUT TOKEN ADDRESS                                     @D2C 21371000
         AIF   ('&TOKNIN' EQ '').RINT19Q                           @D2C 21372700
         AIF   ('&TOKNIN'(1,1) EQ '(').RINT19Q                     @D2C 21374400
         DC    A(&TOKNIN) -        INPUT TOKEN ADDRESS             @D2C 21376100
         AGO   .RINT19R                                            @M1A 21377800
.RINT19Q ANOP                                                      @M1A 21379500
         DC    A(0) -              INPUT TOKEN ADDRESS             @M1A 21381200
.RINT19R ANOP                                                      @M1A 21382900
.* PRODUCE STOKEN ADDRESS                                          @M1A 21384600
         AIF   ('&STOKEN' EQ '').RINT19S                           @M1A 21386300
         AIF   ('&STOKEN'(1,1) EQ '(').RINT19S                     @M1A 21388000
         DC    A(&STOKEN) -        STOKEN ADDRESS FIELD            @M1A 21389700
         AGO   .RINT19T                                            @M1A 21391400
.RINT19S ANOP                                                      @M1A 21393100
         DC    A(0) -              STOKEN ADDRESS FIELD            @M1A 21394800
.RINT19T ANOP                                                      @M1A 21396500
.* PRODUCE LOGSTR ADDRESS                                          @M1A 21398200
         AIF   ('&LOGSTR' EQ '').RINT19U                           @M1A 21399900
         AIF   ('&LOGSTR'(1,1) EQ '(').RINT19U                     @M1A 21401600
         DC    A(&LOGSTR) -        LOGSTR ADDRESS FIELD            @M1A 21403300
         AGO   .RINT19V                                            @M1A 21405000
.RINT19U ANOP                                                      @M1A 21406700
         DC    A(0) -              LOGSTR ADDRESS FIELD            @M1A 21408400
.RINT19V ANOP                                                      @M1A 21410100
.* PRODUCE OUTPUT TOKEN ADDRESS                                    @D2A 21411800
         AIF   ('&TOKNOUT' EQ '').RINT19W                          @D2A 21413500
         AIF   ('&TOKNOUT'(1,1) EQ '(').RINT19W                    @D2A 21415200
         DC    A(&TOKNOUT) -       OUTPUT TOKEN ADDRESS            @D2A 21416900
         AGO   .RINT19X                                            @D2A 21418600
.RINT19W ANOP                                                      @M1A 21420300
         DC    A(0) -              OUTPUT TOKEN ADDRESS            @D2A 21422000
.RINT19X ANOP                                                      @D2A 21423700
         AIF   ('&RELEASE(1)' EQ '').RINNO19                       @M4A 21423800
         AIF   ('&RELEASE(1)'(1,5) LT '1.9.2' AND                      X21423900
                '&RELEASE(1)'(1,1) LT '2').RINNO19                 @M6C 21424000
.*                                                                 @M4A 21424100
.* CHECK FOR ENVRIN                                                @M4A 21424200
.*                                                                 @M4A 21424300
         AIF   ('&ENVRIN' EQ '').RIN192C                           @M4A 21424400
         AIF   ('&ENVRIN'(1,1) EQ '(').RIN192C                     @M4A 21424500
         DC    A(&ENVRIN) -         ENVRIN ADDRESS                 @M4A 21424600
         AGO   .RIN192D                                            @M4A 21424700
.RIN192C ANOP                                                      @M4A 21424800
         DC    A(0) -               ENVRIN ADDRESS                 @M4A 21424900
.RIN192D ANOP                                                      @M4A 21425000
.*                                                                 @M4A 21425100
.* CHECK FOR ENVROUT                                               @M4A 21425200
.*                                                                 @M4A 21425300
         AIF   ('&ENVROUT' EQ '').RIN192E                          @M4A 21425400
         AIF   ('&ENVROUT'(1,1) EQ '(').RIN192E                    @M4A 21425500
         DC    A(&ENVROUT) -        ENVROUT ADDRESS                @M4A 21425600
         AGO   .RIN192F                                            @M4A 21425700
.RIN192E ANOP                                                      @M4A 21425800
         DC    A(0) -               ENVROUT ADDRESS                @M4A 21425900
.RIN192F ANOP                                                      @M4A 21426000
         AIF   ('&RELEASE(1)' EQ '').RINNO26                       @Q3A 21426100
         AIF   ('&RELEASE(1)'(1,3) LT '2.6').RINNO26               @Q3A 21426200
.*                                                                 @M4A 21426300
.* PRODUCE POENET ADDRESS                                          @MAA 21426400
         AIF   ('&POENET' EQ '').RINT26O                           @MAA 21426500
         AIF   ('&POENET'(1,1) EQ '(').RINT26O                     @MAA 21426600
         DC    A(&POENET) -        POENET ADDRESS FIELD            @MAA 21426700
         AGO   .RINT26P                                            @MAA 21426800
.RINT26O ANOP                                                      @MAA 21426900
         DC    A(0) -              POENET ADDRESS FIELD            @MAA 21427000
.RINT26P ANOP                                                      @MAA 21427100
.*                                                                 @L9A 21427200
.* PRODUCE X500NAME                                                @L9A 21427300
.*                                                                 @L9A 21427400
         AIF   ('&RELEASE(1)' EQ '').RINNO26                       @L9A 21427500
         AIF   ('&RELEASE(1)'(1,4) LT '7703').RINNO26              @L9A 21427600
         AIF   ('&X500NAME' EQ '').X500260                         @P4C 21427700
         AIF   ('&X500NAME'(1,1) EQ '(').X500260                   @L9A 21427800
         DC    A(&X500NAME) - X500NAME ADDRESS FIELD               @L9A 21427900
         AGO   .RINNO26                                            @L9A 21428000
.X500260 ANOP                                                      @P3C 21428100
         DC    A(0) -              X500NAME FIELD                  @L9A 21428200
.RINNO26 ANOP                                                      @Q3A 21428300
.RINNO19 ANOP                                                      @MAA 21428400
.* IF APPL NAME SPECIFIED EXPLICITLY, PRODUCE IT BELOW LIST        @P5M 21428500
         AIF   ('&APPL' EQ '').RINT17H                             @P5M 21428800
         AIF   ('&APPL'(1,1) NE '''').RINT17H                      @P5M 21430500
ICH1&SYSNDX DC    CL8&APPL                                         @P5M 21432200
.RINT17H ANOP                                                      @P5M 21433900
         AIF   (&MFFLAG).RINT221                                        21450000
         MEXIT                                                          21500000
.RINT175 ANOP                                                           21550000
.* TEST FOR OTHER MACRO FORMS                                           21600000
         AIF   ('&MF' EQ 'S').RINT180                                   21650000
         AIF   ('&MF'(1,2) EQ '(E').RINT230                        @M1C 21683300
         AIF   ('&MF'(1,2) EQ '(M').RINT230                        @P1A 21716600
         AGO   .ERR04                                                   21750000
.ERTN04  ANOP                                                           21800000
.RINT180 ANOP                                                           21850000
.* PRODUCE STANDARD FORM                                                21900000
&MFFLAG  SETB  1     SET TRUE FOR MF=S PASS THROUGH LIST CODE           21950000
&SYMBOL  DS    0H                                                       22000000
.* PRODUCE CODE TO MODIFY INLINE LIST FORM                              22050000
         AIF   ('&SUBPOOL' EQ '').RINT189                               22100000
         AIF   ('&SUBPOOL'(1,1) NE '(').RINT189                         22150000
         STC   &SUBPOOL(1),&NAME+1 -   STORE SUBPOOL NUMBER             22200000
.RINT189 ANOP                                                           22250000
         AIF   ('&USERID' EQ '').RINT190                                22300000
         AIF   ('&USERID'(1,1) NE '(').RINT190                          22350000
         ST    &USERID(1),&NAME+4 -    STORE USERID ADDRESS             22400000
.RINT190 ANOP                                                           22450000
         AIF   ('&PASSWRD' EQ '').RINT200                               22500000
         AIF   ('&PASSWRD'(1,1) NE '(').RINT200                         22550000
         ST    &PASSWRD(1),&NAME+8 -    STORE PASSWORD ADDRESS          22600000
.RINT200 ANOP                                                           22650000
         AIF   ('&START' EQ '').RINT210                                 22700000
         AIF   ('&START'(1,1) NE '(').RINT210                           22750000
         ST    &START(1),&NAME+12 -    STORE PROC ADDRESS               22800000
.RINT210 ANOP                                                           22850000
         AIF   ('&INSTLN' EQ '').RINT215                                22900000
         AIF   ('&INSTLN'(1,1) NE '(').RINT215                          22950000
         ST    &INSTLN(1),&NAME+16 -  STORE INSTALLATION PARM ADDRESS   23000000
.RINT215 ANOP                                                           23050000
         AIF   ('&GROUP' EQ '').RINT216                                 23100000
         AIF   ('&GROUP'(1,1) NE '(').RINT216                           23150000
         ST    &GROUP(1),&NAME+20 -  STORE GROUP ADDRESS                23200000
.RINT216 ANOP                                                           23250000
         AIF   ('&NEWPASS' EQ '').RINT217                               23300000
         AIF   ('&NEWPASS'(1,1) NE '(').RINT217                         23350000
         ST    &NEWPASS(1),&NAME+24 - STORE NEW PASSWORD ADDRESS        23400000
.RINT217 ANOP                                                           23450000
         AIF   ('&PGMNAME' EQ '').RINT218                      @PC002PY 23500000
         AIF   ('&PGMNAME'(1,1) NE '(').RINT218                @PC002PY 23550000
         ST    &PGMNAME(1),&NAME+28 - STORE PGMNAME ADDRESS    @PC002PY 23600000
.RINT218 ANOP                                                  @PC002PY 23650000
         AIF   ('&ACTINFO' EQ '').RINT219                      @PC002PY 23700000
         AIF   ('&ACTINFO'(1,1) NE '(').RINT219                @PC002PY 23750000
         ST    &ACTINFO(1),&NAME+32 - STORE ACTINFO ADDRESS    @PC002PY 23800000
.RINT219 ANOP                                                  @PC002PY 23850000
         AIF   ('&OIDCARD' EQ '').RINT220                      @PC002PY 23900000
         AIF   ('&OIDCARD'(1,1) NE '(').RINT220                @PC002PY 23950000
         ST    &OIDCARD(1),&NAME+36 - STORE OIDCARD ADDRESS    @PC002PY 24000000
.RINT220 ANOP                                                  @PC002PY 24050000
         AIF   ('&TERMID' EQ '').RINT22A                       @PC002PY 24100000
         AIF   ('&TERMID'(1,1) NE '(').RINT22A                 @PC002PY 24150000
         ST    &TERMID(1),&NAME+40 - STORE TERMID ADDRESS      @PC002PY 24200000
.RINT22A ANOP                                                  @PC002PY 24250000
         AIF   ('&JOBNAME' EQ '').RINT22B                      @PM44591 24300000
         AIF   ('&JOBNAME'(1,1) NE '(').RINT22B                @PM44591 24350000
         ST    &JOBNAME(1),&NAME+44 - STORE JOBNAME ADDRESS    @PM44591 24400000
.RINT22B ANOP                                                  @PM44591 24450000
         AIF   ('&APPL' EQ '').RINT22C                         @PC003PY 24500000
         AIF   ('&APPL'(1,1) NE '(').RINT22C                   @PC003PY 24550000
         ST    &APPL(1),&NAME+48 - STORE APPL ADDRESS          @PC003PY 24600000
.RINT22C ANOP                                                  @PC003PY 24650000
         AIF   ('&ACEE' EQ '').RINT22D                         @PC003PY 24700000
         AIF   ('&ACEE'(1,1) NE '(').RINT22D                   @PC003PY 24750000
         ST    &ACEE(1),&NAME+52 - STORE ACEE ADDRESS          @PC003PY 24800000
.RINT22D ANOP                                                  @PC003PY 24850000
         AIF   ('&SECLABL' EQ '').RINT22G                          @M1A 24851200
         AIF   ('&SECLABL'(1,1) NE '(').RINT22G                    @M1A 24852400
         ST    &SECLABL(1),&NAME+60 - STORE SECLABL ADDRESS        @M1A 24853600
.RINT22G ANOP                                                      @M1A 24854800
         AIF   ('&EXENODE' EQ '').RINT22H                          @M1A 24856000
         AIF   ('&EXENODE'(1,1) NE '(').RINT22H                    @M1A 24857200
         ST    &EXENODE(1),&NAME+64 - STORE EXENODE ADDRESS        @M1A 24858400
.RINT22H ANOP                                                      @M1A 24859600
         AIF   ('&SUSERID' EQ '').RINT22I                          @M1A 24860800
         AIF   ('&SUSERID'(1,1) NE '(').RINT22I                    @M1A 24862000
         ST    &SUSERID(1),&NAME+68 - STORE SUSERID ADDRESS        @M1A 24863200
.RINT22I ANOP                                                      @M1A 24864400
         AIF   ('&SNODE' EQ '').RINT22J                            @M1A 24865600
         AIF   ('&SNODE'(1,1) NE '(').RINT22J                      @M1A 24866800
         ST    &SNODE(1),&NAME+72 - STORE SNODE ADDRESS            @M1A 24868000
.RINT22J ANOP                                                      @M1A 24869200
         AIF   ('&SGROUP' EQ '').RINT22K                           @M1A 24870400
         AIF   ('&SGROUP'(1,1) NE '(').RINT22K                     @M1A 24871600
         ST    &SGROUP(1),&NAME+76 - STORE SGROUP ADDRESS          @M1A 24872800
.RINT22K ANOP                                                      @M1A 24874000
         AIF   ('&POE' EQ '').RINT22L                              @M1A 24875200
         AIF   ('&POE'(1,1) NE '(').RINT22L                        @M1A 24876400
         ST    &POE(1),&NAME+80 - STORE POE ADDRESS                @M1A 24877600
.RINT22L ANOP                                                      @M1A 24878800
         AIF   ('&TOKNIN' EQ '').RINT22M                           @D2C 24880000
         AIF   ('&TOKNIN'(1,1) NE '(').RINT22M                     @D2C 24881200
         ST    &TOKNIN(1),&NAME+84 -  STORE INPUT TOKEN ADDRESS    @D2C 24882400
.RINT22M ANOP                                                      @M1A 24883600
         AIF   ('&STOKEN' EQ '').RINT22N                           @M1A 24884800
         AIF   ('&STOKEN'(1,1) NE '(').RINT22N                     @M1A 24886000
         ST    &STOKEN(1),&NAME+88 - STORE STOKEN ADDRESS          @M1A 24887200
.RINT22N ANOP                                                      @M1A 24888400
         AIF   ('&LOGSTR' EQ '').RINT22O                           @M1A 24889600
         AIF   ('&LOGSTR'(1,1) NE '(').RINT22O                     @M1A 24890800
         ST    &LOGSTR(1),&NAME+92 - STORE LOGSTR ADDRESS          @M1A 24892000
.RINT22O ANOP                                                      @M1A 24893200
         AIF   ('&TOKNOUT' EQ '').RINT22Q                          @D2A 24894400
         AIF   ('&TOKNOUT'(1,1) NE '(').RINT22Q                    @D2A 24895600
         ST    &TOKNOUT(1),&NAME+96 - STORE OUTPUT TOKEN ADDRESS   @D2A 24896800
.RINT22Q ANOP                                                      @D2A 24898000
         AIF   ('&ENVRIN' EQ '').RINT22R                           @M4A 24898200
         AIF   ('&ENVRIN'(1,1) NE '(').RINT22R                     @M4A 24898400
         ST    &ENVRIN(1),&NAME+100 - STORE ENVR D.S. ADDRESS      @M4A 24898600
.RINT22R ANOP                                                      @M4A 24898800
         AIF   ('&ENVROUT' EQ '').RINT22S                          @M4A 24899000
         AIF   ('&ENVROUT'(1,1) NE '(').RINT22S                    @M4A 24899200
         ST    &ENVROUT(1),&NAME+104 - STORE ENVR D.S. ADDRESS     @M4A 24899400
.RINT22S ANOP                                                      @M4A 24899600
         AIF   ('&POENET' EQ '').RINT22T                           @MAA 24908000
         AIF   ('&POENET'(1,1) NE '(').RINT22T                     @MAA 24916400
         ST    &POENET(1),&NAME+108 - STORE POENET ADDRESS         @MAA 24924800
.RINT22T ANOP                                                      @MAA 24933200
         AIF   ('&X500NAME' EQ '').RINT22U                         @L9A 24934800
         AIF   ('&X500NAME'(1,1) NE '(').RINT22U                   @L9A 24936400
         ST    &X500NAME(1),&NAME+112 - STORE X500NAME             @L9A 24938000
.RINT22U ANOP                                                      @L9A 24939600
.* LIST FORM MODIFICATION COMPLETE -PRODUCE LIST FORM WITH BAL AROUND   24941600
         CNOP  0,4            ALIGN LIST FORM                           24950000
         AIF   ('&APPL' EQ '').RINT22P                         @PC003PY 25000000
         AIF   ('&APPL'(1,1) NE '''').RINT22P                  @PC003PY 25050000
         BAL   1,ICH&SYSNDX.A POINT REG 1 AT LIST FORM             @P6C 25100000
&NAME    EQU   *                                                        25150000
         AGO   .RINT090  PRODUCE LIST FORM                     @PC003PY 25200000
.RINT22P ANOP                                                  @PC003PY 25250000
         BAL   1,ICH&SYSNDX.A POINT REG 1 AT LIST FORM             @P6C 25300000
&NAME    EQU   *                                                        25350000
         AGO   .RINT090   PRODUCE LIST FORM AND RETURN VIA MFFLAG       25400000
.RINT221 ANOP                                                           25450000
ICH&SYSNDX.A DS 0H                                                 @P6C 25475000
.***********************************************************       @T1A 25500000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 25550000
.* MACRO, SIMPLY EXIT RATHER THAN GOING TO THE RACF ROUTINE.       @T1A 25600000
.***********************************************************       @T1A 25650000
         AIF   (&ICHRAC).RINT225                                   @T1A 25700000
         AIF   ('&MF'(1,2) EQ '(M').RINT225   SKIP SVC IF MF=M     @P1A 25725000
         L     15,16(0,0)            GET CVT ADDRESS                    25750000
         L     15,X'3E0'(0,15)       GET RACF CVT ADDRESS               25800000
         LTR   15,15                 RACF CVT EXIST                     25850000
         BZ    *+12                  NO, BRANCH TO SET RC               25900000
         TM    X'35'(15),X'80'       RACF ACTIVE                        25950000
         BNO   *+12                  YES, BRANCH                        26000000
         LA    15,32(0,0)            RACF NOT ACTIVE RET CODE           26050000
         B     *+6                   SKIP SVC                           26100000
         SVC   131                   ISSUE RACINIT SVC                  26150000
         AIF   (NOT &RLVLCHK).RINT225                          @YA24122 26166600
&ICHRLVL DS    0H                                              @YA24122 26183200
.RINT225 ANOP                                                      @T1A 26200000
         MEXIT                                                          26250000
.* STANDARD FORM COMPLETE- PRODUCE EXECUTE FORM IF REQUESTED            26300000
.RINT230 ANOP                                                           26350000
         AIF   (&ICHRAC).RINT23A                                   @T1A 26400000
&SYMBOL  IHBINNRA &MF(2)   LOAD REG1 WITH LIST ADDRESS                  26450000
         AGO   .RINT23B                                            @T1A 26500000
.**************************************************************    @T1A 26550000
.*  IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE MACRO,    @T1A 26600000
.*  PICK UP THE ADDRESS OF THE RACINIT  PARAMETER LIST FROM THE    @T1A 26650000
.*  RACROUTE PARAMETER LIST.                                       @T1A 26700000
.**************************************************************    @T1A 26750000
.RINT23A ANOP                                                      @T1A 26800000
         A     1,36(1)               POINT REG1 AT RACINIT LIST    @T1A 26850000
.RINT23B ANOP                                                      @T1A 26900000
.* IF REQUESTED, CHECK SIZE OF LIST-FORM VS. EXECUTE-FORM      @YA24122 26906200
         AIF   (NOT &RLVLCHK).RINT23D                          @YA24122 26912400
         CLI   0(1),&PARMLEN             L-FORM LARGE ENOUGH   @YA24122 26918600
         BNL   *+12                      YES                   @YA24122 26924800
         LA    15,100              SET INCOMPATIBLE MACRO R.C. @YA24122 26931000
         B     &ICHRLVL                                        @YA24122 26937200
.RINT23D ANOP                                                  @YA24122 26943400
         AIF   ('&SUBPOOL' EQ '').RINT232                      @PC003PY 26950000
         AIF   ('&SUBPOOL'(1,1) EQ '(').RINT231                @PC003PY 27000000
         MVI   1(1),&SUBPOOL       - SET SUBPOOL NUMBER        @PC003PY 27050000
         AGO   .RINT232                                        @PC003PY 27100000
.RINT231 ANOP                                                  @PC003PY 27150000
         STC   &SUBPOOL(1),1(1) -   STORE SUBPOOL NUMBER       @PC003PY 27200000
.RINT232 ANOP                                                  @PC003PY 27250000
.* MODIFY LIST FLAG 0 FIELD AS REQUESTED                         @L7A   27300000
&BIT0    SETA  0                     LOC FLAG                    @L7A   27350000
&BIT1    SETA  0                     LOC FLAG                    @L7A   27400000
&BIT4    SETA  0                                                   @M4A 27416600
&BIT5    SETA  0                                                   @M4A 27433200
&BIX0    SETA  1                     LOC FLAG                    @L7A   27450000
&BIX1    SETA  1                     LOC FLAG                    @L7A   27500000
&BIX4    SETA  1                                                   @M4A 27525000
&BIX5    SETA  1                                                   @M4A 27550000
         AIF   ('&LOC' EQ '').RINT23E                              @M4C 27575000
&BIX0    SETA  0             LOC SPECIFIED                       @L7A   27600000
&BIX1    SETA  0             LOC SPECIFIED                       @L7A   27650000
         AIF   ('&LOC' NE 'BELOW').RINT23C                       @L7A   27700000
&BIT0    SETA  1             LOC=BELOW SPECIFIED                 @L7A   27750000
         AGO   .RINT23E                                            @M4C 27800000
.RINT23C ANOP  ,                                                 @L7A   27850000
&BIT1    SETA  1             LOC=ANY SPECIFIED                   @L7A   27900000
.RINT23E ANOP  ,                                                   @M4C 27910000
.*                                                                 @M4A 27920000
.* CHECK FOR PARAMETERS THAT ARE NOT SUPPORTED FOR SYSTEM=YES.     @M4A 27930000
.* IF ANY ARE PRESENT SET A BIT TO INDICATE THIS.                  @M4A 27940000
.*                                                                 @M4A 27950000
         AIF   ('&NEWPASS&OIDCARD&STOKEN&SNODE&SUSERID&SGROUP&EXENODE&J*27960000
               OBNAME&REMOTE&TOKNIN' EQ '').RINT23F                @M5C 27970000
&BIT4    SETA  1                                                   @M4A 27980000
.RINT23F ANOP                                                      @M4A 27990000
.*                                                                 @M4A 28000000
.* CHECK FOR LOG=NONE                                              @M4A 28010000
.*                                                                 @M4A 28020000
         AIF   ('&LOG' EQ '').RINT23G                              @M4A 28030000
&BIX5    SETA  0                                                   @M4A 28040000
         AIF   ('&LOG' NE 'NONE').RINT23G                          @M4A 28050000
&BIT5    SETA  1                                                   @M4A 28060000
.RINT23G ANOP                                                      @M4A 28070000
         AIF   ('&BIX0&BIX1&BIX4&BIX5' EQ '1111').RINT23N          @M4C 28080000
         NI    2(1),B'&BIX0&BIX1.11&BIX4&BIX5.11'                  @M4C 28090000
.RINT23N ANOP  ,                                                 @L7A   28100000
         AIF   ('&BIT0&BIT1&BIT4&BIT5' EQ '0000').RINT23O          @M4C 28150000
         OI    2(1),B'&BIT0&BIT1.00&BIT4&BIT5.00'                  @M4C 28200000
.RINT23O ANOP  ,                                                 @L7A   28250000
.* MODIFY LIST FLAG FIELD AS REQUESTED                                  28300000
&BIT0    SETA  0                     ENVIR FLAG                         28350000
&BIT1    SETA  0                     ENVIR FLAG                         28400000
&BIT2    SETA  0                     SMC FLAG                  @PC003PY 28450000
&BIT3    SETA  0                     SUBPOOL FLAG              @PC003PY 28500000
&BIT4    SETA  0                     PASSCHK FLAG              @PC003PY 28550000
&BIT5    SETA  0                     STAT FLAG                     @L6A 28600000
&BIT6    SETA  0                     LOG FLAG                      @L7A 28650000
&BIT7    SETA  0                     ENCRYPT FLAG                  @L6A 28700000
&BIX0    SETA  1                     ENVIR FLAG                @PC003PY 28750000
&BIX1    SETA  1                     ENVIR FLAG                @PC003PY 28800000
&BIX2    SETA  1                     NEGATIVE SMC FLAG         @PC003PY 28850000
&BIX3    SETA  1                     NEGATIVE SUBPOOL FLAG     @PC003PY 28900000
&BIX4    SETA  1                     NEGATIVE PASSCHK FLAG     @PC003PY 28950000
&BIX5    SETA  1                     NEGATIVE STAT FLAG            @L6A 29000000
&BIX6    SETA  1                     NEGATIVE LOG FLAG             @L7A 29050000
&BIX7    SETA  1                     NEGATIVE ENCRYPT FLAG         @L6A 29100000
         AIF   ('&ENVIR' EQ '' AND '&SMC' EQ '' AND '&SUBPOOL' EQ ''   *29150000
               AND '&PASSCHK' EQ '' AND '&STAT' EQ '' AND              *29200000
               '&ENCRYPT' EQ '' AND '&LOG' EQ '').RINT257          @L7A 29250000
         AIF   ('&ENVIR' EQ '').RINT251                                 29300000
&BIX0    SETA  0                     NEGATIVE ENVIR FLAG       @PC003PY 29350000
&BIX1    SETA  0                     NEGATIVE ENVIR FLAG       @PC003PY 29400000
         AIF   ('&ENVIR' EQ 'CREATE').RINT251                  @PC003PY 29450000
&BIT1    SETA  1                                               @PC003PY 29500000
         AIF   ('&ENVIR' EQ 'CHANGE').RINT251                  @PC003PY 29550000
&BIT0    SETA  1                                               @PC003PY 29600000
         AIF   ('&ENVIR' EQ 'VERIFY').RINT251                      @L6A 29650000
&BIT1    SETA  0                                               @PC003PY 29700000
         AIF   ('&ENVIR' EQ 'DELETE').RINT251                  @PC003PY 29750000
&BIT0    SETA  0                                               @PC003PY 29800000
.RINT251 ANOP                                                  @PC003PY 29850000
         AIF   ('&SMC' EQ '').RINT252                          @PC003PY 29900000
&BIX2    SETA  0                                               @PC003PY 29950000
         AIF   ('&SMC' NE 'NO').RINT252                        @PC003PY 30000000
&BIT2    SETA  1                     SMC FLAG                  @PC003PY 30050000
.RINT252 ANOP                                                  @PC003PY 30100000
         AIF   ('&SUBPOOL' EQ '').RINT253                      @PC003PY 30150000
&BIT3    SETA  1                     SMC FLAG                  @PC003PY 30200000
&BIX3    SETA  0                                               @PC003PY 30250000
.RINT253 ANOP                                                  @PC003PY 30300000
         AIF   ('&PASSCHK' EQ '').RINT254                      @PC003PY 30350000
&BIX4    SETA  0                                               @PC003PY 30400000
         AIF   ('&PASSCHK' NE 'NO').RINT254                    @PC003PY 30450000
&BIT4    SETA  1                     PASSCHK FLAG              @PC003PY 30500000
.RINT254 ANOP                                                  @PC003PY 30550000
         AIF   ('&STAT' EQ '').RINT255                             @L6A 30600000
&BIX5    SETA  0                                                   @L6A 30650000
         AIF   ('&STAT' NE 'NO').RINT255                           @L6A 30700000
&BIT5    SETA  1          STAT=NO SPECIFIED                        @L6A 30750000
.RINT255 ANOP                                                           30800000
         AIF   ('&ENCRYPT' EQ '').RINT256                          @L6A 30850000
&BIX7    SETA  0                                                   @L6A 30900000
         AIF   ('&ENCRYPT' NE 'NO').RINT256                        @L6A 30950000
&BIT7    SETA  1          ENCRYPT=NO SPECIFIED                     @L6A 31000000
.RINT256 ANOP  ,                                                   @L6A 31050000
         AIF   ('&LOG' EQ '').RINT25A                              @L7A 31100000
&BIX6    SETA  0                                                   @L7A 31150000
         AIF   ('&LOG' NE 'ALL').RINT25A                           @L7A 31200000
&BIT6    SETA  1          LOG=ALL SPECIFIED                        @L7A 31250000
.RINT25A ANOP                                                      @L7A 31300000
         NI    3(1),B'&BIX0&BIX1&BIX2&BIX3&BIX4&BIX5&BIX6&BIX7'    @L6A 31350000
         OI    3(1),B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'    @L6A 31400000
.RINT257 ANOP  ,                                                   @L6A 31450000
.* MODIFY ADDRESS PARAMETERS AS REQUIRED                                31500000
         AIF   ('&USERID' EQ '').RINT270                                31550000
         AIF   ('&USERID'(1,1) NE '(').RINT260                          31600000
         ST    &USERID(1),4(1) -   STORE USERID ADDRESS                 31650000
         AGO   .RINT270                                                 31700000
.RINT260 ANOP                                                           31750000
         LA    0,&USERID         MOVE USERID ADDRESS INTO               31800000
         ST    0,4(1) -             PARM LIST                           31850000
.RINT270 ANOP                                                           31900000
         AIF   ('&PASSWRD' EQ '').RINT290                               31950000
         AIF   ('&PASSWRD'(1,1) NE '(').RINT280                         32000000
         ST    &PASSWRD(1),8(1) -     STORE PASSWORD ADDRESS            32050000
         AGO   .RINT290                                                 32100000
.RINT280 ANOP                                                           32150000
         LA    0,&PASSWRD            MOVE PASSWORD ADDRESS              32200000
         ST    0,8(1) -        INTO PARM LIST                           32250000
.RINT290 ANOP                                                           32300000
         AIF   ('&START' EQ '').RINT310                                 32350000
         AIF   ('&START'(1,1) NE '(').RINT300                           32400000
         ST    &START(1),12(1) -    STORE PROC NAME ADDRESS             32450000
         AGO   .RINT310                                                 32500000
.RINT300 ANOP                                                           32550000
         LA    0,&START            MOVE PROCNAME ADDRESS INTO           32600000
         ST    0,12(1) -        INTO PARM LIST                          32650000
.RINT310 ANOP                                                           32700000
         AIF   ('&INSTLN' EQ '').RINT330                                32750000
         AIF   ('&INSTLN'(1,1) NE '(').RINT320                          32800000
         ST    &INSTLN(1),16(1)  -    SET INSTALLATION PARM ADDRESS     32850000
         AGO   .RINT330                                                 32900000
.RINT320 ANOP                                                           32950000
         LA    0,&INSTLN           MOVE INSTALLATION ADDRESS            33000000
         ST    0,16(1)              INTO PARM LIST                      33050000
.RINT330 ANOP                                                           33100000
         AIF   ('&GROUP' EQ '').RINT332                                 33150000
         AIF   ('&GROUP'(1,1) NE '(').RINT331                           33200000
         ST    &GROUP(1),20(1)    SET GROUP PARM ADDRESS                33250000
         AGO   .RINT332                                                 33300000
.RINT331 ANOP                                                           33350000
         LA    0,&GROUP           MOVE GROUP ADDRESS                    33400000
         ST    0,20(1)            INTO PARM LIST                        33450000
.RINT332 ANOP                                                           33500000
         AIF   ('&NEWPASS' EQ '').RINT334                               33550000
         AIF   ('&NEWPASS'(1,1) NE '(').RINT333                         33600000
         ST    &NEWPASS(1),24(1)  SET NEW PASSWORD ADDRESS              33650000
         AGO   .RINT334                                                 33700000
.RINT333 ANOP                                                           33750000
         LA    0,&NEWPASS         MOVE NEW PASSWORD ADDRESS             33800000
         ST    0,24(1)            INTO PARM LIST                        33850000
.RINT334 ANOP                                                           33900000
         AIF   ('&PGMNAME' EQ '').RINT336                      @PC002PY 33950000
         AIF   ('&PGMNAME'(1,1) NE '(').RINT335                @PC002PY 34000000
         ST    &PGMNAME(1),28(1)  SET PGMNAME ADDRESS          @PC002PY 34050000
         AGO   .RINT336                                        @PC002PY 34100000
.RINT335 ANOP                                                  @PC002PY 34150000
         LA    0,&PGMNAME         MOVE PGMNAME ADDRESS         @PC002PY 34200000
         ST    0,28(1)            INTO PARM LIST               @PC002PY 34250000
.RINT336 ANOP                                                  @PC002PY 34300000
         AIF   ('&ACTINFO' EQ '').RINT338                      @PC002PY 34350000
         AIF   ('&ACTINFO'(1,1) NE '(').RINT337                @PC002PY 34400000
         ST    &ACTINFO(1),32(1)  SET ACTINFO ADDRESS          @PC002PY 34450000
         AGO   .RINT338                                        @PC002PY 34500000
.RINT337 ANOP                                                  @PC002PY 34550000
         LA    0,&ACTINFO         MOVE ACTINFO ADDRESS         @PC002PY 34600000
         ST    0,32(1)            INTO PARM LIST               @PC002PY 34650000
.RINT338 ANOP                                                  @PC002PY 34700000
         AIF   ('&OIDCARD' EQ '').RINT340                      @PC002PY 34750000
         AIF   ('&OIDCARD'(1,1) NE '(').RINT339                @PC002PY 34800000
         ST    &OIDCARD(1),36(1) SET OIDCARD ADDRESS           @PC002PY 34850000
         AGO   .RINT340                                        @PC002PY 34900000
.RINT339 ANOP                                                  @PC002PY 34950000
         LA    0,&OIDCARD     MOVE OIDCARD ADDRESS             @PC002PY 35000000
         ST    0,36(1)            INTO PARM LIST               @PC002PY 35050000
.RINT340 ANOP                                                  @PC002PY 35100000
         AIF   ('&TERMID' EQ '').RINT342                       @PC002PY 35150000
         AIF   ('&TERMID'(1,1) NE '(').RINT341                 @PC002PY 35200000
         ST    &TERMID(1),40(1) SET TERMID ADDRESS             @PC002PY 35250000
         AGO   .RINT342                                        @PC002PY 35300000
.RINT341 ANOP                                                  @PC002PY 35350000
         LA    0,&TERMID      MOVE TERMID ADDRESS              @PC002PY 35400000
         ST    0,40(1)            INTO PARM LIST               @PC002PY 35450000
.RINT342 ANOP                                                  @PC002PY 35500000
         AIF   ('&JOBNAME' EQ '').RINT344                      @PM44591 35550000
         AIF   ('&JOBNAME'(1,1) NE '(').RINT343                @PM44591 35600000
         ST    &JOBNAME(1),44(1) SET JOBNAME ADDRESS           @PM44591 35650000
         AGO   .RINT344                                        @PM44591 35700000
.RINT343 ANOP                                                  @PM44591 35750000
         LA    0,&JOBNAME     MOVE JOBNAME ADDRESS             @PM44591 35800000
         ST    0,44(1)            INTO PARM LIST               @PM44591 35850000
.RINT344 ANOP                                                  @PM44591 35900000
         AIF   ('&APPL' EQ '').RINT346                         @PC003PY 35950000
         AIF   ('&APPL'(1,1) EQ '''').ERR06                    @PC003PY 36000000
         AIF   ('&APPL'(1,1) NE '(').RINT345                   @PC003PY 36050000
         ST    &APPL(1),48(1) SET APPL ADDRESS                 @PC003PY 36100000
         AGO   .RINT346                                        @PC003PY 36150000
.RINT345 ANOP                                                  @PC003PY 36200000
         LA    0,&APPL        MOVE APPL ADDRESS                @PC003PY 36250000
         ST    0,48(1)            INTO PARM LIST               @PC003PY 36300000
.ERTN06  ANOP                                                  @PC003PY 36350000
.RINT346 ANOP                                                  @PC003PY 36400000
         AIF   ('&ACEE' EQ '').RINT348                         @PC003PY 36450000
         AIF   ('&ACEE'(1,1) NE '(').RINT347                   @PC003PY 36500000
         ST    &ACEE(1),52(1) SET ACEE ADDRESS                 @PC003PY 36550000
         AGO   .RINT348                                        @PC003PY 36600000
.RINT347 ANOP                                                  @PC003PY 36650000
         LA    0,&ACEE        MOVE ACEE ADDRESS                @PC003PY 36700000
         ST    0,52(1)            INTO PARM LIST               @PC003PY 36750000
.RINT348 ANOP                                                  @PC003PY 36800000
         AIF   ('&SESSION' EQ '').SESS3ND                          @M1A 36800200
         AIF   ('&SESSION' NE 'SYSAS').SESS30A                     @M1A 36800400
         MVI   56(1),1       SESSION = SYSAS                       @M1A 36800600
         AGO   .SESS30K                                            @M1A 36800800
.SESS30A ANOP                                                      @M1A 36801000
         AIF   ('&SESSION' NE 'COMMAND').SESS30B                   @M1A 36801200
         MVI   56(1),2       SESSION = COMMAND                     @M1A 36801400
         AGO   .SESS30K                                            @M1A 36801600
.SESS30B ANOP                                                      @M1A 36801800
         AIF   ('&SESSION' NE 'CONSOPER').SESS30D                  @M1A 36802000
         MVI   56(1),3       SESSION = CONSOPER                    @M1A 36802200
         AGO   .SESS30K                                            @M1A 36802400
.SESS30D ANOP                                                      @M1A 36802600
         AIF   ('&SESSION' NE 'STARTED').SESS30E                   @M1A 36802800
         MVI   56(1),4       SESSION = STARTED                     @M1A 36803000
         AGO   .SESS30K                                            @M1A 36803200
.SESS30E ANOP                                                      @M1A 36803400
         AIF   ('&SESSION' NE 'MOUNT').SESS30F                     @M1A 36803600
         MVI   56(1),5       SESSION = MOUNT                       @M1A 36803800
         AGO   .SESS30K                                            @M1A 36804000
.SESS30F ANOP                                                      @M1A 36804200
         AIF   ('&SESSION' NE 'TSO').SESS30G                       @M1A 36804400
         MVI   56(1),6       SESSION = TSO                         @M1A 36804600
         AGO   .SESS30K                                            @M1A 36804800
.SESS30G ANOP                                                      @M1A 36805000
         AIF   ('&SESSION' NE 'INTBATCH').SESS30H                  @D4C 36805200
         MVI   56(1),7       SESSION = INTERNAL BATCH JOB          @M1A 36805400
         AGO   .SESS30K                                            @M1A 36805600
.SESS30H ANOP                                                      @M1A 36805800
         AIF   ('&SESSION' NE 'INTXBM').SESS30J                    @D7C 36806000
         MVI   56(1),8       SESSION = INTERNAL XBM                @D7C 36806200
         AGO   .SESS30K                                            @M1A 36806400
.SESS30J ANOP                                                      @M1A 36806600
         AIF   ('&SESSION' NE 'RJEOPER').SESS30L                   @M1A 36806800
         MVI   56(1),9       SESSION = RJEOPER                     @M1A 36807000
         AGO   .SESS30K                                            @M1A 36807200
.SESS30L ANOP                                                      @M1A 36807400
         AIF   ('&SESSION' NE 'NJEOPER').SESS30M                   @D3C 36807600
         MVI   56(1),10      SESSION = NJEOPER                     @M1A 36807800
         AGO   .SESS30K                                            @M1A 36808000
.SESS30M ANOP                                                      @D3A 36808200
         AIF   ('&SESSION' NE 'TKNUNKWN').SESS30N                  @D6C 36808400
         MVI   56(1),11      SESSION = NJE UNKNOWN USER            @D3A 36808600
         AGO   .SESS30K                                            @D3A 36808800
.SESS30N ANOP                                                      @D4A 36809000
         AIF   ('&SESSION' NE 'EXTBATCH').SESS30P                  @D4A 36809200
         MVI   56(1),12    SESSION = EXTERNAL BATCH                @D4A 36809400
         AGO   .SESS30K                                            @D4A 36809600
.SESS30P ANOP                                                      @D4A 36809800
         AIF   ('&SESSION' NE 'RJEBATCH').SESS30Q                  @D4A 36810000
         MVI   56(1),13    SESSION = RJE JOB                       @D4A 36810200
         AGO   .SESS30K                                            @D4A 36810400
.SESS30Q ANOP                                                      @D4A 36810600
         AIF   ('&SESSION' NE 'NJEBATCH').SESS30R                  @D5C 36810700
         MVI   56(1),14    SESSION = NJE JOB                       @D4A 36810800
         AGO   .SESS30K                                            @D5A 36810900
.SESS30R ANOP                                                      @D5A 36811000
         AIF   ('&SESSION' NE 'NJSYSOUT').SESS30S                  @D7C 36811100
         MVI   56(1),15    SESSION = NJE SYSOUT                    @D5A 36811200
         AGO   .SESS30K                                            @M4A 36811300
.SESS30S ANOP                                                      @D7A 36811400
         AIF   ('&SESSION' NE 'EXTXBM').SESS30T                    @D7A 36811500
         MVI   56(1),16    SESSION = EXTERNAL XBM                  @D7A 36811600
         AGO   .SESS30K                                            @M4A 36811700
.SESS30T ANOP                                                      @D7A 36811800
         AIF   ('&SESSION' NE 'RJEXBM').SESS30U                    @D7A 36811900
         MVI   56(1),17    SESSION = RJE XBM                       @D7A 36812000
         AGO   .SESS30K                                            @M4A 36812100
.SESS30U ANOP                                                      @D7A 36812200
         AIF   ('&SESSION' NE 'NJEXBM').SESS30V                    @M3C 36812300
         MVI   56(1),18    SESSION = NJE XBM                       @D7A 36812400
         AGO   .SESS30K                                            @M4A 36812500
.SESS30V ANOP                                                      @D7A 36812600
         AIF   ('&SESSION' NE 'APPCTP').SESS30W                    @M9C 36812700
         MVI   56(1),19    SESSION = APPCTP                        @M3A 36812800
         AGO   .SESS30K                                            @M4A 36812900
.SESS30W ANOP                                                      @M9A 36813000
         AIF   ('&SESSION' NE 'OMVSSRV').SESS3ND                   @M9A 36813100
         MVI   56(1),20    SESSION = OMVSSRV                       @M9A 36813200
.SESS3ND ANOP                                                      @M1A 36813300
.SESS30K ANOP                                                     1@P9D 36813400
&BIT0    SETA  0                                                   @P3A 36813500
&BIT1    SETA  0                                                   @P3A 36813600
&BIT2    SETA  0                                                   @D1A 36813700
&BIT3    SETA  0                                                   @D1A 36813800
&BIX0    SETA  1                                                   @M1A 36813900
&BIX1    SETA  1                                                   @M2A 36814000
         AIF   ('&TRUSTED' EQ '').CHKRMT                           @D1C 36814100
&BIT2    SETA  1                  INDICATE TRUSTED WAS CODED       @D1A 36814200
         AIF   ('&TRUSTED' NE 'YES').RINT34A                       @M1A 36814300
&BIT0    SETA  1                                                   @M1A 36814400
         AGO   .CHKRMT                                             @P3A 36814500
.RINT34A ANOP                                                      @M1A 36814600
&BIX0    SETA  0                                                   @P3A 36814700
.CHKRMT  ANOP                                                      @P3A 36814800
         AIF   ('&REMOTE' EQ '').CHKTRU                            @D1C 36814900
&BIT3    SETA  1                  INDICATE REMOTE  WAS CODED       @D1A 36815000
         AIF   ('&REMOTE' NE 'YES').RINT34B                        @M2A 36815100
&BIT1    SETA  1                                                   @M2A 36815200
         AGO   .CHKTRU                                             @P3A 36815400
.RINT34B ANOP                                                      @M2A 36815600
&BIX1    SETA  0                                                   @P3A 36815800
.CHKTRU  ANOP                                                      @P3A 36816000
         AIF   (T'&TRUSTED NE 'O').RINT34G                         @P3A 36816200
         AIF   (T'&REMOTE NE 'O').RINT34G                          @P3A 36816400
         AGO   .RINT352                                            @P3A 36816600
.RINT34G ANOP                                                      @M1A 36816800
         AIF   ('&BIX0&BIX1.000000' EQ '11000000').RINTOR          @D1C 36817000
         NI    57(1),B'&BIX0&BIX1.110000'                          @D1C 36817200
.RINTOR  ANOP                                                      @P3A 36817400
         AIF   ('&BIT0&BIT1&BIT2&BIT3.0000' EQ '00000000').RINT352 @D1C 36817600
         OI    57(1),B'&BIT0&BIT1&BIT2&BIT3.0000'                  @D1C 36817800
.RINT352 ANOP                                                      @M1A 36818000
         AIF   ('&SECLABL' EQ '').RINT354                          @M1A 36818200
         AIF   ('&SECLABL'(1,1) NE '(').RINT353                    @M1A 36818400
         ST    &SECLABL(1),60(1)    - SECLABEL ADDRESS             @M1A 36818600
         AGO   .RINT354                                            @M1A 36818800
.RINT353 ANOP                                                      @M1A 36819000
         LA    0,&SECLABL     -MOVE SECLABL ADDRESS                @M1A 36819200
         ST    0,60(1)        -INTO PARM LIST                      @M1A 36819400
.RINT354 ANOP                                                      @M1A 36819600
         AIF   ('&EXENODE' EQ '').RINT356                          @M1A 36819800
         AIF   ('&EXENODE'(1,1) NE '(').RINT355                    @M1A 36820000
         ST    &EXENODE(1),64(1)    - EXENODE ADDRESS              @M1A 36820200
         AGO   .RINT356                                            @M1A 36820400
.RINT355 ANOP                                                      @M1A 36820600
         LA    0,&EXENODE     -MOVE EXENODE ADDRESS                @M1A 36820800
         ST    0,64(1)        -INTO PARM LIST                      @M1A 36821000
.RINT356 ANOP                                                      @M1A 36821200
         AIF   ('&SUSERID' EQ '').RINT358                          @M1A 36821400
         AIF   ('&SUSERID'(1,1) NE '(').RINT357                    @M1A 36821600
         ST    &SUSERID(1),68(1)    - SUSERID ADDRESS              @M1A 36821800
         AGO   .RINT358                                            @M1A 36822000
.RINT357 ANOP                                                      @M1A 36822200
         LA    0,&SUSERID     -MOVE SUSERID ADDRESS                @M1A 36822400
         ST    0,68(1)        -INTO PARM LIST                      @M1A 36822600
.RINT358 ANOP                                                      @M1A 36822800
         AIF   ('&SNODE' EQ '').RINT360                            @M1A 36823000
         AIF   ('&SNODE'(1,1) NE '(').RINT359                      @M1A 36823200
         ST    &SNODE(1),72(1)    - SNODE ADDRESS                  @M1A 36823400
         AGO   .RINT360                                            @M1A 36823600
.RINT359 ANOP                                                      @M1A 36823800
         LA    0,&SNODE       -MOVE SNODE ADDRESS                  @M1A 36824000
         ST    0,72(1)        -INTO PARM LIST                      @M1A 36824200
.RINT360 ANOP                                                      @M1A 36824400
         AIF   ('&SGROUP' EQ '').RINT362                           @M1A 36824600
         AIF   ('&SGROUP'(1,1) NE '(').RINT361                     @M1A 36824800
         ST    &SGROUP(1),76(1)    - SGROUP ADDRESS                @M1A 36825000
         AGO   .RINT362                                            @M1A 36825200
.RINT361 ANOP                                                      @M1A 36825400
         LA    0,&SGROUP      -MOVE SGROUP ADDRESS                 @M1A 36825600
         ST    0,76(1)        -INTO PARM LIST                      @M1A 36825800
.RINT362 ANOP                                                      @M1A 36826000
         AIF   ('&POE' EQ '').RINT364                              @M1A 36826200
         AIF   ('&POE'(1,1) NE '(').RINT363                        @M1A 36826400
         ST    &POE(1),80(1)    - POE ADDRESS                      @M1A 36826600
         AGO   .RINT364                                            @M1A 36826800
.RINT363 ANOP                                                      @M1A 36827000
         LA    0,&POE         -MOVE POE ADDRESS                    @M1A 36827200
         ST    0,80(1)        -INTO PARM LIST                      @M1A 36827400
.RINT364 ANOP                                                      @M1A 36827600
         AIF   ('&TOKNIN' EQ '').RINT366                           @D2C 36827800
         AIF   ('&TOKNIN'(1,1) NE '(').RINT365                     @D2C 36828000
         ST    &TOKNIN(1),84(1)   - INPUT TOKEN ADDRESS            @D2C 36828200
         AGO   .RINT366                                            @M1A 36828400
.RINT365 ANOP                                                      @M1A 36828600
         LA    0,&TOKNIN      -MOVE INPUT TOKEN ADDRESS            @D2C 36828800
         ST    0,84(1)        -INTO PARM LIST                      @M1A 36829000
.RINT366 ANOP                                                      @M1A 36829200
         AIF   ('&STOKEN' EQ '').RINT368                           @M1A 36829400
         AIF   ('&STOKEN'(1,1) NE '(').RINT367                     @M1A 36829600
         ST    &STOKEN(1),88(1)    - STOKEN ADDRESS                @M1A 36829800
         AGO   .RINT368                                            @M1A 36830000
.RINT367 ANOP                                                      @M1A 36830200
         LA    0,&STOKEN      -MOVE STOKEN ADDRESS                 @M1A 36830400
         ST    0,88(1)        -INTO PARM LIST                      @M1A 36830600
.RINT368 ANOP                                                      @M1A 36830800
         AIF   ('&LOGSTR' EQ '').RINT370                           @M1A 36831000
         AIF   ('&LOGSTR'(1,1) NE '(').RINT369                     @M1A 36831200
         ST    &LOGSTR(1),92(1)    - LOGSTR ADDRESS                @M1A 36831400
         AGO   .RINT370                                            @M1A 36831600
.RINT369 ANOP                                                      @M1A 36831800
         LA    0,&LOGSTR      -MOVE LOGSTR ADDRESS                 @M1A 36832000
         ST    0,92(1)        -INTO PARM LIST                      @M1A 36832200
.RINT370 ANOP                                                      @M1A 36832400
         AIF   ('&TOKNOUT' EQ '').RINT372                          @D2A 36832600
         AIF   ('&TOKNOUT'(1,1) NE '(').RINT371                    @D2A 36832800
         ST    &TOKNOUT(1),96(1)    - OUTPUT TOKEN ADDRESS         @D2A 36833000
         AGO   .RINT372                                            @D2A 36833200
.RINT371 ANOP                                                      @D2A 36833400
         LA    0,&TOKNOUT     -MOVE OUTPUT TOKEN ADDRESS           @D2A 36833600
         ST    0,96(1)        -INTO PARM LIST                      @D2A 36833800
.RINT372 ANOP                                                      @D2A 36834000
.*                                                                 @M4A 36834600
.* CHECK FOR ENVRIN                                                @M4A 36835200
.*                                                                 @M4A 36835800
         AIF   ('&ENVRIN' EQ '').RINT376                           @M4A 36836400
         AIF   ('&ENVRIN'(1,1) NE '(').RINT375                     @M4A 36837000
         ST    &ENVRIN(1),100(1)    - ENVR D.S. ADDRESS            @M4A 36837600
         AGO   .RINT376                                            @M4A 36838200
.RINT375 ANOP                                                      @M4A 36838800
         LA    0,&ENVRIN      -MOVE ENVR D.S. ADDRESS              @M4A 36839400
         ST    0,100(1)       -INTO PARM LIST                      @M4A 36840000
.RINT376 ANOP                                                      @M4A 36840600
.*                                                                 @M4A 36841200
.* CHECK FOR ENVROUT                                               @M4A 36841800
.*                                                                 @M4A 36842400
         AIF   ('&ENVROUT' EQ '').RINT378                          @M4A 36843000
         AIF   ('&ENVROUT'(1,1) NE '(').RINT377                    @M4A 36843600
         ST    &ENVROUT(1),104(1)   - ENVR D.S. ADDRESS            @M4A 36844200
         AGO   .RINT378                                            @M4A 36844800
.RINT377 ANOP                                                      @M4A 36845400
         LA    0,&ENVROUT     -MOVE ENVR D.S. ADDRESS              @M4A 36846000
         ST    0,104(1)       -INTO PARM LIST                      @M4A 36846600
.RINT378 ANOP                                                      @M4A 36847200
.*                                                                 @MAA 36847300
.* CHECK FOR POENET                                                @MAA 36847400
.*                                                                 @MAA 36847500
         AIF   ('&POENET' EQ '').RINT380                           @MAA 36847600
         AIF   ('&POENET'(1,1) NE '(').RINT379                     @MAA 36847700
         ST    &POENET(1),108(1) - POENET ADDRESS                  @MAA 36847800
         AGO   .RINT380                                            @MAA 36848000
.RINT379 ANOP                                                      @MAA 36848200
         LA    0,&POENET      -MOVE POENET ADDRESS                 @MAA 36848400
         ST    0,108(1)        -INTO PARM LIST                     @MAA 36848600
.RINT380 ANOP                                                      @MAA 36848800
.*                                                                 @L9A 36852400
.* CHECK FOR X500NAME                                              @L9A 36856000
.*                                                                 @L9A 36859600
         AIF   ('&X500NAME' EQ '').RINT382                         @L9A 36863200
         AIF   ('&X500NAME'(1,1) NE '(').RINT381                   @L9A 36866800
         ST    &X500NAME(1),112(1) - X500NAME                      @L9A 36870400
         AGO   .RINT382                                            @L9A 36874000
.RINT381 ANOP                                                      @L9A 36877600
         LA    0,&X500NAME    -MOVE X500NAME                       @L9A 36881200
         ST    0,112(1)        -INTO PARM LIST                     @L9A 36884800
.RINT382 ANOP                                                      @L9A 36888400
.*                                                                      36892000
.* PRODUCE SVC ENTRY CODE AND EXIT -LIST MODIFICATION DONE              36895600
         AGO   .RINT221                                                 36900000
.* DIAGNOSTICS   *.                                                     36950000
.ERR002  ANOP                                                           37000000
         MNOTE 8,'*** INVALID ENVIR PARAMETER ***'                      37050000
         AGO   .ERTN002                                                 37100000
.ERR003  ANOP                                                  @PC003PY 37150000
         MNOTE 8,'*** INVALID SMC PARAMETER ***'               @PC003PY 37200000
         AGO   .ERTN003                                        @PC003PY 37250000
.ERR004  ANOP                                                  @PC003PY 37300000
         MNOTE 8,'*** INVALID PASSCHK PARAMETER ***'           @PC003PY 37350000
         AGO   .ERTN004                                        @PC003PY 37400000
.ERR005  ANOP                                                      @L6A 37450000
         MNOTE 8,'*** INVALID STAT PARAMETER ***'                  @L6A 37500000
         AGO   .ERTN005                                            @L6A 37550000
.ERR006  ANOP                                                      @L6A 37600000
         MNOTE 8,'*** INVALID ENCRYPT PARAMETER ***'               @L6A 37650000
         AGO   .ERTN006                                            @L6A 37700000
.ERR007  ANOP                                                      @L7A 37750000
         MNOTE 8,'*** INVALID LOG PARAMETER ***'                   @L7A 37800000
         AGO   .ERTN007                                            @L7A 37850000
.ERR008  ANOP                                                      @L7A 37900000
         MNOTE 8,'*** INVALID LOC PARAMETER ***'                   @L7A 37950000
         AGO   .ERTN008                                            @L7A 38000000
.ERR009  ANOP                                                      @L7A 38050000
         MNOTE 8,'*** ''LOC'' ALLOWED ONLY IF RACINIT IS INVOKED FROM T+38100000
               HE RACROUTE MACRO ***'                              @L7A 38150000
         AGO   .ERTN009                                            @L7A 38200000
.ERR010  ANOP                                                      @M1A 38205000
         MNOTE 8,'*** INVALID TRUSTED PARAMETER ***'               @M1A 38210000
         AGO   .ERTN010                                            @M1A 38215000
.ERR011  ANOP                                                      @M1A 38220000
         MNOTE 8,'*** INVALID SESSION PARAMETER ***'               @M1A 38225000
         AGO   .ERTN020                                            @M1A 38230000
.ERR012  ANOP                                                      @M2A 38235000
         MNOTE 8,'*** INVALID REMOTE PARAMETER  ***'               @M2A 38240000
         AGO   .ERTN030                                            @M2A 38245000
.ERR013  ANOP                                                      @P9A 38246200
         MNOTE 8,'*** INVALID ''SUBPOOL'' PARAMETER ***'           @P9A 38247400
         AGO   .ERTN013                                            @P9A 38248600
.ERR01   ANOP                                                           38250000
         MNOTE 8,'*** REGISTER FORM OF ADDRESS PARAMETER NOT VALID WITH-38300000
                LIST FORM***'                                           38350000
         AGO   .ERTN01                                                  38400000
.ERR02   ANOP                                                           38450000
         MNOTE 8,'*** ONLY REGS 2-12 VALID FOR ADDRESSES***'            38500000
         AGO   .ERTN02                                                  38550000
.ERR04   ANOP                                                           38600000
         MNOTE 8,'*** INVALID MACRO FORM PARAMETER ***'                 38650000
         AGO   .ERTN04                                                  38700000
.ERR05   ANOP                                                           38750000
         MNOTE 8,'*** ENVIR INVALID WITH &NAME2 ***'                    38800000
         AGO   .ERTN05                                                  38850000
.ERR06   ANOP                                                           38900000
         MNOTE 8,'*** ''APPL'' FORM NOT ALLOWED WITH MF=E OR MF=M ***'  38933300
.*                                                                 @M4C 38966600
         AGO   .ERTN06                                                  39000000
.ERR07   ANOP                                                           39050000
         MNOTE 8,'*** ''VERIFY'' ALLOWED ONLY IF RACINIT IS INVOKED  FR*39100000
               OM THE RACROUTE MACRO ***'                      @L6A     39150000
         AGO   .ERTN07                                                  39200000
.ERR08   ANOP                                                           39203100
         MNOTE 8,'*** KEYWORDS  ALLOWED ONLY IF RACINIT IS INVOKED  FRO*39206200
               M THE RACROUTE MACRO ***'                           @M1A 39209300
         AGO   .ERTN01                                             @M1A 39212400
.ERR09   ANOP                                                           39215500
         MNOTE 8,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX39218600
               ) ***'                                              @M1A 39221700
         AGO   .ERTN021                                            @P2A 39224800
.ERR10   ANOP                                                           39227900
         MNOTE 8,'*** ''RELEASE'' INCOMPATIBLE WITH &MVALUE  ***'  @M1A 39231000
         AGO   .ERTN01                                                  39234100
.ERR11   ANOP                                                           39237200
         MNOTE 8,'*** ''VERIFYX'' ALLOWED ONLY IF RACINIT IS INVOKED FR*39240300
               OM THE RACROUTE MACRO ***'                          @M1A 39243400
         AGO   .ERTN07                                                  39246500
.ERR12   ANOP                                                      @M4A 39246800
         MNOTE 8,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX39247100
               ) ***'                                              @M4A 39247400
         AGO   .ERTN022                                            @M4A 39247700
.ERR13   ANOP                                                      @M4A 39248000
         MNOTE 8,'*** "LOG=NONE" IS SUPPORTED BY RELEASE 1.9.2 AND LATEX39248300
               R ONLY ***'                                         @M4A 39248600
         AGO   .ERTN023                                            @M4A 39248900
.ERR14   ANOP                                                      @P1A 39249100
         MNOTE 8,'*** RACINIT CAN BE INVOKED ONLY VIA RACROUTE FOR RELEX39249300
               ASE 1.9 AND LATER ***'                              @P1A 39249500
         AGO   .ERTN14                                             @P1A 39249700
.ERR15   ANOP                                                      @MAA 39258000
         MNOTE 8,'*** ''POENET'' MAY BE SPECIFIED ONLY FOR RELEASE 2.6 X39266300
               OR LATER ***'                                       @MAA 39274600
         AGO   .ERTN021                                            @MAA 39282900
.ERLVL1  MNOTE 8,'*** INCORRECT SPECIFICATION OF ''RELEASE'' ***'  @L7A 39291200
         AGO   .ERLVL1R                                            @L7A 39300000
.ERLVL2  MNOTE 4,'*** ''RELEASE-CHECK'' ONLY VALID WITH ''MF=E'' ***'  X39350000
                                                                   @L7A 39400000
         AGO   .ERLVL2R                                            @L7A 39450000
.ERLVLA  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX39500000
               ) ***'                                              @L7A 39550000
         AGO   .ERLVLAR                                            @L7A 39600000
         MEND                                                           39650000
**/                                                                     39700000
*   RACINIT :                                                           39750000
* MACRO                                                                 39800000
*   KEYS(USERID,PASSWRD,NEWPASS,START,GROUP,INSTLN,ENVIR,MF,            39850000
*        PGMNAME,ACTINFO,OIDCARD,TERMID,JOBNAME,                        39900000
*        APPL,ACEE,SMC,SUBPOOL,PASSCHK,                                 39950000
*        STAT,ENCRYPT,LOG,LOC);  /*                              @L7A*/ 40000000
*        ANS('?'||MACLABEL||'RACINITP '||MACLIST||MACKEYS||';');        40050000
*%END;                                                                  40100000
