*                                                                       00004700
* $MAC(RACLIST) COMP(SC1BN) PROD(RACF):                                 00005300
*                                                                       00005900
* DESCRIPTIVE_NAME:  AUTHORIZATION CHECKING INTERFACE                   00006500
*                                                                       00007100
* *01* PROPRIETARY STATEMENT=                                         * 00041900
*  **PROPRIETARY_STATEMENT********************************************* 00076700
*                                                                     * 00111500
*                                                                     * 00146300
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00181100
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                       * 00215900
*   5647-A01 (C) COPYRIGHT IBM CORP. 1980, 2000                       * 00250700
*                                                                     * 00285600
*   STATUS= HBB7703                                                   * 00335600
*                                                                     * 00387700
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00433600
*                                                                     * 00453000
*01* EXTERNAL CLASSIFICATION:                                         * 00472400
*02* GUPI:                                                            * 00491800
*01* END OF EXTERNAL CLASSIFICATION:                                  * 00511200
*                                                                     * 00530600
*                                                                       00550000
* FUNCTION:  BUILDS IN-STORAGE PROFILES FOR RACF DEFINED RESOURCES.     00600000
*            RACLIST PROCESSES ONLY THOSE RESOURCES DESCRIBED BY        00650000
*            CLASS DESCRIPTORS..                                        00700000
*                                                                       00750000
* CHANGE ACTIVITY:                                                      00800000
*                   $T1=UZ90211,SAF/RF15,810702,CNTDSD:            @T1A 00850000
*                   UZ90283                                    @ZA90283 00900000
*                   UZ90284                                    @ZA90284 00950000
*                   UZ90285                                    @ZA90285 01000000
*                   $L7=HRF1702,RACF/170,841205,CNTDSD:            @L7A 01050000
*                   $L8=HRF1802,RACF/180,870323,CNTDSD:            @L8A 01058300
*                   $M1=JRF1812,RACF/181,871117,CNTDSD:            @M1A 01066600
*      $L1= VTAMSLS  RACF/190 880222 PDPWB1: VTAM SESSION SEC      @L1A 01074900
*      $P1= PGW0006  RACF/190 880615 PDRTS1: PGW0006               @P1A 01083200
*      $P2= PGW0024  RACF/190 880803 PDRTS1: PGW0024               @P2A 01091500
*      $OY15980 THIS PROBLEM HAS BEEN FIXED IN RELEASE 1.9 WITH L1 FLAG 01095700
*      $P3= PGP0360  RACF/190 890715 PDB_S1: PGP0360               @P3A 01097800
*      $P4= PGP0611  RACF/190 890920 PDB_S1: PGP0611               @P4A 01098900
*      $P5= PGU1528  RACF/190 891220 PDR_G2: PGU1528               @P5A 01099400
*      $L2= RELID    RACF/192 900904 PDAHW1: RACF 1.9.2 SUPPORT    @L2A 01099600
*      $P6= PJA0029  RACF/192 910524 PDPSB2: PJA0029               @P6A 01099800
*      $01= OY58591  RACF/192 921106 PDALF1: DC FOR FILTER KEYWORD @01A 01101900
*      $L3= HPCS     RACF/210 930426 PDMAS1: RACF 2.1.0 SUPPORT    @L3A 01103300
*      $L4= OW04015  RACF/210 930507 PDKAF1: RACF 2.1.0 SUPPORT    @L4A 01104300
*      $P7= PIG3024  RACF/210 930917 PDKAF1: PIG3024               @P7A 01105400
*      $P8= PIG3428  RACF/210 931028 PDKAF1: PIG3428               @P8A 01105700
*      $02= OW00768  RACF/210 931206 PDKAF1: OW00768 (PIG3839)     @02A 01105900
*      $L5= OW10709  RACF/220 940510 PDJMV1: RACF 2.2.0 SUPPORT    @L5A 01106000
*      $L6= RELID    RACF/230 960422 PDJMV1: RACF 2.3.0 SUPPORT    @L6A 01106700
*      $P9= PQC1932  RACF/230 960722 PDJMV1: PTM PQC1932           @P9C 01107000
*      $PA= PQC2038  RACF/230 960722 PDRSU1: PTM PQC2038           @PAA 01107200
*      $M2= RELID    RACF/240 960904 PDJMV1: RACF 2.4.0 SUPPORT    @M2A 01107300
*      $M3= RELID    RACF/260 970728 PDCAM1: RACF 2.6 HRF2260      @M3A 01107600
*      $M4= RELID    HRF2608  980624 PDRDS2: HRF2608               @M4A 01107700
*      $M5= RELID    HRF7703 990415 PDRDS2: RACF 7703 HRF7703      @M5A 01107800
*                                                                       01107900
* CHANGE DESCRIPTION                                                    01108300
*      A000000-999999                                          @PC003PY 01116600
*      A - SUPPORT VERIFY THAT THE SUBPOOL PARAMETER IS VALID      @P3A 01124900
*      C - '&RELEASE' TO '&RELEASE'(1,3) FOR LOGICAL COMPARISON    @P4A 01127600
*          WITH '1.9'                                              @P4A 01130300
*      C - REMOVE RCVTSTAT CHECK                                   @P5C 01131700
*      A - ADDED CODE TO SUPPORT RACF RELEASE 1.9.2                @L2A 01132200
*      C - STATUS TO CORRECTLY CORRESPOND TO MVS LEVEL             @P6C 01132700
*      C - RELEASE TEST FOR FILTER KEYWORD, SO LIST FORM CORRECTLY @01C 01132800
*          GENERATES DC FOR 1.9 AND LATER                          @01C 01132900
*      A - ADDED CODE TO SUPPORT GLOBAL=YES                        @L3A 01133000
*      C - ALLOW RACF RELEASE 2.1 TO BE SPECIFIED                  @L4A 01133100
*      C - TURN FLAGS ON FOR SPECIFIED RELEASE AND ANY LOWER       @P7A 01135200
*          RELEASES                                                @P7A 01137300
*      C - RESET INITIAL VALUE OF OFFSET VARIABLE TO 28, AND       @P8A 01137800
*          ADD CONDITIONAL INCREMENT OF OFFSET VARIABLE FOR        @P8A 01138300
*          RELEASES GREATER THAN 2.1.  MISC OTHER CLEANUPS.        @P8A 01138800
*      A - ALLOW RELEASE= CHECKS WITH SUBSTRINGS TO ACCEPT THAT    @02A 01139000
*          RELEASE= VALUE MAY BE EMPTY IF VALUE IS BEING DEFAULTED.@02A 01139200
*      C - ALLOW RACF RELEASE 2.2 TO BE SPECIFIED                  @L5A 01139300
*      C - ALLOW RACF RELEASE 2.3 TO BE SPECIFIED                  @L6A 01140000
*      C - COPYRIGHT CORRECTED                                     @P9A 01140100
*      A - ADDED CHECK FOR RELEASE = OR GT 1.9 AND RACROUTE        @PAA 01140200
*          MNOTE 8 WILL SHOW ERROR DURING ASSEMBLY                 @PAA 01140300
*      A - ALLOW RACF RELEASE 2.4 TO BE SPECIFIED                  @M2A 01140500
*      A - ALLOW RACF RELEASE 2.6 TO BE SPECIFIED FOR FMID HRF2260 @M3A 01140600
*      A - ALLOW RACF REL/ 2608 TO BE SPECIFIED FOR FMID HRF2608   @M4A 01140900
*      A - ALLOW RACF REL/ 7703 TO BE SPECIFIED FOR FMID HRF7703   @M5A 01141000
*                                                                       01141200
*                                                                       01141500
         MACRO                                                          01150000
&SYMBOL  RACLIST &LIST=,&CLASS=,&ACEE=,&APPL=,&ENVIR=,&SUBPOOL=,       *01200000
               &MF=S,&INSTLN=,&OWNER=,&RELEASE=,&LOC=,                 *01233300
               &FILTER=,&GLOBAL=                                   @L3C 01266600
.******* DEFINE LOCAL SET SYMBOLS                                       01300000
.*** THESE BITS MAP TO RLPLFLAG IN ICHRLS00,  PXFLAG IN ICHGLS00,  @L4A 01316600
.*** AND RLSTFLG2 IN IRRPRLST                                      @L4A 01333200
         LCLA  &BIT0,&BIT1,&BIT2,&BIT3,&BIT4,&BIT5,&BIT6,&BIT7     @L1A 01350000
         LCLA  &BIX0,&BIX1,&BIX2,&BIX3,&BIX4,&BIX5,&BIX6,&BIX7     @L1A 01400000
         LCLA  &OFFSET,&CLNGTH                                          01450000
.*** THESE BITS MAP TO RLSTFLG2 IN IRRPRLST                        @L3A 01456200
         LCLA  &GBIT0,&GBIT1,&GBIT2,&GBIT3,&GBIT4,&GBIT5,&GBIT6,&GBIT7  01462500
         LCLA  &GBIX0,&GBIX1,&GBIX2,&GBIX3,&GBIX4,&GBIX5,&GBIX6,&GBIX7  01475000
.*                                                                 @L3A 01481200
         LCLA  &PARMLEN                                            @L3A 01487500
         LCLB  &MFFLAG                                                  01500000
         LCLC  &SUBSTR                                                  01550000
.******* DEFINE GLOBAL SET VARIABLES                               @T1A 01600000
         GBLB  &ICHRAC              ICHRAC - A FLAG WHICH, WHEN    @T1A 01650000
.*                                  ON, INDICATES THAT THIS MACRO  @T1A 01700000
.*                                  IS BEING INVOKED INTERNALLY    @T1A 01750000
.*                                  BY THE RACROUTE MACRO.         @T1A 01800000
         GBLC  &ICHL                THIS IS USED TO COMMUNICATE    @T1A 01850000
.*                                  TO THE RACROUTE MACRO THE      @T1A 01900000
.*                                  ADDRESS OF THE PARAMETER LIST  @T1A 01950000
         GBLC  &ICHRLVL             SYMBOL TO BRANCH TO            @L7A 02000000
.*                                  WHEN INCOMPATIBLE MACRO LEVEL. @L7A 02050000
&PARMLEN SETA  32                   LENGTH OF PARAMETER LIST       @L3A 02075000
.******* PERFORM PARAMETER DIAGNOSIS                                    02100000
.* VALIDATE RELEASE PARAMETER                                      @L7A 02150000
         AIF   (&ICHRAC).RLVL01                                    @L7A 02200000
&ICHRLVL SETC  'ICH&SYSNDX.X'      CREATE LABEL FOR SVC BYPASS     @L7A 02250000
.RLVL01  ANOP                                                      @L7A 02300000
         AIF   ('&RELEASE' EQ '').ERLVL1R                          @L7A 02350000
         AIF   (N'&RELEASE GT 2).ERLVL1  INVALID RELEASE PARAMETER @L7A 02400000
         AIF   ('&RELEASE(1)' EQ '1.6' OR                              X02421400
               '&RELEASE(1)' EQ '1.7' OR                               X02442800
               '&RELEASE(1)' EQ '1.8').NOERLVL                     @P2C 02464200
         AIF   ('&RELEASE(1)' NE '1.8.1' AND                           X02485600
               '&RELEASE(1)' NE '1.9' AND                              X02499800
               '&RELEASE(1)' NE '1.9.2' AND                            X02509300
               '&RELEASE(1)' NE '2.1'    AND                           X02515600
               '&RELEASE(1)' NE '2.2'    AND                           X02519800
               '&RELEASE(1)' NE '2.3'    AND                           X02522600
               '&RELEASE(1)' NE '2.4'    AND                           X02524500
               '&RELEASE(1)' NE '2.6'    AND                           X02525800
               '&RELEASE(1)' NE '2608' AND                             X02526600
               '&RELEASE(1)' NE '7703').ERLVL1                     @M5A 02527400
.NOERLVL ANOP                                                      @P2A 02528400
         AIF   (N'&RELEASE EQ 1).NORLVLC CHECK NOT SPECIFIED       @L7A 02550000
         AIF   ('&RELEASE(2)' NE 'CHECK').ERLVL1 INVALID VALUE     @L7A 02600000
         AIF   ('&MF(1)' NE 'E').ERLVL2 CHECK ONLY WITH MF=E       @L7A 02650000
.ERLVL2R ANOP                                                      @L7A 02700000
.NORLVLC ANOP                                                      @L7A 02750000
.ERLVL1R ANOP                                                      @L7A 02800000
.******* IF RELEASE IS 1.9 OR GREATER MUST USE RACROUTE            @PAA 02808300
         AIF   ('&RELEASE(1)' EQ '').NOERR01                       @PAA 02816600
         AIF   ('&RELEASE(1)'(1,3) GE '1.9' AND NOT &ICHRAC).ERR08 @PAA 02824900
.NOERR01 ANOP                                                      @PAA 02833200
.ERTN08  ANOP                                                      @PAA 02841500
.******* CHECK SPECIFIED PARAMETERS AGAINST RACF LEVEL             @L7A 02850000
         AIF   ('&RELEASE' GE '1.7').ERLVLAR                       @L8A 02900000
         AIF   (T'&LOC NE 'O').ERLVLA                              @L7A 02950000
.ERLVLAR ANOP                                                      @L7A 03000000
.******* VALIDATE MF PARAMETER                                          03050000
         AIF   ('&MF' NE 'S' AND '&MF' NE 'L' AND '&MF'(1,2) NE        -03100000
               '(E' AND '&MF'(1,2) NE '(M').ERR06                  @L1A 03150000
.ERTN06  ANOP                                                           03200000
.******* VALIDATE ENVIR PARAMETER                                       03250000
         AIF   ('&ENVIR' EQ '').ERTN05                                  03300000
         AIF   ('&ENVIR' NE 'CREATE' AND '&ENVIR' NE 'DELETE').ERR05    03350000
.ERTN05  ANOP                                                           03400000
.******* VALIDATE OWNER PARAMETER                                       03450000
         AIF   ('&OWNER' EQ '').ERTN04                                  03500000
         AIF   ('&OWNER' NE 'NO' AND '&OWNER' NE 'YES').ERR04           03550000
.ERTN04  ANOP                                                           03600000
.******* VALIDATE LOC PARAMETER                                    @L7A 03650000
         AIF   ('&LOC' EQ '').ERTN11                               @L7A 03700000
         AIF   ('&LOC' NE 'ANY' AND '&LOC' NE 'ABOVE').ERR11       @L7A 03750000
.ERTN11  ANOP                                                      @L7A 03800000
.**      LOC ALLOWED ONLY IF RACLIST INVOKED FROM RACROUTE         @L7A 03850000
         AIF   ('&LOC' NE '' AND NOT &ICHRAC).ERR12                @L7A 03900000
.ERTN12  ANOP                                                      @L7A 03950000
.******* VALIDATE FILTER PARAMETER                                 @L1A 03952300
         AIF   ('&FILTER' EQ '').ERTN15                            @L1A 03954600
.**      RELEASE MUST BE 1.9 OR GREATER TO SPECIFY FILTER          @L1A 03956900
         AIF   ('&RELEASE(1)' EQ '').ERR13                         @P4A 03958400
         AIF   ('&RELEASE(1)'(1,3) LT '1.9').ERR13                 @P4C 03959900
.ERTN13  ANOP                                                      @L1A 03961500
.**      MUST BE CALLED BY RACROUTE MACRO TO SPECIFY FILTER        @L1A 03963800
         AIF   (NOT &ICHRAC).ERR14                                 @L1A 03966100
.ERTN14  ANOP                                                      @L1A 03968400
.**      LIST KEYWORD MUST NOT BE SPECIFIED CONCURRENTLY WITH FILTER    03970700
         AIF   ('&LIST' NE '').ERR15                               @L1A 03973000
.ERTN15  ANOP                                                      @L1A 03975300
.******* VALIDATE GLOBAL PARAMETER                                 @L3A 03975400
         AIF   ('&GLOBAL' EQ '').ERTN22                            @L3A 03975500
         AIF   ('&GLOBAL' NE 'YES' AND '&GLOBAL' NE 'NO' ).ERR19   @L3A 03975600
.ERTN19  ANOP                                                      @L3A 03975700
         AIF   ('&GLOBAL' NE '' AND NOT &ICHRAC ).ERR20            @L3A 03975800
.ERTN20  ANOP                                                      @L3A 03975900
.****************************************************              @L3A 03976000
.*  VALIDATE THAT FILTER OR LIST ARE NOT SPECIFIED                 @L3A 03976100
.*  IF GLOBAL=YES                                                  @L3A 03976200
.****************************************************              @L3A 03976300
         AIF   ('&GLOBAL' EQ 'NO').ERTN22                          @L3A 03976400
         AIF   ('&FILTER' NE '').ERR21                             @L3A 03976500
.ERTN21  ANOP                                                      @L3A 03976600
         AIF   ('&LIST' NE '').ERR22                               @L3A 03977000
.ERTN22  ANOP                                                      @L3A 03977200
         AIF   ('&MF'(1,2) NE '(M').ERTN17                         @L1A 03977600
.******* MF=M ONLY ALLOWED IF RACLIST INVOKED FROM RACROUTE AND RELEASE 03979900
.******* IS GREATER OR EQUAL TO 1.9                                @L1A 03982200
.**      TEST FOR SUPPORTING RELEASE                               @L1A 03984500
         AIF   ('&RELEASE(1)' EQ '').ERR16                         @P4A 03986000
         AIF   ('&RELEASE(1)'(1,3) LT '1.9').ERR16                 @P4C 03987500
.ERTN16  ANOP                                                      @L1A 03989100
.**      TEST FOR RACROUTE INVOKATION                              @L1A 03991400
         AIF   (NOT &ICHRAC).ERR17                                 @L1A 03993700
.ERTN17  ANOP                                                      @L1A 03996000
.* --------------------------------------------------------------- @P3A 03996100
.* VALIDATE SUBPOOL PARAMETER                                      @P3A 03996200
.* IF SUBPOOL IS SPECIFIED AND IS NOT IN THE REGISTER FORMAT       @P3A 03996300
.* THEN WE VERIFY THAT THE LITERAL IS A NUMERAL AND IS LESS        @P3A 03996400
.* THAN 255.                                                       @P3A 03996500
.* IF ERROR IS FOUND IN FIRST SUBPOOL STRING, THE SECOND STRING    @P3A 03996600
.* IS NOT LOOKED INTO.                                             @P3A 03996700
.* --------------------------------------------------------------- @P3A 03996800
         AIF   ('&SUBPOOL' EQ '').NOSPCHK                          @P3A 03996900
         AIF   ('&SUBPOOL(1)' EQ '').ERR18                         @P3A 03997000
         AIF   ('&SUBPOOL(1)'(1,1) EQ '(').SP2CHK                  @P3A 03997100
         AIF   (T'&SUBPOOL(1) NE 'N').SP2CHK                       @P3A 03997200
         AIF   ('&SUBPOOL(1)' GT '255').ERR18                      @P3A 03997300
.SP2CHK  ANOP                                                      @P3A 03997400
         AIF   ('&SUBPOOL(2)' EQ '').NOSPCHK                       @P3A 03997500
         AIF   ('&SUBPOOL(2)'(1,1) EQ '(').NOSPCHK                 @P3A 03997600
         AIF   (T'&SUBPOOL(2) NE 'N').NOSPCHK                      @P3A 03997700
         AIF   ('&SUBPOOL(2)' GT '255').ERR18                      @P3A 03997800
.ERTN18  ANOP                                                      @P3A 03997900
.NOSPCHK ANOP                                                      @P3A 03998000
.*                                                                 @P3A 03998100
.******* REGISTER SPECIFICATION OF ADDR TYPE PARAMETERS NOT ALLOWED     04000000
.******* WITH LIST FORM                                                 04050000
         AIF   ('&MF' NE 'L').RLST070                                   04100000
         AIF   ('&CLASS' EQ '').RLST010                                 04150000
         AIF   ('&CLASS'(1,1) EQ '(').ERR07                             04200000
.RLST010 ANOP                                                           04250000
         AIF   ('&LIST' EQ '').RLST020                                  04300000
         AIF   ('&LIST'(1,1) EQ '(').ERR07                              04350000
.RLST020 ANOP                                                           04400000
         AIF   ('&ACEE' EQ '').RLST030                                  04450000
         AIF   ('&ACEE'(1,1) EQ '(').ERR07                              04500000
.RLST030 ANOP                                                           04550000
         AIF   ('&INSTLN(1)' NE '&INSTLN').ERR07                        04600000
.RLST040 ANOP                                                           04650000
         AIF   ('&APPL' EQ '').RLST050                                  04700000
         AIF   ('&APPL'(1,1) EQ '(').ERR07                              04750000
.RLST050 ANOP                                                           04800000
         AIF   ('&SUBPOOL(1)' EQ '').RLST060                            04850000
         AIF   ('&SUBPOOL(1)'(1,1) EQ '(').ERR07                        04900000
.RLST060 ANOP                                                           04950000
         AIF   ('&SUBPOOL(2)' EQ '').RLST061                            05000000
         AIF   ('&SUBPOOL(2)'(1,1) EQ '(').ERR07                        05050000
.RLST061 ANOP                                                           05100000
         AIF   ('&FILTER' EQ '').RLST065                           @L1A 05112500
         AIF   ('&FILTER'(1,1) EQ '(').ERR07                       @L1A 05125000
.RLST065 ANOP                                                      @L1A 05137500
.ERTN07  ANOP                                                           05150000
.RLST070 ANOP                                                           05200000
.******* PRODUCE LIST FORM IF REQUESTED                                 05250000
         AIF   ('&MF' NE 'L').RLST430                                   05300000
&SYMBOL  DS    0F                                                       05350000
.RLST100 ANOP                                                           05400000
ICH0&SYSNDX EQU *                                                       05450000
.******* PRODUCE BYTE INFORMATION                                       05500000
         AIF   ('&SUBPOOL(1)' EQ '').RLST110                            05550000
         AIF   ('&SUBPOOL(1)'(1,1) EQ '(').RLST110                      05600000
&ICHL    DC    AL1(&SUBPOOL(1))        INDEX SUBPOOL NUMBER        @T1A 05650000
         AGO   .RLST115                                                 05700000
.RLST110 ANOP                                                           05750000
&ICHL    DC    AL1(255)                INDEX SUBPOOL NUMBER        @T1A 05800000
.RLST115 ANOP                                                           05850000
         AIF   ('&SUBPOOL(2)' EQ '').RLST120                            05900000
         AIF   ('&SUBPOOL(2)'(1,1) EQ '(').RLST120                      05950000
         DC    AL1(&SUBPOOL(2)) -      PROFILE SUBPOOL NUMBER           06000000
         AGO   .RLST125                                                 06050000
.RLST120 ANOP                                                           06100000
         DC    AL1(255)         -      PROFILE SUBPOOL NUMBER           06150000
.RLST125 ANOP                                                           06200000
         DC    AL1(2)           -      RACLIST ENTRY CODE               06250000
.******* PRODUCE FLAG BYTE 1 FROM ENVIR/OWNER/LOC PARAMETER        @L7A 06300000
&BIT0    SETA  0                       0 AND 1 INDICATE CREATE    @L4C  06350000
&BIT1    SETA  0                       '00' OR DELETE '01'        @L4C  06400000
&BIT2    SETA  0                       ADD OWNER W/ALTER          @L4C  06450000
&BIT3    SETA  0                       LOC = ABOVE SPECIFIED      @L4C  06462500
&BIT4    SETA  0                       1.8|1.8.1 SPECIFIED (WARNING    X06468300
                                        MODE SUPPORTED)           @P8C  06474100
&BIT5    SETA  0                       1.9 SPECIFIED (FILTER           X06479900
                                        SUPPORTED)                @P8C  06485700
&BIT6    SETA  0                       1.9.2 SPECIFIED            @L4A  06491600
.****** &BIT7 SHOULD NEVER BE TOUCHED, IT IS USED BY AN APAR      @L4A  06495700
         AIF   ('&ENVIR' EQ '' OR '&ENVIR' EQ 'CREATE').RLST130         06500000
         AIF   ('&ENVIR' NE 'DELETE').RLST130                           06550000
&BIT0    SETA  1                                                        06600000
.RLST130 ANOP                                                           06650000
         AIF   ('&OWNER' EQ '' OR '&OWNER' EQ 'NO').RLST131             06700000
         AIF   ('&OWNER' NE 'YES').RLST131                              06750000
&BIT2    SETA  1                                                        06800000
.RLST131 ANOP                                                           06850000
         AIF   ('&LOC' EQ '' OR '&LOC' EQ 'ANY').RLST132           @L7A 06900000
         AIF   ('&LOC' NE 'ABOVE').RLST132                         @L7A 06950000
&BIT3    SETA  1                                                   @L7A 07000000
.RLST132 ANOP                                                      @L7A 07050000
         AIF   ('&RELEASE(1)' EQ '').RLST135                       @02A 07055500
         AIF   ('&RELEASE(1)' LT '1.8').RLST135                    @P7C 07061100
&BIT4    SETA  1       - RELEASE = 1.8|1.8.1 BIT SET ON            @P8C 07077700
.RLST133 ANOP                                                      @L1A 07094400
         AIF   ('&RELEASE(1)'(1,3) LT '1.9').RLST135               @P7C 07105500
&BIT5    SETA  1       - RELEASE = 1.9 BIT SET ON                  @L1A 07116600
.RLST134 ANOP                                                      @L2A 07119300
         AIF   ('&RELEASE(1)'(1,5) LT '1.9.2' AND                      X07121100
                '&RELEASE(1)'(1,1) LT '2').RLST135                 @P7C 07122900
&BIT6    SETA  1       - RELEASE = 1.9.2 BIT SET ON                @L2A 07124700
.RLST135 ANOP                                                      @L1A 07133100
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6.0' - FLAGS    @L2C 07141500
.******* PROCESS LIST PARMETER                                          07150000
         AIF   ('&LIST' EQ '').RLST140                                  07200000
         AIF   ('&LIST'(1,1) EQ '(').RLST140                            07250000
         DC    A(&LIST(1)) -           LIST ADDRESS                     07300000
         AGO   .RLST145                                                 07350000
.RLST140 ANOP                                                           07400000
         DC    A(0) -                  LIST ADDRESS                     07450000
.RLST145 ANOP                                                           07500000
.******* PROCESS ACEE PARAMETER                                         07550000
         AIF   ('&ACEE' EQ '').RLST150                                  07600000
         AIF   ('&ACEE'(1,1) EQ '(').RLST150                            07650000
         DC    A(&ACEE(1)) -           ACEE ADDRESS                     07700000
         AGO   .RLST155                                                 07750000
.RLST150 ANOP                                                           07800000
         DC    A(0) -                  ACEE ADDRESS                     07850000
.RLST155 ANOP                                                           07900000
.******* PROCESS INSTLN PARAMETER                                       07950000
         AIF   ('&INSTLN' EQ '' OR                                     *08000000
               '&INSTLN(1)' NE '&INSTLN').RLST160                       08050000
         DC    A(&INSTLN) -             ADDRESS OF INSTALLATION DATA    08100000
         AGO   .RLST165                                                 08150000
.RLST160 ANOP                                                           08200000
         DC    A(0) -                   ADDRESS OF INSTALLATION DATA    08250000
.RLST165 ANOP                                                           08300000
.******* PROCESS APPL PARAMETER                                         08350000
         AIF   ('&APPL' EQ '').RLST175                                  08400000
         AIF   ('&APPL'(1,1) EQ '(').RLST175                            08450000
         AIF   ('&APPL'(1,1) EQ '''').RLST170                           08500000
         DC    A(&APPL) -               APPL ADDRESS                    08550000
         AGO   .RLST180                                                 08600000
.RLST170 ANOP                                                           08650000
         DC    A(ICH1&SYSNDX) -         APPL ADDRESS                    08700000
         AGO   .RLST180                                                 08750000
.RLST175 ANOP                                                           08800000
         DC    A(0) -                   APPL ADDRESS                    08850000
.RLST180 ANOP                                                           08900000
.******* PROCESS CLASS  PARAMETER                                       08950000
         AIF   ('&CLASS' EQ '').RLST195                                 09000000
         AIF   ('&CLASS'(1,1) EQ '(').RLST195                           09050000
         AIF   ('&CLASS'(1,1) EQ '''').RLST190                          09100000
         DC    A(&CLASS) -              CLASS ADDRESS                   09150000
         AGO   .RLST200                                                 09200000
.RLST190 ANOP                                                           09250000
         DC    A(ICH2&SYSNDX) -         CLASS ADDRESS                   09300000
         AGO   .RLST200                                                 09350000
.RLST195 ANOP                                                           09400000
         DC    A(0) -                  CLASS ADDRESS                    09450000
.RLST200 ANOP                                                           09500000
.******* PROCESS FILTER PARAMETER                                  @L1A 09505000
         AIF   ('&RELEASE(1)' EQ '').RLST205                       @01A 09508300
         AIF   ('&RELEASE(1)'(1,3) LT '1.9').RLST205               @01C 09511600
         AIF   ('&FILTER' EQ '').RLST203                           @L1A 09515000
         AIF   ('&FILTER'(1,1) EQ '(').RLST203                     @L1A 09520000
         DC    A(&FILTER) -            FILTER STRING ADDRESS       @L1A 09525000
         AGO   .RLST205                                            @L1A 09530000
.RLST203 ANOP                                                      @L1A 09535000
         DC    A(0)       -            FILTER STRING ADDRESS       @L1A 09540000
.RLST205 ANOP                                                      @L1A 09545000
         AIF   ('&RELEASE(1)' EQ '').RLST208                       @02A 09545100
         AIF   ('&RELEASE(1)'(1,1) LT '2').RLST208                 @P8C 09545200
.******* PRODUCE EXTENDED BYTE 1 FOR RACF 2.1                      @L3A 09545300
&GBIT0   SETA  0                       RESERVED FOR FUTURE USE     @P8C 09545400
&GBIT1   SETA  0                       RESERVED FOR FUTURE USE     @P8C 09545600
&GBIT2   SETA  0                       RESERVED FOR FUTURE USE     @P8C 09545800
&GBIT3   SETA  0                       RESERVED FOR FUTURE USE     @P8C 09546000
&GBIT4   SETA  0                       RESERVED FOR FUTURE USE     @P8C 09546200
&GBIT5   SETA  0                       RESERVED FOR FUTURE USE     @P8C 09546400
.******* 2.1 OR GREATER WOULD HAVE HAD TO BEEN SPECIFIED TO BE HERE@P8A 09546600
&GBIT6   SETA  1                       GLOBAL SUPPORTED            @P8C 09546800
&GBIT7   SETA  0                       GLOBAL=YES SPECIFIED        @P8C 09547000
.RLST206 ANOP                                                      @L3A 09547600
.******* SET GLOBAL  BIT TO YES IF GLOBAL=YES                      @L3A 09547900
         AIF   ('&GLOBAL' NE 'YES').RLST207                        @L3A 09548200
&GBIT7   SETA  1                                                   @L3A 09548500
.RLST207 ANOP                                                      @L3A 09548800
         DC    B'&GBIT0&GBIT1&GBIT2&GBIT3&GBIT4&GBIT5&GBIT6&GBIT7'     X09549000
                                       EXTENDED FLAGS              @P8C 09549200
         DC    X'00'                                               @L3A 09549400
         DC    AL2(&PARMLEN)    LIST LENGTH                        @L3A 09549700
.RLST208 ANOP                                                      @L3A 09549800
.******* IF APPL EXPLICITLY SPECIFIED, PRODUCE IT BELOW LIST            09550000
         AIF   ('&APPL' EQ '').RLST210                                  09600000
         AIF   ('&APPL'(1,1) NE '''').RLST210                           09650000
ICH1&SYSNDX DC   CL8&APPL -            APPL NAME                        09700000
.RLST210 ANOP                                                           09750000
.******* IF CLASS EXPLICITLY SPECIFIED, PRODUCE IT BELOW LIST           09800000
         AIF   ('&CLASS' EQ '').RLST220                                 09850000
         AIF   ('&CLASS'(1,1) NE '''').RLST220                          09900000
ICH2&SYSNDX DC    CL8&CLASS    -       CLASS NAME                       09950000
.RLST220 ANOP                                                           10000000
.******* LIST FORM COMPLETE - TEST FOR STANDARD FORM PASS               10050000
.******* THROUGH LIST FORM                                              10100000
         AIF   (&MFFLAG).RLST390                                        10150000
         MEXIT                                                          10200000
.RLST430 ANOP                                                           10250000
         AIF   ('&MF(1)' EQ 'E' OR '&MF(1)' EQ 'M').RLST500        @L1A 10300000
.******* STANDARD FORM REQUESTED                                        10350000
&SYMBOL  DS    0H                                                       10400000
&MFFLAG  SETB  1              SET TRUE FOR PASS THROUGH LIST FORM       10450000
.******* PROCESS SUBPOOL PARAMETER                                      10500000
         AIF   ('&SUBPOOL(1)' EQ '').RLST300                            10550000
         AIF   ('&SUBPOOL(1)'(1,1) NE '(').RLST300                      10600000
         STC   &SUBPOOL(1),ICH0&SYSNDX -   STORE INDEX SUBPOOL          10650000
.RLST300 ANOP                                                           10700000
         AIF   ('&SUBPOOL(2)' EQ '').RLST305                            10750000
         AIF   ('&SUBPOOL(2)'(1,1) NE '(').RLST305                      10800000
         STC    &SUBPOOL(2),ICH0&SYSNDX+1 - STORE PROFILE SUBPOOL       10850000
.RLST305 ANOP                                                           10900000
.******* PROCESS LIST PARAMETER                                         10950000
         AIF   ('&LIST' EQ '').RLST310                                  11000000
         AIF   ('&LIST'(1,1) NE '(').RLST310                            11050000
         ST    &LIST(1),ICH0&SYSNDX+4 - STORE LIST ADDRESS              11100000
.RLST310 ANOP                                                           11150000
.******* PROCESS ACEE PARAMETER                                         11200000
         AIF   ('&ACEE' EQ '').RLST320                                  11250000
         AIF   ('&ACEE'(1,1) NE '(').RLST320                            11300000
         ST    &ACEE(1),ICH0&SYSNDX+8 - STORE ACEE ADDRESS              11350000
.RLST320 ANOP                                                           11400000
.******* PROCESS INSTLN PARAMETER                                       11450000
         AIF   ('&INSTLN' EQ '' OR '&INSTLN(1)' EQ '&INSTLN').RLST330   11500000
         ST    &INSTLN(1),ICH0&SYSNDX+12 - STORE INSTALLATION DATA ADDR 11550000
.RLST330 ANOP                                                           11600000
.******* PROCESS APPL PARAMETER                                         11650000
         AIF   ('&APPL' EQ '').RLST340                                  11700000
         AIF   ('&APPL'(1,1) NE '(').RLST340                            11750000
         ST    &APPL(1),ICH0&SYSNDX+16 - STORE APPL NAME ADDRESS        11800000
.RLST340 ANOP                                                           11850000
.******* PROCESS CLASS PARAMETER                                        11900000
         AIF   ('&CLASS' EQ '').RLST350                                 11950000
         AIF   ('&CLASS'(1,1) NE '(').RLST350                           12000000
         ST    &CLASS(1),ICH0&SYSNDX+20 - STORE CLASS NAME ADDRESS      12050000
.RLST350 ANOP                                                           12100000
.******* PROCESS FILTER PARAMETER                                  @L1A 12107100
         AIF   ('&FILTER' EQ '').RLST355                           @L1A 12114200
         AIF   ('&FILTER'(1,1) NE '(').RLST355                     @L1A 12121300
         ST    &FILTER(1),ICH0&SYSNDX+24 - STORE FILTER STRING     @P1C 12128400
.*******                                   ADDRESS                 @P1C 12135500
.RLST355 ANOP                                                      @L1A 12142600
.******* LIST FORM MODIFICATION COMPLETE                                12150000
.******* - PRODUCE LIST FORM WITH BAL AROUND                            12200000
         CNOP  0,4                                                      12250000
&OFFSET  SETA  28                                                  @P8C 12300000
         AIF   ('&APPL' EQ '').RLST380                                  12350000
         AIF   ('&APPL'(1,1) NE '''').RLST380                           12400000
&OFFSET  SETA  &OFFSET+8                                                12450000
.RLST380 ANOP                                                           12500000
         AIF   ('&CLASS' EQ '').RLST385                                 12550000
         AIF   ('&CLASS'(1,1) NE '''').RLST385                          12600000
&OFFSET  SETA  &OFFSET+8                                                12650000
.RLST385 ANOP                                                           12700000
         AIF   ('&RELEASE(1)' EQ '').RLST387                       @02A 12706200
         AIF   ('&RELEASE(1)'(1,3) LT '1.9').RLST386               @P8C 12712500
&OFFSET  SETA  &OFFSET+4                    - ADD OFFSET OF FILTER @L1A 12725000
.RLST386 ANOP                                                      @P8A 12728100
         AIF   ('&RELEASE(1)'(1,1) LT '2').RLST387                 @P8A 12731200
&OFFSET  SETA  &OFFSET+4                    - ADD OFFSET OF GLOBAL @P8A 12734300
.RLST387 ANOP                                                      @L1A 12737500
         BAL   1,*+&OFFSET -  POINT REG 1 AT PARM LIST                  12750000
         AGO   .RLST100                                                 12800000
.RLST390 ANOP                                                           12850000
.***********************************************************       @T1A 12900000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 12950000
.* MACRO, SIMPLY EXIT RATHER THAN GOING TO THE RACF ROUTINE.       @T1A 13000000
.***********************************************************       @T1A 13050000
         AIF   (&ICHRAC).RLST395                                   @T1A 13100000
.******* RETURN FROM LIST FORM TO PRODUCE SVC                           13150000
         L     15,16(0,0)            GET CVT ADDRESS                    13200000
         L     15,X'3E0'(0,15)       GET RACF CVT ADDRESS               13250000
         LTR   15,15                 RACF CVT EXIST                     13300000
         BZ    *+12                  NO, BRANCH TO SET NOT ACTIVE  @P5C 13350000
         CLI   X'AC'(15),X'02'       RACF FUNCTION SUPPORTED (RCVTVERS) 13500000
         BNL   *+20                  YES, BRANCH                        13550000
         LA    15,28(0,0)            RACF FUNCTION NOT SUPPORTED        13600000
         B     *+14                  SKIP CALL                          13650000
         LA    15,16(0,0)            RACF NOT ACTIVE RET CODE           13700000
         B     *+6                   SKIP CALL                          13750000
         SVC   132                   INVOKE RACF SVC ROUTER             13800000
.RLST395 ANOP                                                      @T1A 13850000
         MEXIT                                                          13900000
.******* PRODUCE EXECUTE FORM OF MACRO                                  13950000
.RLST500 ANOP                                                           14000000
         AIF   (&ICHRAC).RLST503                                   @T1A 14050000
&SYMBOL  IHBINNRA &MF(2) -    POINT REG1 AT LIST FORM                   14100000
         AGO   .RLST505                                            @T1A 14150000
.**************************************************************    @T1A 14200000
.*  IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE MACRO,    @T1A 14250000
.*  PICK UP THE ADDRESS OF THE RACLIST PARAMETER LIST FROM THE     @T1A 14300000
.*  RACROUTE PARAMETER LIST.                                       @T1A 14350000
.**************************************************************    @T1A 14400000
.RLST503 ANOP                                                      @T1A 14450000
         A     1,36(1)           POINT REG 1 AT RACLIST LIST       @T1A 14500000
.RLST505 ANOP                                                      @T1A 14550000
.******* PRODUCE INSTRUCTIONS TO MODIFY LIST                            14600000
         AIF   ('&SUBPOOL(1)' EQ '').RLST515                            14650000
         AIF   ('&SUBPOOL(1)'(1,1) EQ '(').RLST510                      14700000
         MVI   0(1),&SUBPOOL(1) -      INDEX SUBPOOL NUMBER             14750000
         AGO   .RLST515                                                 14800000
.RLST510 ANOP                                                           14850000
         STC   &SUBPOOL(1),0(1) -      INDEX SUBPOOL NUMBER             14900000
.RLST515 ANOP                                                           14950000
         AIF   ('&SUBPOOL(2)' EQ '').RLST525                            15000000
         AIF   ('&SUBPOOL(2)'(1,1) EQ '(').RLST520                      15050000
         MVI   1(1),&SUBPOOL(2) -      PROFILE SUBPOOL NUMBER           15100000
         AGO   .RLST525                                                 15150000
.RLST520 ANOP                                                           15200000
         STC   &SUBPOOL(2),1(1) -      PROFILE SUBPOOL NUMBER           15250000
.RLST525 ANOP                                                           15300000
.******* PRODUCE FLAG BYTE                                         @L7A 15350000
&BIT0    SETA  0                                                        15450000
&BIT1    SETA  0                                                        15500000
&BIT2    SETA  0                                                        15550000
&BIT3    SETA  0                                                   @L7A 15600000
&BIT4    SETA  0                                                   @L1A 15616600
&BIT5    SETA  0                                                   @L1A 15633200
&BIT6    SETA  0                                                   @L4A 15638800
.****** DON'T TOUCH &BIT7 IT IS USED BY AN APAR                    @L4A 15644400
&BIX0    SETA  1                                                        15650000
&BIX1    SETA  1                                                        15700000
&BIX2    SETA  1                                                        15750000
&BIX3    SETA  1                                                   @L7A 15800000
&BIX4    SETA  1                                                   @L1A 15812500
&BIX5    SETA  1                                                   @L1A 15825000
&BIX6    SETA  1                                                   @L4A 15829100
.****** DON'T TOUCH &BIX7 IT IS USED BY AN APAR                    @L4A 15833200
         AIF   ('&ENVIR&OWNER&LOC&FILTER' EQ '').RLST532           @P2C 15837500
         AIF   ('&ENVIR' EQ '').RLST530                                 15850000
&BIX0    SETA  0                                                        15900000
&BIX1    SETA  0                                                        15950000
         AIF   ('&ENVIR' EQ 'CREATE').RLST530                           16000000
         AIF   ('&ENVIR' NE 'DELETE').RLST530                           16050000
&BIT0    SETA  1                                                        16100000
.RLST530 ANOP                                                           16150000
         AIF   ('&OWNER' EQ '').RLST531                                 16200000
&BIX2    SETA  0                                                        16250000
         AIF   ('&OWNER' EQ 'NO').RLST531                               16300000
         AIF   ('&OWNER' NE 'YES').RLST531                              16350000
&BIT2    SETA  1                                                        16400000
.RLST531 ANOP                                                           16450000
         AIF   ('&LOC' EQ '').RLST532                              @L7A 16500000
&BIX3    SETA  0                                                   @L7A 16550000
         AIF   ('&LOC' EQ 'ANY').RLST532                           @L7A 16600000
         AIF   ('&LOC' NE 'ABOVE').RLST532                         @L7A 16650000
&BIT3    SETA  1                                                   @L7A 16700000
.RLST532 ANOP                                                      @L7A 16750000
         AIF   (N'&MF LT 2).RLST536 - NO PARAMETER LIST SUPPLIED   @L2C 16761500
         AIF   ('&RELEASE(1)' EQ '').RLST535                       @02A 16767200
         AIF   ('&RELEASE(1)' LT '1.8').RLST535                    @P7C 16773000
&BIX4    SETA  0    -  CLEAR EXISTING RELEASE=1.8|1.8.1 BIT        @P8C 16788300
&BIT4    SETA  1    -  SET RELEASE = 1.8|1.8.1 BIT ON              @P8C 16803600
.RLST533 ANOP                                                      @L1A 16819000
         AIF   ('&RELEASE(1)'(1,3) LT '1.9').RLST535               @P7C 16869000
&BIX5    SETA  0    -  CLEAR EXISTING RELEASE=1.9 BIT              @L1A 47250000
&BIT5    SETA  1    -  SET RELEASE = 1.9 BIT ON                    @L1A 47300000
.RLST534 ANOP                                                      @L2A 47350000
         AIF   ('&RELEASE(1)'(1,5) LT '1.9.2' AND                      X47383300
                '&RELEASE(1)'(1,1) LT '2').RLST535                 @P7C 47416600
&BIX6    SETA  0    -  CLEAR EXISTING RELEASE=1.9.2 BIT            @L2A 47450000
&BIT6    SETA  1    -  SET RELEASE = 1.9.2 BIT ON                  @L2A 47500000
.RLST535 ANOP                                                      @L2C 47550000
         NI    3(1),B'&BIX0&BIX1&BIX2&BIX3&BIX4&BIX5&BIX6.0'       @L2C 47600000
         OI    3(1),B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6.0'           X47633300
                                        FLAGS                      @P8C 47666600
.RLST536 ANOP                                                      @L2A 47700000
.******* PROCESS LIST PARAMETER                                         47750000
         AIF   ('&LIST' EQ '').RLST545                                  47800000
         AIF   ('&LIST'(1,1) NE '(').RLST540                            47850000
         ST    &LIST(1),4(1) -          STORE LIST ADDRESS              47900000
         AGO   .RLST545                                                 47950000
.RLST540 ANOP                                                           48000000
         LA    0,&LIST(1) -             MOVE LIST ADDRESS               48050000
         ST    0,4(1) -                 INTO PARM LIST                  48100000
.RLST545 ANOP                                                           48150000
.******* PROCESS ACEE PARAMETER                                         48200000
         AIF   ('&ACEE' EQ '').RLST555                                  48250000
         AIF   ('&ACEE'(1,1) NE '(').RLST550                            48300000
         ST    &ACEE(1),8(1) -          STORE ACEE ADDRESS              48350000
         AGO   .RLST555                                                 48400000
.RLST550 ANOP                                                           48450000
         LA    0,&ACEE(1) -             MOVE ACEE ADDRESS               48500000
         ST    0,8(1) -                 INTO PARM LIST                  48550000
.RLST555 ANOP                                                           48600000
.******* PRODUCE INSTALLATION DATA ADDRESS                              48650000
         AIF   ('&INSTLN' EQ '').RLST565                                48700000
         AIF   ('&INSTLN'(1,1) NE '(').RLST560                          48750000
         ST    &INSTLN(1),12(1) -       STORE INSTALLATION ADDR         48800000
         AGO   .RLST565                                                 48850000
.RLST560 ANOP                                                           48900000
         LA    0,&INSTLN -              ADDRESS INSTALLATION DATA       48950000
         ST    0,12(1) -                STORE INSTALLATION DATA ADDRESS 49000000
.RLST565 ANOP                                                           49050000
.******* HANDLE APPL PARAMETER                                          49100000
         AIF   ('&APPL' EQ '').RLST575                                  49150000
         AIF   ('&APPL'(1,1) EQ '''').ERR10                             49200000
         AIF   ('&APPL'(1,1) NE '(').RLST570                            49250000
         ST    &APPL(1),16(1) -         STORE APPL NAME ADDRESS         49300000
         AGO   .RLST575                                                 49350000
.RLST570 ANOP                                                           49400000
         LA    0,&APPL -                MOVE APPL NAME ADDRESS          49450000
         ST    0,16(1) -                INTO PARM LIST                  49500000
.ERTN10  ANOP                                                           49550000
.RLST575 ANOP                                                           49600000
.******* HANDLE CLASS PARAMETER                                         49650000
         AIF   ('&CLASS' EQ '').RLST585                                 49700000
         AIF   ('&CLASS'(1,1) EQ '''').ERR09                            49750000
         AIF   ('&CLASS'(1,1) NE '(').RLST580                           49800000
         ST    &CLASS(1),20(1) -        STORE CLASS NAME ADDRESS        49850000
         AGO   .RLST585                                                 49900000
.RLST580 ANOP                                                           49950000
         LA    0,&CLASS -               MOVE CLASS NAME ADDRESS         50000000
         ST    0,20(1) -                INTO PARM LIST                  50050000
.ERTN09  ANOP                                                           50100000
.RLST585 ANOP                                                           50150000
.******* HANDLE FILTER PARAMETER                                   @L1A 50200000
         AIF   ('&FILTER' EQ '').RLST595                           @L1A 50250000
         AIF   ('&FILTER'(1,1) NE '(').RLST590                     @L1A 50300000
         ST    &FILTER(1),24(1)         - STORE FILTER STRING ADDRESS   50350000
         AGO   .RLST595                                            @L1A 50400000
.RLST590 ANOP                                                      @L1A 50450000
         LA    0,&FILTER -              MOVE FILTER STRING ADDRESS @L1A 50500000
         ST    0,24(1) -                INTO PARM LIST             @L1A 50550000
.RLST595 ANOP                                                      @L1A 50600000
.******* PRODUCE EXTENDED FLAG BYTE                                @L3A 50650000
.******* SET GLOBAL BIT TO YES IF GLOBAL=YES                       @L3A 50700000
.******* BYPASS THIS PROCESSING IF RELEASE IS NOT 2.1              @L3A 50750000
         AIF   ('&RELEASE(1)' EQ '').RLST599                       @02A 50775000
         AIF   ('&RELEASE(1)'(1,1) LT '2').RLST599                 @P8C 50800000
&GBIT0   SETA  0                                                   @P8C 50850000
&GBIT1   SETA  0                                                   @P8C 50900000
&GBIT2   SETA  0                                                   @P8C 50950000
&GBIT3   SETA  0                                                   @P8C 51000000
&GBIT4   SETA  0                                                   @P8C 51050000
&GBIT5   SETA  0                                                   @P8C 51100000
.******* 2.1 OR GREATER WOULD HAVE HAD TO BEEN SPECIFIED TO BE HERE@P8A 51150000
&GBIT6   SETA  1                                                   @P8C 51200000
&GBIT7   SETA  0                                                   @P8C 51250000
.******* SET BIT IF GLOBAL=YES WAS SPECIFIED                       @L3A 51400000
.RLST596 ANOP                                                      @L3A 51450000
         AIF   ('&GLOBAL' NE 'YES').RLST597                        @L3A 51500000
&GBIT7   SETA  1                                                   @L3A 51550000
.RLST597 ANOP                                                      @L3A 51600000
&GBIX0   SETA  1                                                   @L3A 51650000
&GBIX1   SETA  1                                                   @L3A 51700000
&GBIX2   SETA  1                                                   @L3A 51750000
&GBIX3   SETA  1                                                   @L3A 51800000
&GBIX4   SETA  1                                                   @L3A 51850000
&GBIX5   SETA  1                                                   @L3A 51900000
.******* GBIT6 WOULD HAVE TO BE ON TO GET HERE, SO SET GBIX6 OFF   @P8A 51933300
&GBIX6   SETA  0                                                   @P8C 51966600
&GBIX7   SETA  1                                                   @L3A 52000000
         AIF   ('&GLOBAL' NE 'NO').RLST598                         @L3A 52050000
&GBIX7   SETA  0                                                   @L3A 52100000
         AGO  .RLST598                                             @L3A 52150000
.RLST598 ANOP                                                      @L3A 52200000
         NI    28(1),B'&GBIX0&GBIX1&GBIX2&GBIX3&GBIX4&GBIX5&GBIX6&GBIX7*52250000
               '                                                   @L3A 52300000
         OI    28(1),B'&GBIT0&GBIT1&GBIT2&GBIT3&GBIT4&GBIT5&GBIT6&GBIT7*52350000
               '                        EXTENDED FLAGS             @P8C 52400000
.RLST599 ANOP                                                      @L3A 52450000
.******* MODIFICATION COMPLETE - AGO ABOVE TO PRODUCE ENTRY LOGIC       52500000
         AGO   .RLST390                                                 52550000
.******* DIAGNOSTICS                                                    52600000
.ERR04   ANOP                                                           52650000
         MNOTE 8,'*** INVALID OWNER PARAMETER SPECIFIED ***'            52700000
         AGO   .ERTN04                                                  52750000
.ERR05   ANOP                                                           52800000
         MNOTE 8,'*** INVALID ENVIR PARAMETER SPECIFIED ***'            52850000
         AGO   .ERTN05                                                  52900000
.ERR06   ANOP                                                           52950000
         MNOTE 8,'*** INVALID MF PARAMETER SPECIFIED ***'               53000000
         AGO   .ERTN06                                                  53050000
.ERR07   ANOP                                                           53100000
         MNOTE 8,'*** REGISTER ADDRESS SPECIFICATION NOT ALLOWED WITH L-53150000
               IST FORM ***'                                            53200000
         AGO   .ERTN07                                                  53250000
.ERR08   ANOP                                                      @PAA 53260000
         MNOTE 8,'*** RACLIST CAN BE INVOKED ONLY VIA RACROUTE FOR RELEX53270000
               ASE 1.9 AND LATER ***'                              @PAA 53280000
         AGO   .ERTN08                                             @PAA 53290000
.ERR09   ANOP                                                           53300000
         MNOTE 8,'*** ''CLASSNAME'' FORM NOT ALLOWED WITH MF=E ***'     53350000
         AGO   .ERTN09                                                  53400000
.ERR10   ANOP                                                           53450000
         MNOTE 8,'*** ''APPL'' FORM NOT ALLOWED WITH MF=E ***'          53500000
         AGO   .ERTN10                                                  53550000
.ERR11   ANOP                                                      @L7A 53600000
         MNOTE 8,'*** INVALID LOC PARAMETER SPECIFIED ***'         @L7A 53650000
         AGO   .ERTN11                                             @L7A 53700000
.ERR12   ANOP                                                      @L7A 53750000
         MNOTE 8,'*** ''LOC'' ALLOWED ONLY IF RACLIST IS INVOKED FROM T+53800000
               HE RACROUTE MACRO ***'                              @L7A 53850000
         AGO   .ERTN12                                             @L7A 53900000
.ERR13   ANOP                                                      @L1A 53950000
         MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX54000000
               ) ***'                                              @L1A 54050000
         AGO   .ERTN13                                             @L1A 54100000
.ERR14   ANOP                                                      @L1A 54150000
         MNOTE 8,'*** ''FILTER'' ALLOWED ONLY IF RACLIST IS INVOKED FRO+54200000
               M THE RACROUTE MACRO ***'                           @L1A 54250000
         AGO   .ERTN14                                             @L1A 54300000
.ERR15   ANOP                                                      @L1A 54350000
         MNOTE 8,'*** ''FILTER'' AND ''LIST'' CANNOT BE USED CONCURRENT+54400000
               LY ***'                                             @L1A 54450000
         AGO   .ERTN15                                             @L1A 54500000
.ERR16   ANOP                                                      @L1A 54550000
         MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX54600000
               ) ***'                                              @L1A 54650000
         AGO   .ERTN16                                             @L1A 54700000
.ERR17   ANOP                                                      @L1A 54750000
         MNOTE 8,'*** ''MF=M'' PARAMETER SPECIFIED ALLOWED ONLY IF RACL+54800000
               IST IS INVOKED FROM THE RACROUTE MACRO ***'         @L1A 54850000
         AGO   .ERTN17                                             @L1A 54900000
.ERR18   ANOP                                                      @P3A 54950000
         MNOTE 8,'*** INVALID ''SUBPOOL'' PARAMETER ***'           @P3A 55000000
         AGO   .ERTN18                                             @P3A 55050000
.ERR19   ANOP                                                      @L3A 55100000
         MNOTE 8,'*** INVALID GLOBAL PARAMETER SPECIFIED ***'      @L3A 55150000
         AGO   .ERTN19                                             @L3A 55200000
.ERR20   ANOP                                                      @L3A 55250000
         MNOTE 8,'*** ''GLOBAL'' ALLOWED ONLY IF RACLIST IS INVOKED FRO+55300000
               M THE RACROUTE MACRO ***'                                55350000
         AGO   .ERTN20                                             @L3A 55400000
.ERR21   ANOP                                                      @L3A 55450000
         MNOTE 8,'*** FILTER KEYWORD IS INVALID IF GLOBAL=YES IS SPECIF+55500000
               IED ***'                                            @L3A 55550000
         AGO   .ERTN21                                             @L3A 55600000
.ERR22   ANOP                                                      @L3A 55650000
         MNOTE 8,'*** LIST KEYWORD IS INVALID IF GLOBAL=YES IS SPECIFIE+55700000
               D ***'                                              @L3A 55750000
         AGO   .ERTN22                                             @L3A 55800000
.ERLVL1  MNOTE 8,'*** INCORRECT SPECIFICATION OF ''RELEASE'' ***'  @L7A 55850000
         AGO   .ERLVL1R                                            @L7A 55900000
.ERLVL2  MNOTE 4,'*** ''RELEASE-CHECK'' ONLY VALID WITH ''MF=E'' ***'  X55950000
                                                                   @L7A 56000000
         AGO   .ERLVL2R                                            @L7A 56050000
.ERLVLA  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX56100000
               ) ***'                                              @L7A 56150000
         AGO   .ERLVLAR                                            @L7A 56200000
         MEND                                                           56250000
