*                                                                    *  00004600
*  $MAC(RACROUTE) COMP(SC1BN) PROD(RACF):                        @LAC*  00005100
*                                                                    *  00005600
*  DESCRIPTIVE NAME:                                                 *  00006100
*    MACRO INTERFACE TO SAF ROUTER / RACF VM INTERFACE           @M2C*  00006600
*                                                                    *  00007100
* *01* PROPRIETARY STATEMENT=                                         * 00035600
*  **PROPRIETARY_STATEMENT********************************************* 00064100
*                                                                     * 00092600
*                                                                     * 00121100
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00149600
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                       * 00178100
*   5647-A01 (C) COPYRIGHT IBM CORP. 1976, 2000                       * 00206600
*                                                                     * 00235100
*   STATUS= HBB7703                                               @LJC* 00263600
*                                                                     * 00292100
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00320600
*                                                                    *  00350000
*01* EXTERNAL CLASSIFICATION:                                        *  00356200
*02* GUPI:                                                           *  00362400
*01* END OF EXTERNAL CLASSIFICATION:                                 *  00368600
*                                                                    *  00375000
*                                                                       00600000
*  FUNCTION:                                                            00620000
*    THE RACROUTE MACRO PROVIDES A STANDARD INTERFACE TO THE MVS        00640000
*    SYSTEM AUTHORIZATION FACILITY (SAF)                                00660000
*    (MODULE NAME - ICHSFR00)                                           00680000
*    THE RACROUTE MACRO PROVIDES A STANDARD INTERFACE TO THE       @M2A 00700000
*    RACF/VM SERVICE MACHINE IN THE VM ENVIRONMENT.                @D4C 00725000
*    FOR RELEASE 1.8.2, RACROUTE SUPPORTS ONLY AUTHORIZATION       @D4C 00750000
*    CHECKING.                                                     @D4C 00775000
*                                                                       00800000
*  INVOCATION:                                                          00825000
*    THE SAF ROUTER IS INVOKED BY THE RACROUTE MACRO VIA A              00850000
*    BRANCH-AND-LINK INSTRUCTION                                        00875000
*    RACF SERVICES IN THE VM ENVIRONMENT ARE INVOKED VIA THE       @M2A 00900000
*    DIAGNOSE FACILITY WHEN THE RELEASE OF 1.8.2 IS SPECIFIED.     @D4C 00925000
*                                                                       00950000
*    REQUIREMENTS FOR USE - 1) THE CALLER MUST HAVE REGISTER 13         00987500
*                              POINTING TO A SAVE AREA                  01025000
*                              (STANDARD LINKAGE)                       01062500
*                                                                       01100000
*  CHANGE ACTIVITY:                                                     01102800
*    $T0=UZ90211,SAF/RF15,811015,CNTDSD:                           @T0A 01105600
*    $L5=HRF1502,RACF/150,820223,CNTDSD:                           @L5A 01108400
*    $L6=HRF1602,RACF/160,830307,CNTDSD:                           @L6A 01111200
*    UZ90283                                                   @ZA90283 01114000
*    UZ90284                                                   @ZA90284 01116800
*    UZ90285                                                   @ZA90285 01119600
*    $L8=HRF1802,RACF/180,860820,CNTDSD:                           @L8A 01122400
*    $P1=HRF1802,RACF/180,870904,CNTDSD: PEQ0160                   @P1A 01125200
*    $M1=JRF1812,RACF/181,870904,RNH:                              @M1A 01128000
*    $M2=HRF1822,RACF/182,871103,JCD1:                             @M2A 01130800
*    $P2=HRF1822,RACF/182,880119,JCD1:                 PGV0001     @P2C 01133600
*    OY12773                                                   @YA12773 01136400
*    $M3=SP313    RACF/190 880328 PDVSZ1: MVS/SP 3.1.3             @M3A 01139200
*    $M4=SP313    RACF/190 880328 PDTGB1: MVS/SP 3.1.3             @M4A 01142000
*    $M5=SP313    RACF/190 880328 PDI_H1: MVS/SP 3.1.3             @M5A 01144800
*    $M6=SP313    RACF/190 880328 PDLCL1: MVS/SP 3.1.3             @M6A 01147600
*    $M7=SP313    RACF/190 880328 PDPWB1: MVS/SP 3.1.3             @M7A 01150400
*    $P3=PGW0002  RACF/190 880328 PDV_Z1: PTM PGW0002              @P3A 01153200
*    $M8=SP313    RACF/190 880328 PDV_Z1: MVS/SP 3.1.3             @M8A 01156000
*    $P4=PGW0015  RACF/190 880503 PDPWB1: PTM PGW0015              @P4A 01158800
*    $P5=PGW0018  RACF/190 880520 PDPWB1: PTM PGW0018              @P5A 01161600
*    $P6=PGW0017  RACF/190 880615 PDI_H1: PTM PGW0017              @P6A 01164400
*    $P7=PGW0025  RACF/190 880803 PDI_H1: PTM PGW0025              @P7A 01167200
*    $P8=PGW0031  RACF/190 880803 PDPWB1: PTM PGW0031              @P8A 01170000
*    $M9=SP313    RACF/190 880803 PDPWB1: MVS/SP 3.1.3             @M9A 01172800
*    $P9=PGW0035  RACF/190 880914 PDI_H1: PTM PGW0035              @P9A 01175600
*    $Q1=PGW0037  RACF/190 880914 PDI_H1: PTM PGW0037              @Q1A 01178400
*    $Q2=PGW0038  RACF/190 880914 PDI_H1: PTM PGW0038              @Q2A 01181200
*    $D1=DGU0025  RACF/190 881221 PDTGB1: DCR 25                   @D1A 01184000
*    $Q3=PGW0047  RACF/190 881221 PDRTS1: PTM PGW0047              @Q3A 01186800
*    $D2=DGU0045  RACF/190 890117 PDPWB1: DCR 45                   @D2A 01189600
*    $D3=DGU0049  RACF/190 890131 PDPWB1: DCR 49                   @D3A 01192400
*    $Q4=PGW0062  RACF/190 890308 PDPWB1: PTM PGW0062              @Q4A 01195200
*    $N1=VMSFS    RACF/190 881104 PDB_S1: SHARED FILE SYSTEM       @N1A 01196400
*    $N2=VM       RACF/190 881104 PDB_S1: VM SUPPORT               @N2A 01197600
*    $N3=RACSTAT  RACF/190 881104 PDB_S1: SUPPORT RACSTAT          @N3A 01198800
*    $D4=DGU0077  RACF/190 890502 PDJCD1: DCR 77                   @D4A 01199100
*    $Q5=PGP0451  RACF/190 890605 PDB_S1: PTM PGP0451              @Q5A 01199400
*              OY20345                                         @YA20345 01199700
*    $Q6=PGP0412  RACF/190 890719 PDRTS1: PTM PGP0412              @Q6A 01201800
*    $Q7=PGP0415  RACF/190 890719 PDI_H1: PTM PGP0415              @Q7A 01203900
*    $Q8=PGP0399  RACF/190 890815 PDB_S1: PTM PGP0399              @Q8A 01206000
*    $Q9=PGP0552  RACF/190 890915 PDB_S1: PTM PGP0552              @Q9A 01208100
*    $R1=PGP0611  RACF/190 890920 PDB_S1: PTM PGP0611              @R1A 01210400
*    $R2=PI90016  RACF/190 891215 PDB_S1: PTM PI90016              @R2A 01211500
*    $R3=PI90028  RACF/190 891220 PDB_S1: PTM PI90028              @R3A 01212100
*    $R4=PI90037  RACF/190 900321 PDJCD1: PTM PI90037(OY43012 AND  @R4A 01212500
*                                            OY47704)              @R4A 01212900
*    $N4=APPCSPE  RACF/190 900625 PDPSB1: OY39629                  @N4A 01213300
*    $N5=APPCSPE  RACF/190 900625 PDA7  : OY39629                  @N5A 01213700
*    $N6=APPC     RACF/192 900904 PDTGL : SUPPORT FOR APPC         @N6A 01214100
*    $R5=PJA0029  RACF/192 910524 PDPSB1: PTM PJA0029              @R5A 01215100
*    $01=OY47989  RACF/190 911012 PDDLR1: PE OF OY43556            @01A 01215800
*    $L9=HPCS     RACF/210 930429 PDMAS1: RELEASE 2.1 SUPPORT      @L9A 01216300
*    $LA=RELID    RACF/210 930507 PDKAF1: RELEASE 2.1 SUPPORT      @LAA 01216800
*    $D5=OW03465  RACF/210 940305 KDRB:   OW03465 (DCR 40)         @D5A 01217000
*    $LB=OW10709  RACF/220 940512 PDJMV1: RELEASE 2.2 SUPPORT      @LBA 01217100
*    $D6=OW10709  RACF/220 940826 PDSWD1: POSIT DCR 11 DO80011     @D6A 01217200
*    $LC=RELID    RACF/230 960422 PDJMV1: RELEASE 2.3 SUPPORT      @LCA 01217800
*    $R5=PQC1932  RACF/230 960722 PDJMV1: PTM PQC1932              @R5C 01218100
*    $LD=RELID    RACF/240 960718 PD00XB: RELEASE 2.4 SUPPORT      @LDA 01218200
*    $LE=DB2FAST  RACF/240 961118 PDAWS1: DB2 FASTAUTH SUPPORT     @LEA 01218300
*    $LF=DB2FAST  RACF/240 961118 PDWJC1: DB2 FASTAUTH SUPPORT     @LFA 01218600
*    $LG=NQN      HBB6605  970211 PDKJO1: Network qual. names      @LGA 01218700
*    $LH=BOSSTA   HBB6605  970529 PDMKL1: Transportable ACEEs      @LHA 01218800
*    $02=OW24641  RACF/240 970831 PDAWC1: OW24641                  @02A 01218900
*    $03=OW32598  HBB6605  980224 PDMKL1: FASTAUTH RACO Support    @03A 01222800
*    $LI=RELID    HBB6608  980624 PDRDS2: RELEASE 2608 SUPPORT     @LIA 01226700
*    $LJ=DCERT    HBB7703  990325 PDCLC:  Digital Cert Ext.        @LJA 01228600
*                                                                       01230600
*  CHANGE DESCRIPTIONS:                                                 01234500
*    A000000-999999                                                @T0A 01238400
*    A - SUPPORT FOR LOGSTR/RECVR/WRITER KEYWORDS AND MODIFY FORM  @M3A 01257600
*    A - SUPPORT FOR DIRAUTH AND TOKENMAP REQUESTS                 @M4A 01276800
*    A - SUPPORT FOR VERIFYX REQUEST                               @M5A 01296000
*    A - SUPPORT FOR SECLABL KEYWORD ON REQUEST=DEFINE             @M6A 01315200
*    A - SUPPORT FOR FILTER KEYWORD ON REQUEST=LIST                @M7A 01334400
*    C - FIX FOR MF=M AND RACKECK KEYWORDS                         @P3A 01353600
*    A - SUPPORT FOR TOKENXTR AND TOKENBLD REQUESTS AND REMOTE=    @M8A 01372800
*    D - BRANCH/MATCHGEN FROM RACXTRT UNTIL RACXTRT XMITS          @P4A 01392000
*    C - MATCHGEN KEYWORD ON RACXTRT TO MATCHGN                    @P5A 01411200
*    A - FIX FOR MF=S AND TOKNOUT MISSING                          @P6A 01430400
*    A - ISSUE MNOTE WHEN SUBPOOL SPECIFIED FOR TOKENXTR/MAP/BLD   @P7A 01449600
*    A - REQUEST TYPE 12 FOR BRANCH EXTRACT                        @P8A 01468800
*    A - SUPPORT FOR REQUEST=AUDIT                                 @M9A 01488000
*    A - FIX TO ALLOW ENCRYPT KEYWORD FOR VERIFYX REQUEST          @P9A 01507200
*    A - FIX FOR MF=E WHEN DECOUPL IS SPECIFIED                    @Q1A 01526400
*    C - FIX FOR MF=M WHEN DECOUPL IS SPECIFIED                    @Q2A 01545600
*    D - RACHECK WRITER KEYWORD (IMPLEMENTED VIA WRITER CLASS)     @D1A 01564800
*    A - SUPPORT FOR MF=E MSGRTRN AND MSGSP RACROUTE KEYWORDS      @Q3A 01584000
*    A - ADD TOKNIN/TOKNOUT KEYWORDS TO VERIFY/VERIFYX/TOKNBLD,    @D2A 01603200
*        REMOVE UTOKEN. DISALLOW NON-TOKEN RELATED KEYWORDS ON     @D2A 01622400
*        TOKNBLD REQUESTS.                                         @D2A 01641600
*    A - ADD FORMOUT KEYWORD FOR TOKENMAP REQUESTS                 @D3A 01660800
*    C - CORRECT ERROR MESSGAGE FOR NO TOKNOUT ON VERIFYX          @Q4A 01680000
*    A - SUPPORT LONG NAMES IN SHARED FILE SYSTEM, KEYWORDS             01682800
*        ENTITYX, NEWNAMX AND MENTX.                               @N1A 01685600
*    A - VM VERSION OF RACROUTE, SUPPORT KEYWORDS ECB1, ECB2,           01688400
*        POSTEXI, PREEXI AND USERWRD.                              @N2A 01691200
*    A - SUPPORT TO INVOKE THE MACRO RACSTAT                       @N3A 01694000
*    A - ROLLIN OF RACF 1.8.2 DCR 3 AND DCR 77 GENERAL AUDIT       @D4A 01694700
*    D - REMOVE THE KEYWORD ENTITYX IN THE CALL TO FRACHECK.       @Q5A 01695400
*    A - ERROR MESSAGE AND MNOTE FOR TOKENBLD(MF=S) WHEN THERE IS  @Q6A 01695800
*        NO TOKNOUT SPECIFIED.                                     @Q6A 01696200
*    A - MOVE ERROR MESSAGE TO THE RIGHT COLUMN. ALSO FIX THE      @Q7A 01696300
*        CHECKING FOR RELEASE WIHT THE MSGSUPP MSGSP MSGRTGN       @Q7A 01696400
*        KEYWORD.                                                       01696500
*    A - SUPPORT TO ENSURE THAT ALL THE INVALID KEYWORDS ARE       @Q8A 01697200
*        DISALLOWED. DELETE THE DUPLICATE CHECKS FOR THE INVALID   @Q8A 01697900
*        KEYWORDS AND UPDATE COMMENTS.                             @Q8A 01698600
*    A - SUPPORT TO DISALLOW SUBPOOL FOR REQUEST VERIFYX           @Q9A 01698900
*    C - '&RELEASE' TO '&RELEASE'(1,3) FOR LOGICAL COMPARISON      @R1A 01699000
*        WITH '1.9'                                                @R1A 01699100
*    C - CORRRECT SUPPORT FOR RELEASE 1.8.2                        @R2A 01699200
*    C - CORRRECT SUPPORT FOR RELEASE 1.8.2                        @R3A 01699400
*    C - CHANGE EXPANSION TO CHECK FOR ZERO SAF ROUTER ADDRESS          01701100
*        BEFORE CALLING SAF ROUTER                                 @R4A 01702800
*    C - ERROR MESSAGE ERR03 TO ACCEPT A VARIABLE PARAMETER        @N4A 01704500
*    A - FLAG SETTING IN ICHSAFP FOR RACF VERSION/RELEASE          @N4A 01706200
*    A - A SUPPORT FOR TOKENXTR/TOKENMAP IN CROSS MEMORY MODE      @N5A 01707900
*    A - SUPPORT FOR APPC                                          @N6A 01709700
*    C - STATUS TO CORRECTLY CORRESPOND TO MVS LEVEL               @R5A 01716300
*    C - Ship code for cover letter error                          @01A 01720700
*    A - ADD GLOBAL=YES FOR HPCS                                   @L9A 01725100
*    A - Allow RACF release 2.1 to be specified                    @LAA 01727400
*    A - Allow LOG keyword with REQUEST=FASTAUTH                   @D5A 01728500
*    A - Allow RACF release 2.2 to be specified                    @LBA 01728800
*    A - Add new keywords COPY and COPYLEN for REQUEST=STAT.       @D6A 01729100
*    A - Allow RACF release 2.3 to be specified                    @LCA 01729400
*    C - Correct program number in CR statement                    @R5C 01729500
*    A - Allow RACF release 2.4 to be specified                    @LDA 01729600
*    A - Allow ACEEALET keyword to be specified on FASTAUTH macro  @LEA 01732900
*    A - Allow LOGSTR keyword to be specified on FASTAUTH macro    @LFA 01734500
*    A - NQN Support for POENET keyword.                           @LGA 01735300
*    A - BOSS Support for ENVROUT keyword on REQUEST=EXTRACT       @LHA 01735700
*    A - Add DATEFMT keyword to support YR2000                     @02A 01735900
*    A - ADD ENVRIN for FASTAUTH                                   @03A 01736000
*    A - Allow RACF release 2608 to be specified                   @LIA 01736100
*    A - Added support for the X500NAME keyword, allow 7703 to be  @LJA 01737000
*        specified for release                                     @LJA 01737900
*                                                                       01738800
********************************************************************    01739700
         MACRO                                                          01750000
&NAME    RACROUTE &REQUEST=,                                           *01800000
               &REQSTOR=,                                              *01850000
               &SUBSYS=,                                               *01900000
               &WORKA=,                                                *01950000
               &RELATED=,                                              *02000000
               &MF=S,      PARAMS BELOW ARE USED IN FOLLOWING MACROS:  *02050000
               &ACCLVL=,      RACHECK,RACDEF                       @L7A*02100000
               &ACEE=,  RACHECK/AUDIT/DEF/INIT/LIST/XTRT/TKSRV,FRACHECK*02150000
               &ACEEALET=,    FRACHECK                             @LEA*02175000
               &ACTINFO=,     RACINIT                                  *02200000
               &APPL=,   RACHECK,FRACHECK,RACLIST,RACINIT,SIGNON   @N6C*02250000
               &ATTR=,        RACHECK,FRACHECK                         *02300000
               &AUDIT=,       RACDEF                                   *02350000
               &BRANCH=,      RACXTRT                              @M5A*02375000
               &CATGORY=,     RACDEF                               @L7A*02400000
               &CHKAUTH=,     RACDEF                               @L5A*02450000
               &CLASS=,  RACHECK/AUDIT/DEF/LIST/XTRT/STAT,FRACHECK @M9C*02500000
               &DATA=,        RACDEF                                   *02550000
               &DECOUPL=,     ALL SERVICES                         @M3A*02562500
               &DDNAME=,      RACHECK,RACDEF                   @YA12773*02575000
               &DERIVE=,      RACXTRT                              @L8A*02587500
               &DSTYPE=,      RACHECK,RACDEF                           *02600000
               &ECB1=,        RACROUTE/VM                          @N2A*02616600
               &ECB2=,        RACROUTE/VM                          @N2A*02633200
               &ENCRYPT=,     RACINIT,RACXTRT                      @L6A*02650000
               &ENTITY=,      RACHECK,FRACHECK,RACDEF,RACXTRT      @L6A*02700000
               &ENTITYX=,     RACAUDIT,RACHECK,RACDEF,RACXTRT      @M9A*02722200
               &ENTRY=,       RACSTAT                              @N3A*02744400
               &COPY=,        RACSTAT                              @D6A*02751800
               &COPYLEN=,     RACSTAT                              @D6A*02759200
               &DATEFMT=,     RACXTRT                              @02A*02762900
               &ENVIR=,       RACLIST,RACDEF,RACINIT               @P1C*02766600
               &ENVRIN=,      RACINIT,SIGNON,FRACHECK              @03C*02777700
               &ENVROUT=,     RACINIT,SIGNON,RACXTRT               @LHC*02788800
               &ERASE=,       RACDEF                               @L7A*02800000
               &EVENT=,       RACAUDIT                             @M9A*02812500
               &EVQUAL=,      RACAUDIT                             @M9A*02825000
               &EXENODE=,     RACINIT                              @M5A*02837500
               &EXPDT=,       RACDEF                               @L7A*02850000
               &EXPDTX=,      RACDEF                               @L8A*02875000
               &FIELDS=,      RACXTRT                              @L6A*02900000
               &FILESEQ=,     RACHECK,RACDEF                       @L7A*02950000
               &FILTER=,      RACLIST                              @M7A*02970000
               &FLDACC=,      RACXTRT                              @L8A*02990000
               &FORMOUT=,     RACTKSRV                             @D3A*03010000
               &GENERIC=,     RACDEF,RACHECK,RACXTRT               @L8A*03030000
               &GLOBAL=,      RACLIST                              @L9A*03040000
               &GROUP=,       RACINIT,SIGNON                       @N6C*03050000
               &GROUPID=,     RACHECK                              @L8A*03075000
               &INSTLN=,      RACHECK,FRACHECK,RACLIST,RACDEF,RACINIT  *03100000
               &JOBNAME=,     RACINIT                                  *03150000
               &LEVEL=,       RACDEF                                   *03200000
               &LIST=,        RACLIST                                  *03250000
               &LOC=,         RACINIT,RACLIST                      @L7A*03300000
               &LOG=,         RACHECK,RACINIT,RACDAUTH             @L7A*03325000
               &LOGSTR=,      RACHECK,RACINIT,RACAUDIT,FRACHECK    @LFA*03343700
               &LSTTYPE=,     SIGNON                               @N6A*03362500
               &MATCHGN=,     RACXTRT                              @P5A*03375000
               &MCLASS=,      RACDEF                               @L7A*03400000
               &MENTITY=,     RACDEF                                   *03450000
               &MENTX=,       RACDEF                               @N1A*03475000
               &MGENER=,      RACDEF                               @L7A*03500000
               &MGMTCLA=,     RACDEF                               @L8A*03510000
               &MSGRTRN=,     RACROUTE                             @L8A*03520000
               &MSGSP=,       RACROUTE                             @L8A*03530000
               &MSGSUPP=,     RACROUTE                             @P1A*03540000
               &MVOLSER=,     RACDEF                                   *03550000
               &NEWNAME=,     RACDEF                                   *03600000
               &NEWNAMX=,     RACDEF                               @N1A*03625000
               &NEWPASS=,     RACINIT                                  *03650000
               &NOTIFY=,      RACDEF                               @L7A*03700000
               &OIDCARD=,     RACINIT                                  *03750000
               &OLDVOL=,      RACHECK,RACDEF                           *03800000
               &OWNER=,       RACHECK,RACLIST,RACDEF                   *03850000
               &PASSCHK=,     RACINIT                                  *03900000
               &PASSWRD=,     RACINIT                                  *03950000
               &PGMNAME=,     RACINIT                                  *04000000
               &POE=,         RACINIT,SIGNON,TOKENBLD              @N6C*04014500
               &POENET=,      RACINIT,SIGNON,TOKENBLD              @LGA*04029100
               &POSTEXI=,     RACROUTE/VM                          @N2A*04033300
               &PREEXI=,      RACROUTE/VM                          @N2A*04041600
               &PROFILE=,     RACHECK                                  *04050000
               &RELEASE=,     (ALL)                                @L7A*04100000
               &RACFIND=,     RACHECK,RACDEF                       @L5A*04150000
               &RECVR=,       RACHECK                              @M3A*04162500
               &RESULT=,      RACAUDIT                             @D4A*04168700
               &REMOTE=,      RACINIT                              @M8A*04175000
               &RESOWN=,      RACDEF                               @L8A*04187500
               &RETPD=,       RACDEF                               @L7A*04200000
               &RTOKEN=,      RACDAUTH,RACHECK                     @M4A*04216600
               &SECLABL=,     RACDEF,RACINIT,SIGNON                @N6C*04233200
               &SECLVL=,      RACDEF                               @L7A*04250000
               &SEGDATA=,     RACXTRT                              @L8A*04260000
               &SEGMENT=,     RACXTRT                              @L8A*04270000
               &SESSION=,     RACINIT                              @M5A*04280000
               &SGROUP=,      RACINIT                              @M5A*04290000
               &SMC=,         RACINIT                                  *04300000
               &SNODE=,       RACINIT                              @M5A*04316600
               &SUSERID=,     RACINIT                              @M5A*04333200
               &SPECIAL=,     RACDEF                                   *04350000
               &START=,       RACINIT                                  *04400000
               &STAT=,        RACINIT                              @L6A*04450000
               &STATUS=,      RACHECK                              @L7A*04500000
               &STOKEN=,      RACINIT                              @M5A*04516600
               &STORCLA=,     RACDEF                               @L8A*04533200
               &SUBPOOL=,     RACLIST,RACINIT,RACXTRT              @L6A*04550000
               &SYSTEM=,      RACROUTE                             @N6A*04575000
               &TAPELBL=,     RACHECK,RACDEF                       @L7A*04600000
               &TERMID=,      RACINIT                                  *04650000
               &TOKNIN=,      RACTKSRV,RACINIT                     @M4A*04662500
               &TOKNOUT=,     RACTKSRV,RACINIT,SIGNON              @N6C*04675000
               &TRUSTED=,     RACINIT                              @M5A*04687500
               &TYPE=,        RACDEF,RACXTRT,SIGNON                @N6C*04700000
               &UACC=,        RACDEF                                   *04750000
               &UNIT=,        RACDEF                                   *04800000
               &USERID=,      RACINIT,RACHECK,SIGNON               @N6C*04837500
               &USERWRD=,     RACROUTE/VM                          @N2A*04856200
               &UTOKEN=,      RACHECK                              @M5A*04875000
               &VERBEXIT=,    SIGNON                               @N6A*04893700
               &VOLSER=,      RACHECK,RACDEF,RACXTRT               @L8A*04912500
               &WARNING=,     RACDEF                               @L6A*04950000
               &WKAREA=,      FRACHECK                             @N5C*04983300
               &XMREQ=,       RACROUTE                             @LJC*05005500
               &X500NAME=     RACINIT                              @LJA 05027700
.*  DEFINE LOCAL VARIABLES                                              05050000
         LCLA  &RQTYPE             USED TO CONTAIN NUMERIC VALUE        05100000
.*                                 FOR REQUEST TYPE                     05150000
         LCLC  &XTRAPRM      USED FOR ERR03 MNOTE                  @N4A 05175000
         LCLC  &NX                 USED TO CONTAIN SYSNDX FOR LABELS    05200000
         LCLA  &BITA0,&BITA1,&BITA2,&BITA3                     @YA20345 05202700
         LCLA  &BITA4,&BITA5,&BITA6,&BITA7                     @YA20345 05205400
         LCLA  &BITB0,&BITB1,&BITB2,&BITB3                     @YA20345 05208100
         LCLA  &BITB4,&BITB5,&BITB6,&BITB7                     @YA20345 05210800
         LCLA  &SP2                                            @YA20345 05213500
         LCLA  &BIT0,&BIT1,&BIT2,&BIT3,&BIT4,&BIT5,&BIT6,&BIT7     @L8A 05216600
         LCLA  &SP                                                 @L8A 05233200
.*  DEFINE GLOBAL VARIABLES                                             05250000
         GBLC  &ICHL               USED FOR ADDRESS OF RACF PARAM LIST  05300000
         GBLA  &ICHCT              ICHCT - A COUNTER USED TO KEEP       05350000
.*                                 TRACK OF WHERE IN THE PARAMETER      05400000
.*                                 LIST THE PARAMETER IS TO BE          05450000
.*                                 PLACED. ICHCT IS INITIALIZED TO      05500000
.*                                 THE FIRST FULLWORD IN THE LIST       05550000
.*                                 TO BE FILLED IN BY ICHMM,            05600000
.*                                 AND INCREMENTED BY THE INNER         05650000
.*                                 MACRO (ICHMM).                       05700000
         GBLB  &ICHLFS             ICHLFS - SET TO 1 IF RELEASE    @M2A 05705500
.*                                 IS EQUAL TO 1.8.2.              @M2A 05712800
.*                                 ICHLFS COMMUNICATES TO          @M2A 05720100
.*                                 THE RACHECK MACRO THAT THE      @M2A 05727500
.*                                 LIMITED FUNCTION RACROUTE       @M2A 05733000
.*                                 SUPPORT FOR VM HAS BEEN         @M2A 05738500
.*                                 SELECTED.                       @M2A 05744000
         GBLB  &ICHRAC             ICHRAC - A FLAG WHICH IS             05750000
.*                                 INITIALIZED IN THIS MACRO TO         05800000
.*                                 COMMUNICATE TO THE RACF MACRO        05850000
.*                                 THAT THE RACF MACRO IS BEING         05900000
.*                                 INVOKED AS AN INNER MACRO            05950000
.*                                 TO THE RACROUTE MACRO.               06000000
         GBLB  &ICHLIST            ICHLIST - A FLAG WHICH IS SET TO     06050000
.*                                 INDICATE THE FORMAT OF THE MACRO.    06100000
.*                                 FOR LIST FORMAT, ICHLIST IS ON       06150000
.*                                 FOR EXECUTE FORMAT, ICHLIST IS       06200000
.*                                 OFF. FOR STANDARD FORMAT, THERE      06250000
.*                                 ARE TWO PASSES DONE BY THE MACRO     06300000
.*                                 A LIST PASS AND AN EXECUTE PASS.     06350000
.*                                 INITIALLY, FOR STANDARD, THE         06400000
.*                                 FLAG  IS ON - FOR THE LIST PASS.     06450000
.*                                 IT IS THEN TURNED OFF FOR THE        06500000
.*                                 EXECUTE PASS.                        06550000
         GBLB  &ICHNTFY            ICHNTFY - A GLOBAL INDICATOR         06600000
.*                                 WHICH IS USED TO COMMUNICATE WITH    06650000
.*                                 ICHMM - THE INNER MACRO. IF ICHNTFY  06700000
.*                                 IS ON, THE INNER MACRO WILL NOT      06750000
.*                                 ISSUE ITS OWN MNOTE IF IT FINDS AN   06800000
.*                                 ERROR-IT WILL MERELY TURN ON THE     06850000
.*                                 ICHINER FLAG AS NOTIFICATION TO THE  06900000
.*                                 OUTER MACRO, WHICH WILL TAKE THE     06950000
.*                                 APPROPRIATE ACTION.                  07000000
.*                                 IF ICHNTFY IS OFF, THE INNER MACRO   07050000
.*                                 WILL TAKE ACTION ON ITS OWN,         07100000
.*                                 IE. ISSUE AN MNOTE WITH A SEVERITY   07150000
.*                                 CODE OF ITS CHOOSING.                07200000
         GBLB  &ICHINER            ICHINER - A GLOBAL INDICATOR         07250000
.*                                 WHICH IS USED BY ICHMM - AN INNER    07300000
.*                                 MACRO - TO TELL THE OUTER MACRO IF   07350000
.*                                 AN ERROR HAS BEEN DETECTED IN A      07400000
.*                                 PARAMETER.  IF ICHINER IS ON, AN     07450000
.*                                 ERROR HAS BEEN DETECTED.             07500000
         GBLC  &ICHMF              ICHMF - AN INDICATOR OF THE          07550000
.*                                 FORMAT - L, E, OR S.                 07600000
         GBLC  &ICHRLVL            SYMBOL TO WHICH INNER MACRO     @L7A 07650000
.*                                 WILL BRANCH IF AN ERROR IS      @L7A 07700000
.*                                 DETECTED IN 'RELEASE'           @L7A 07750000
.************************                                          @N1A 07752000
.* TEST THAT THE RACROUTE KEYWORDS FOR RELEASE 1.9 AND LATER ARE   @N1A 07754000
.* NOT SPECIFIED WITH PREVIOUS RELEASES.                           @N1A 07756000
.************************                                          @N1A 07758000
.*                                                                      07760000
         AIF   ('&RELEASE(1)' EQ '').ALLTST                        @R2C 07761000
         AIF   ('&RELEASE(1)'(1,3) GE '1.9').NO19TST               @D4C 07762000
.ALLTST  ANOP                                                      @D4A 07763000
         AIF   ('&XMREQ' NE '').ERR22A                             @N5A 07763300
.ERTN22A ANOP                                                      @N5C 07763600
         AIF   ('&DECOUPL' NE '').ERR23                            @N1A 07764000
.ERTN23  ANOP                                                      @N1A 07766000
         AIF   ('&ECB1' NE '').ERR24                               @N2A 07768000
.ERTN24  ANOP                                                      @N2A 07770000
         AIF   ('&ECB2' NE '').ERR25                               @N2A 07772000
.ERTN25  ANOP                                                      @N2A 07774000
         AIF   ('&USERWRD' NE '').ERR26                            @N2A 07776000
.ERTN26  ANOP                                                      @N2A 07778000
         AIF   ('&POSTEXI' NE '').ERR27                            @N2A 07780000
.ERTN27  ANOP                                                      @N2A 07782000
         AIF   ('&PREEXI' NE '').ERR28                             @N2A 07784000
.ERTN28  ANOP                                                      @N2A 07786000
.*                                                                 @N3A 07788000
.* REQUEST=STAT IS INVALID FOR BEFORE RELEASE 1.9                  @N3A 07790000
.*                                                                 @N3A 07792000
         AIF   ('&REQUEST' EQ 'STAT').ERR29                        @N2A 07794000
.ERTN29  ANOP                                                      @N2A 07796000
.NO19TST ANOP                                                      @N2A 07798000
.************************                                          @N6A 07798100
.* TEST THAT THE RACROUTE KEYWORDS FOR RELEASE 1.9.2 ARE NOT       @N6A 07798200
.* SPECIFIED WITH PREVIOUS RELEASES.                               @N6A 07798300
.************************                                          @N6A 07798400
         AIF   ('&RELEASE(1)' EQ '').DO192TS                       @N6A 07798500
         AIF   ('&RELEASE(1)'(1,5) GE '1.9.2' OR                       X07799000
                '&RELEASE(1)'(1,3) GT '1.9').NO192TS               @LAC 07799500
.DO192TS ANOP                                                      @N6A 07800000
         AIF   ('&REQUEST' EQ 'SIGNON').ERR33                      @N6A 07800500
         AIF   ('&SYSTEM' NE '').ERR34                             @N6A 07801000
.ERTN34  ANOP                                                      @N6A 07801500
         AIF   ('&ENVRIN&ENVROUT' NE '').ERR35                     @N6A 07802000
.ERTN35  ANOP                                                      @N6A 07802500
         AIF   ('&DATEFMT' NE '').ERR41                            @02A 07802600
.ERTN41  ANOP                                                      @02A 07802700
.NO192TS ANOP                                                      @N6A 07803000
.************************                                          @L9A 07803500
.* TEST THAT THE RACROUTE KEYWORDS FOR RELEASE 2.1 ARE NOT         @L9A 07807700
.* SPECIFIED WITH PREVIOUS RELEASES.                               @L9A 07811900
.************************                                          @L9A 07816100
         AIF   ('&RELEASE(1)' EQ '').DO21TS                        @L9A 07820300
         AIF   ('&RELEASE(1)'(1,3) GE '2.1').NO21TS                @L9A 07824500
.DO21TS  ANOP                                                      @L9A 07828700
         AIF   ('&GLOBAL' NE '').ERR37                             @L9A 07832900
.ERTN37  ANOP                                                      @L9A 07837100
.NO21TS  ANOP                                                      @L9A 07841300
.************************                                          @D6A 07841600
.* TEST THAT THE RACROUTE KEYWORDS FOR RELEASE 2.2 ARE NOT         @D6A 07841900
.* SPECIFIED WITH PREVIOUS RELEASES.                               @D6A 07842200
.************************                                          @D6A 07842500
         AIF   ('&RELEASE(1)' EQ '').DO22TS                        @D6A 07842800
         AIF   ('&RELEASE(1)'(1,3) GE '2.2').NO22TS                @D6A 07843100
.DO22TS  ANOP                                                      @D6A 07843400
         AIF   ('&COPY' NE '').ERR38                               @D6A 07843700
.ERTN38  ANOP                                                      @D6A 07844000
         AIF   ('&COPYLEN' NE '').ERR39                            @D6A 07844300
.ERTN39  ANOP                                                      @D6A 07844600
.NO22TS  ANOP                                                      @D6A 07844900
.************************                                          @D6A 07845300
.* TEST THAT THE RACROUTE KEYWORDS FOR RELEASE 2.6 ARE NOT         @LGA 07845700
.* SPECIFIED WITH PREVIOUS RELEASES.                               @LGA 07846100
.************************                                          @LGA 07846500
         AIF   ('&RELEASE(1)' EQ '').DO25TS                        @LGA 07846900
         AIF   ('&RELEASE(1)'(1,3) GE '2.6').NO25TS                @LGA 07847300
.DO25TS  ANOP                                                      @LGA 07847700
         AIF   ('&POENET' NE '').ERR40                             @LGA 07848100
.ERTN40  ANOP                                                      @LGA 07848500
.NO25TS  ANOP                                                      @LGA 07848900
.************************                                          @D6A 07852800
.* TEST THAT THE RACROUTE KEYWORDS FOR RELEASE HRF7703 ARE NOT     @LJA 07856700
.* SPECIFIED WITH PREVIOUS RELEASES.                               @LJA 07860600
.************************                                          @LJA 07864500
         AIF   ('&RELEASE(1)' EQ '').DO26TS                        @LJA 07868400
         AIF   ('&RELEASE(1)'(1,4) GE '7703').NO26TS               @LJA 07872300
.DO26TS  ANOP                                                      @LJA 07876200
         AIF   ('&X500NAME' NE '').ERR42                           @LJA 07880100
.ERTN42  ANOP                                                      @LJA 07884000
.NO26TS  ANOP                                                      @LJA 07887900
.************************                                               07891800
.*   INITIALIZE VARIABLES                                               07895700
.************************                                               07900000
&NX      SETC  '&SYSNDX'                                                07950000
&XTRAPRM SETC  'SPECIFIED REQUEST'                                 @N4A 07975000
&ICHL    SETC  'IHB&NX.C'                                               08000000
&ICHNTFY SETB  0                   WANT ICHMM TO ISSUE ERROR MSGS       08050000
&ICHINER SETB  0                   INITIALIZE ICHINER TO 0              08100000
&ICHRAC  SETB  1                   WILL CALL RACF INTERNALLY            08150000
&ICHRLVL SETC  'IHB&NX.E'          INNER MACRO RETURN LABEL        @L7A 08200000
.***********************************                                    08250000
.*   SET UP INDICATORS FOR MF FORMAT                                    08300000
.***********************************                                    08350000
.*  VALIDATE MF PARAMETER                                               08400000
         AIF   ('&MF' NE 'L' AND '&MF' NE 'S' AND '&MF'(1,2) NE        *08428500
               '(E' AND '&MF'(1,2) NE '(M').ERR01                  @M3C 08457000
.*************************************************************     @M3A 08485500
.*  TREAT M FORM JUST LIKE EXECUTE, BUT SKIP THE ROUTER CALL *     @M3A 08514000
.*************************************************************     @M3A 08542500
         AIF   ('&MF(1)' EQ 'E' OR '&MF(1)' EQ 'M').RTE0030        @M3C 08571000
.RTE0010 ANOP                                                           08600000
&ICHLIST SETB  1               MF LIST OR STANDARD                      08650000
         AIF   ('&MF' EQ 'L').RTE0020                                   08700000
&ICHMF   SETC  'S'             STANDARD FORM                            08750000
         AGO   .CONT01                                                  08800000
.RTE0020 ANOP                                                           08850000
&ICHMF   SETC  'L'             LIST FORM                                08900000
         AGO   .CONT01                                                  08950000
.RTE0030 ANOP                                                           09000000
&ICHLIST SETB  0               MF EXECUTE                               09050000
&ICHMF   SETC  'E'                                                      09100000
         AIF   ('&MF(2)' EQ '' OR N'&MF NE 2).ERR01                     09150000
.CONT01  ANOP                                                           09350000
.*                                                                 @M2A 09352300
.****************************************************              @M2A 09354600
.*  VALIDATE THE RELEASE INDICATOR IF SPECIFIED                    @D4C 09358000
.****************************************************              @M2A 09361500
         AIF   ('&RELEASE(1)' NE '1.8.2').RTE0050                  @D4C 09369500
&ICHLFS  SETB  1                VM EXPANSION, LFR SELECTED         @M2A 09377600
.RTE0040 ANOP                                                      @M2A 09378100
         AIF   ('&MF(1)' NE 'M').RTE0050                           @D4A 09378600
         AGO   .ERR01A                                             @D4A 09379100
.RTE0050 ANOP                                                      @M2A 09379900
.****************************************************              @M2A 09389100
.*  REQUEST AND WORKA ARE REQUIRED PARAMETERS                      @M2A 09391400
.****************************************************              @M2A 09396000
         AIF   ('&REQUEST' EQ '').ERR02                                 09400000
         AIF   ('&WORKA' EQ '' AND '&ICHMF' EQ 'S').ERR05               09450000
.*************************************************************     @M2A 09476000
.*  IF THE REQSTOR AND SUBSYS PARAMETERS ARE SPECIFIED             @M2A 09478600
.*  FOR THE LIMITED FUNCTION RACROUTE, FLAG THESE PARAMETERS       @M2A 09481200
.*  AS IGNORED.                                                    @M2A 09483800
.*************************************************************     @M2A 09486400
         AIF   ('&REQSTOR' NE '' AND &ICHLFS).ERR20                @M2A 09489000
.ERTN20  ANOP                                                      @M2A 09491600
         AIF   ('&SUBSYS' NE '' AND &ICHLFS).ERR21                 @M2A 09494200
.ERTN21  ANOP                                                      @M2A 09496800
.****************************************************                   09500000
.*   VALIDATE REQUEST PARAMETER AND SET CORRESPONDING                   09550000
.*   VALUE FOR THE PARAMETER LIST.                                      09600000
.****************************************************                   09650000
         AIF   ('&REQUEST' NE 'AUTH').RTE0100                           09700000
&RQTYPE  SETA  1                                                        09750000
&XTRAPRM SETC  'REQUEST=AUTH'                                      @N4A 09755000
.*                                                                 @N1A 09760000
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N1A 09770000
.*   REQUEST AUTH.                                                 @N1A 09780000
.*                                                                 @N1A 09790000
         AIF   ('&ACTINFO&AUDIT&DATA&ENVIR&GROUP&JOBNAME&LEVEL&LIST&MEN*09800000
               TITY&MVOLSER&NEWNAME&NEWPASS' NE '').ERR03               09850000
         AIF   ('&OIDCARD&PASSCHK&PASSWRD&PGMNAME&SMC&SPECIAL&START&SUB*09900000
               POOL&TERMID&TYPE&UACC&UNIT&WKAREA' NE '').ERR03     @L8A 09950000
         AIF   ('&CHKAUTH' NE '').ERR03                            @L5A 10000000
         AIF   ('&WARNING&STAT&ENCRYPT&FIELDS' NE '').ERR03        @L6A 10050000
         AIF   ('&SEGMENT&SEGDATA' NE '').ERR03                    @L8A 10066600
         AIF   ('&FLDACC&DERIVE' NE '').ERR03                      @L8A 10083200
         AIF   ('&EXPDT&RETPD&CATGORY&SECLVL&ERASE' NE '').ERR03   @L7A 10100000
         AIF   ('&MCLASS&MGENER&NOTIFY&LOC' NE '').ERR03           @L7A 10150000
         AIF   ('&RESOWN&STORCLA&MGMTCLA&EXPDTX' NE '').ERR03      @L8A 10155000
         AIF   ('&TOKNIN&TOKNOUT' NE '').ERR03                     @M5C 10160000
         AIF   ('&STOKEN&SECLABL&EXENODE&SNODE&SUSERID&SGROUP&POE&SESSI*10165000
               ON&TRUSTED' NE '').ERR03                            @M5A 10170000
         AIF   ('&POENET' NE '').ERR03                             @LGA 10172500
         AIF   ('&FILTER' NE '').ERR03                             @M7A 10175000
         AIF   ('&REMOTE' NE '').ERR03                             @M8A 10180000
         AIF   ('&BRANCH&MATCHGN' NE '').ERR03                     @P5A 10185000
         AIF   ('&EVENT&EVQUAL' NE '').ERR03                       @M9A 10190000
         AIF   ('&NEWNAMX&MENTX&ENTRY' NE '').ERR03                @N3C 10192500
         AIF   ('&FORMOUT' NE '').ERR03                            @D3A 10195000
         AIF   ('&RESULT' NE '').ERR03                             @Q8A 10197500
         AIF   ('&XMREQ' NE '').ERR03                              @N5A 10198700
         AIF   ('&LSTTYPE&VERBEXIT&ENVRIN&ENVROUT' NE '').ERR03    @N6A 10198800
         AIF   ('&GLOBAL' NE '').ERR03                             @L9A 10198900
         AIF   ('&COPY' NE '').ERR03                               @D6A 10202800
         AIF   ('&COPYLEN' NE '').ERR03                            @D6A 10206700
         AIF   ('&DATEFMT' NE '').ERR03                            @02A 10208000
         AIF   ('&ACEEALET&X500NAME' NE '').ERR03                  @LJC 10209300
.*                                                                 @N6A 10210600
.* TEST THE KEYWORDS THAT ARE EXTRANEOUS WHEN SYSTEM=YES IS        @N6A 10214500
.* SPECIFIED.                                                      @N6A 10218400
.*                                                                 @N6A 10222300
&XTRAPRM SETC  'REQUEST=AUTH, SYSTEM=YES'                          @N6A 10226200
         AIF   ('&SYSTEM' NE 'YES').CONT02                         @N6A 10230100
         AIF   ('&DSTYPE&OLDVOL&OWNER&PROFILE&USERID&VOLSER&GROUPID&RAC*10234000
               FIND&ACCLVL&GENERIC&FILESEQ&TAPELBL&STATUS&RECVR&RTOKEN&*10237900
               UTOKEN&LOGSTR&DDNAME&ENTITYX' NE '').ERR03          @N6A 10241800
         AGO   .CONT02                                                  10245700
.RTE0100 ANOP                                                           10250000
         AIF   ('&REQUEST' NE 'FASTAUTH').RTE0110                       10300000
         AIF   (&ICHLFS).ERR15                                     @D4C 10325000
&RQTYPE  SETA  2                                                        10350000
&XTRAPRM SETC  'REQUEST=FASTAUTH'                                  @N4A 10355000
.*                                                                 @N1A 10360000
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N1A 10370000
.*   REQUEST FASTAUTH.                                             @N1A 10380000
.*                                                                 @N1A 10390000
         AIF   ('&ACTINFO&AUDIT&DATA&DSTYPE&ENVIR&GROUP&JOBNAME&LEVEL&L*10400000
               IST&MENTITY&MVOLSER&NEWNAME' NE '').ERR03           @D5C 10450000
         AIF   ('&NEWPASS&OIDCARD&OLDVOL&OWNER&PASSCHK&PASSWRD&PGMNAME&*10500000
               PROFILE&SMC&SPECIAL&START&SUBPOOL&TERMID&TYPE&UACC&UNIT&*10550000
               USERID&VOLSER&GROUPID' NE '').ERR03                 @L8A 10600000
         AIF   ('&RACFIND&ACCLVL&CHKAUTH' NE '').ERR03             @L5A 10650000
         AIF   ('&WARNING&STAT&ENCRYPT&GENERIC&FIELDS' NE              *10700000
               '').ERR03                                           @L6A 10750000
         AIF   ('&SEGMENT&SEGDATA' NE '').ERR03                    @L8A 10766600
         AIF   ('&FLDACC&DERIVE' NE '').ERR03                      @L8A 10783200
         AIF   ('&FILESEQ&TAPELBL&STATUS&EXPDT&RETPD&SECLVL&ERASE&MCLAS*10800000
               S&MGENER&NOTIFY&LOC&CATGORY' NE '').ERR03           @L7A 10850000
         AIF   ('&RESOWN&STORCLA&MGMTCLA&EXPDTX' NE '').ERR03      @L8A 10854500
         AIF   ('&RECVR&RTOKEN&TOKNIN&TOKNOUT' NE '').ERR03        @D1C 10859000
         AIF   ('&UTOKEN&STOKEN&SECLABL&EXENODE&SNODE&SUSERID&SGROUP&PO*10863500
               E&SESSION&TRUSTED' NE '').ERR03                     @LFC 10868000
         AIF   ('&POENET' NE '').ERR03                             @LGA 10870200
         AIF   ('&DDNAME' NE '').ERR03                         @YA12773 10872500
         AIF   ('&FILTER' NE '').ERR03                             @M7A 10877000
         AIF   ('&BRANCH&MATCHGN' NE '').ERR03                     @P5A 10881500
         AIF   ('&REMOTE' NE '').ERR03                             @M8A 10886000
         AIF   ('&EVENT&EVQUAL' NE '').ERR03                       @M9A 10890500
         AIF   ('&NEWNAMX&MENTX&ENTRY' NE '').ERR03                @N3C 10892700
         AIF   ('&FORMOUT' NE '').ERR03                            @D3A 10895000
         AIF   ('&RESULT' NE '').ERR03                             @LGC 10896800
         AIF   ('&XMREQ' NE '').ERR03                              @N5A 10898700
         AIF   ('&LSTTYPE&VERBEXIT&ENVROUT&SYSTEM' NE '').ERR03    @03C 10899000
         AIF   ('&GLOBAL' NE '').ERR03                             @L9A 10899300
         AIF   ('&COPY' NE '').ERR03                               @D6A 10899400
         AIF   ('&COPYLEN' NE '').ERR03                            @D6A 10899500
         AIF   ('&DATEFMT&X500NAME' NE '').ERR03                   @LJC 10899600
.*                                                                 @N6A 10899700
         AGO   .CONT02                                                  10900000
.RTE0110 ANOP                                                           10950000
         AIF   ('&REQUEST' NE 'LIST').RTE0120                           11000000
         AIF   (&ICHLFS).ERR16                                     @D4C 11025000
&RQTYPE  SETA  3                                                        11050000
&XTRAPRM SETC  'REQUEST=LIST'                                      @N4A 11055000
.*                                                                 @N1A 11060000
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N1A 11070000
.*   REQUEST LIST.                                                 @N1A 11080000
.*                                                                 @N1A 11090000
         AIF   ('&ACTINFO&ATTR&AUDIT&DATA&DSTYPE&ENTITY&GROUP&JOBNAME&L*11100000
               EVEL&LOG&MENTITY&MVOLSER&NEWNAME' NE '').ERR03           11150000
         AIF   ('&NEWPASS&OIDCARD&OLDVOL&PASSCHK&PASSWRD&PGMNAME&PROFIL*11200000
               E&SMC&SPECIAL&START&TERMID&TYPE&UACC&UNIT&USERID&VOLSER&*11250000
               WKAREA&GROUPID' NE '').ERR03                        @L8A 11300000
         AIF   ('&RACFIND&ACCLVL&CHKAUTH' NE '').ERR03             @L5A 11350000
         AIF   ('&WARNING&STAT&ENCRYPT&GENERIC&FIELDS'  NE             *11400000
               '').ERR03                                           @L6A 11450000
         AIF   ('&SEGMENT&SEGDATA' NE '').ERR03                    @L8A 11466600
         AIF   ('&FLDACC&DERIVE' NE '').ERR03                      @L8A 11483200
         AIF   ('&FILESEQ&TAPELBL&STATUS&EXPDT&RETPD&ERASE&SECLVL&MGENE*11500000
               R&MCLASS&NOTIFY&CATGORY' NE '').ERR03               @L7A 11550000
         AIF   ('&RESOWN&STORCLA&MGMTCLA&EXPDTX' NE '').ERR03      @L8A 11555000
         AIF   ('&LOGSTR&RECVR&REMOTE' NE '').ERR03                @D1C 11560000
         AIF   ('&RTOKEN&TOKNIN&TOKNOUT' NE '').ERR03              @M4A 11565000
         AIF   ('&UTOKEN&STOKEN&SECLABL&EXENODE&SNODE&SUSERID&SGROUP&PO*11570000
               E&SESSION&TRUSTED' NE '').ERR03                     @Q8C 11575000
         AIF   ('&POENET' NE '').ERR03                             @LGA 11577500
         AIF   ('&DDNAME' NE '').ERR03                         @YA12773 11580000
         AIF   ('&BRANCH&MATCHGN' NE '').ERR03                     @P5A 11585000
         AIF   ('&EVENT&EVQUAL' NE '').ERR03                       @M9A 11590000
         AIF   ('&NEWNAMX&MENTX&ENTITYX&ENTRY' NE '').ERR03        @N3C 11592500
         AIF   ('&FORMOUT' NE '').ERR03                            @D3A 11595000
         AIF   ('&RESULT' NE '').ERR03                             @Q8A 11597500
         AIF   ('&LSTTYPE&VERBEXIT&ENVRIN&ENVROUT&SYSTEM' NE '').ERR03  11598300
.*                                                                 @N6A 11599100
         AIF   ('&COPY' NE '').ERR03                               @D6A 11599400
         AIF   ('&COPYLEN' NE '').ERR03                            @D6A 11599700
         AIF   ('&DATEFMT' NE '').ERR03                            @02A 11599800
         AIF   ('&ACEEALET&X500NAME' NE '').ERR03                  @LJC 11599900
         AGO   .CONT02                                                  11600000
.RTE0120 ANOP                                                           11650000
         AIF   ('&REQUEST' NE 'DEFINE').RTE0130                         11700000
         AIF   (&ICHLFS).ERR17                                     @M2A 11725000
&RQTYPE  SETA  4                                                        11750000
&XTRAPRM SETC  'REQUEST=DEFINE'                                    @N4A 11755000
.*                                                                 @N1A 11760000
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N1A 11770000
.*   REQUEST DEFINE.                                               @N1A 11780000
.*                                                                 @N1A 11790000
         AIF   ('&ACTINFO&APPL&ATTR&GROUP&JOBNAME&LIST&LOG&NEWPASS&OIDC*11800000
               ARD&PASSCHK&PASSWRD&PGMNAME&PROFILE&SMC&START&SUBPOOL&TE*11850000
               RMID&USERID&WKAREA&GROUPID' NE '').ERR03            @P5C 11900000
         AIF   ('&STAT&ENCRYPT&FIELDS' NE '').ERR03                @L6A 11950000
         AIF   ('&SEGMENT&SEGDATA' NE '').ERR03                    @L8A 11958300
         AIF   ('&FLDACC&DERIVE' NE '').ERR03                      @L8A 11966600
         AIF   ('&STATUS&LOC&LOGSTR&RECVR' NE '').ERR03            @D1C 11974900
         AIF   ('&RTOKEN&TOKNIN&TOKNOUT' NE '').ERR03              @M4A 11983200
         AIF   ('&UTOKEN&STOKEN&EXENODE&SNODE&SUSERID&SGROUP&POE&SESSIO*11991500
               N&TRUSTED' NE '').ERR03                             @Q8C 11999800
         AIF   ('&POENET' NE '').ERR03                             @LGA 12003900
         AIF   ('&FILTER' NE '').ERR03                             @M7A 12008100
         AIF   ('&BRANCH&MATCHGN' NE '').ERR03                     @P5A 12016400
         AIF   ('&REMOTE' NE '').ERR03                             @M8A 12024700
         AIF   ('&EVENT&EVQUAL' NE '').ERR03                       @M9A 12033000
         AIF   ('&ENTRY' NE '').ERR03                              @N3A 12037100
         AIF   ('&FORMOUT' NE '').ERR03                            @D3A 12041300
         AIF   ('&RESULT' NE '').ERR03                             @Q8A 12045600
         AIF   ('&XMREQ' NE '').ERR03                              @N5A 12047800
         AIF   ('&LSTTYPE&VERBEXIT&ENVRIN&ENVROUT&SYSTEM' NE '').ERR03  12048500
         AIF   ('&GLOBAL' NE '').ERR03                             @L9A 12048800
         AIF   ('&COPY' NE '').ERR03                               @D6A 12048900
         AIF   ('&COPYLEN' NE '').ERR03                            @D6A 12049000
         AIF   ('&DATEFMT' NE '').ERR03                            @02A 12049200
         AIF   ('&ACEEALET&X500NAME' NE '').ERR03                  @LJC 12049400
.*                                                                 @N6A 12049600
         AGO   .CONT02                                                  12050000
.RTE0130 ANOP                                                           12100000
         AIF   ('&REQUEST' NE 'VERIFY').RTE0140                    @L6A 12150000
         AIF   (&ICHLFS).ERR18                                     @D4C 12175000
&RQTYPE  SETA  5                                                        12200000
&XTRAPRM SETC  'REQUEST=VERIFY'                                    @N4A 12205000
.*                                                                 @N1A 12210000
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N1A 12220000
.*   REQUEST VERIFY.                                               @N1A 12230000
.*                                                                 @N1A 12240000
         AIF   ('&ATTR&AUDIT&CLASS&DATA&DSTYPE&ENTITY&LEVEL&LIST&MENTIT*12250000
               Y&MVOLSER&NEWNAME&OLDVOL&OWNER&PROFILE&SPECIAL&TYPE&UACC*12300000
               &UNIT&VOLSER&WKAREA&GROUPID' NE '').ERR03           @L8A 12350000
         AIF   ('&RACFIND&ACCLVL&CHKAUTH' NE '').ERR03             @L5A 12400000
         AIF   ('&WARNING&GENERIC&FIELDS' NE '').ERR03             @L6A 12450000
         AIF   ('&FILESEQ&TAPELBL&STATUS&EXPDT&RETPD&ERASE&SECLVL&MCLAS*12500000
               S&MGENER&NOTIFY&CATGORY' NE '').ERR03               @L7A 12550000
         AIF   ('&SEGMENT&SEGDATA' NE '').ERR03                    @L8A 12555000
         AIF   ('&FLDACC&DERIVE' NE '').ERR03                      @L8A 12560000
         AIF   ('&RESOWN&STORCLA&MGMTCLA&EXPDTX' NE '').ERR03      @L8A 12565000
         AIF   ('&DDNAME' NE '').ERR03                         @YA12773 12570000
         AIF   ('&RTOKEN&UTOKEN&RECVR' NE '').ERR03                @N4C 12575000
         AIF   ('&FILTER' NE '').ERR03                             @M7A 12580000
         AIF   ('&BRANCH&MATCHGN' NE '').ERR03                     @P5A 12585000
         AIF   ('&EVENT&EVQUAL' NE '').ERR03                       @M9A 12590000
         AIF   ('&FORMOUT' NE '').ERR03                            @D3A 12595000
         AIF   ('&NEWNAMX&MENTX&ENTITYX&ENTRY' NE '').ERR03        @N3C 12597500
         AIF   ('&RESULT' NE '').ERR03                             @Q8A 12598700
         AIF   ('&XMREQ' NE '').ERR03                              @N5A 12598900
         AIF   ('&RELEASE(1)' EQ '' AND '&TOKNOUT' NE '').ERR31    @N4C 12599100
         AIF   ('&RELEASE(1)' EQ '' AND '&TOKNOUT' EQ '').CONT02   @N4A 12599300
         AIF   ('&RELEASE(1)'(1,3) LT '1.9' AND '&TOKNOUT' NE '').ERR31*12599500
                                                                   @N4C 12599700
         AIF   ('&LSTTYPE&VERBEXIT' NE '').ERR03                   @N6A 12599800
         AIF   ('&GLOBAL' NE '').ERR03                             @L9A 12599900
         AIF   ('&COPY' NE '').ERR03                               @D6A 12612400
         AIF   ('&COPYLEN' NE '').ERR03                            @D6A 12624900
         AIF   ('&DATEFMT' NE '').ERR03                            @02A 12628000
         AIF   ('&ACEEALET' NE '').ERR03                           @LEA 12631100
         AGO   .CONT02                                             @L6A 12637400
.RTE0140 ANOP  ,                                                   @L6A 12650000
         AIF   ('&REQUEST' NE 'EXTRACT').RTE0150                   @M4C 12675000
         AIF   (&ICHLFS).ERR19                                     @M2A 12700000
         AIF   ('&BRANCH' EQ 'YES').RTE0143                        @P8A 12725000
         AIF   ('&TYPE' EQ 'ENVRXTR').RTE0143                      @LHA 12737500
&RQTYPE  SETA  6                                                   @L6A 12750000
&XTRAPRM SETC  'REQUEST=EXTRACT'                                   @N4A 12765000
         AGO   .RTE0147                                            @P8A 12780000
.RTE0143 ANOP                                                      @P8A 12810000
&RQTYPE  SETA  12                                                  @P8A 12840000
&XTRAPRM SETC  'BRANCH=YES ON REQUEST=EXTRACT'                     @N4A 12855000
.RTE0147 ANOP                                                      @P8A 12870000
.*                                                                 @N1A 12876000
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N1A 12882000
.*   REQUEST EXTRACT.                                              @N1A 12888000
.*                                                                 @N1A 12894000
         AIF   ('&ACTINFO&ATTR&AUDIT&DATA&DSTYPE&LEVEL&LIST&LOG&MENTITY*12900000
               &MVOLSER&NEWNAME&OLDVOL&OWNER&PROFILE&SPECIAL&UACC&UNIT&*12930000
               WKAREA' NE '').ERR03                                @L8A 12960000
         AIF   ('&RACFIND&ACCLVL&CHKAUTH' NE '').ERR03                  12990000
         AIF   ('&WARNING' NE '').ERR03                                 13020000
         AIF   ('&APPL&ENVIR&GROUP&INSTLN&JOBNAME&NEWPASS&OIDCARD&PASSC*13050000
               HK&PASSWRD&PGMNAME&SMC&START&STAT&TERMID&USERID' NE     *13100000
               '').ERR03                                           @L6A 13150000
         AIF   ('&FILESEQ&TAPELBL&STATUS&EXPDT&RETPD&SECLVL&ERASE&MCLAS*13200000
               S&MGENER&NOTIFY&LOC&CATGORY&GROUPID' NE '').ERR03   @L8A 13200700
         AIF   ('&RESOWN&STORCLA&MGMTCLA&EXPDTX' NE '').ERR03      @L8A 13201400
         AIF   ('&RTOKEN&TOKNIN&LOGSTR&RECVR' NE '').ERR03         @D1C 13202100
         AIF   ('&UTOKEN&STOKEN&SECLABL&EXENODE&SNODE&SUSERID&SGROUP&PO*13202800
               E&SESSION&TRUSTED' NE '').ERR03                     @Q8C 13203500
         AIF   ('&POENET' NE '').ERR03                             @LGA 13203800
         AIF   ('&DDNAME' NE '').ERR03                         @YA12773 13204200
         AIF   ('&FILTER' NE '').ERR03                             @M7A 13204900
         AIF   ('&REMOTE' NE '').ERR03                             @M8A 13205600
         AIF   ('&EVENT&EVQUAL' NE '').ERR03                       @M9A 13206300
         AIF   ('&FORMOUT' NE '').ERR03                            @D3A 13207000
         AIF   ('&NEWNAMX&MENTX&ENTRY' NE '').ERR03                @N3C 13207300
         AIF   ('&RESULT' NE '').ERR03                             @Q8A 13207500
         AIF   ('&XMREQ' NE '').ERR03                              @N5A 13207600
         AIF   ('&LSTTYPE&VERBEXIT&ENVRIN&SYSTEM' NE '').ERR03     @LHC 13207700
         AIF   ('&GLOBAL' NE '').ERR03                             @L9A 13207900
         AIF   ('&COPY' NE '').ERR03                               @D6A 13208000
         AIF   ('&COPYLEN' NE '').ERR03                            @D6A 13208100
         AIF   ('&ACEEALET&X500NAME' NE'').ERR03                   @LJC 13208300
.*                                                                 @N6A 13208500
         AGO   .CONT02                                                  13208700
.RTE0150 ANOP  ,                                                   @M4A 13208900
         AIF   ('&REQUEST' NE 'DIRAUTH').RTE0160                   @M4A 13209100
         AIF   (&ICHLFS).ERR13                                     @D4A 13209400
&RQTYPE  SETA  7                                                   @M4A 13209800
&XTRAPRM SETC  'REQUEST=DIRAUTH'                                   @N4A 13209900
.*                                                                 @N1A 13210000
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N1A 13210100
.*   REQUEST DIRAUTH.                                              @N1A 13210200
.*                                                                 @N1A 13210300
         AIF   ('&ACCLVL&ACEE&ACTINFO&APPL&ATTR&AUDIT&CATGORY&CHKAUTH&C*13210500
               LASS&DATA&DERIVE&DSTYPE&ENCRYPT&ENTITY&ENVIR&ERASE&EXPDT*13211200
               &EXPDTX&FIELDS&FILESEQ&FLDACC&GENERIC' NE '').ERR03 @M4A 13211900
         AIF   ('&GROUP&GROUPID&INSTLN&JOBNAME&LEVEL&LIST&LOC&LOGSTR&MC*13212600
               LASS&MENTITY&MGENER&MGMTCLA&MSGRTRN&MSGSP&MSGSUPP&MVOLSE*13213300
               R&NEWNAME&NEWPASS&NOTIFY&OIDCARD' NE '').ERR03      @M4A 13214000
         AIF   ('&OLDVOL&OWNER&PASSCHK&PASSWRD&PGMNAME&PROFILE&RACFIND&*13214700
               RESOWN&RETPD&SECLVL&SEGDATA&SEGMENT&SMC&SPECIAL&START&ST*13215400
               AT&STATUS&SUBPOOL&TAPELBL' NE '').ERR03             @M4A 13216100
         AIF   ('&TERMID&TYPE&UACC&UNIT&USERID&VOLSER&WARNING&WKAREA&TO*13216800
               KNIN&TOKNOUT&RECVR' NE '').ERR03                    @D1C 13217500
         AIF   ('&UTOKEN&STOKEN&SECLABL&EXENODE&SNODE&SUSERID&SGROUP&PO*13218200
               E&SESSION&TRUSTED' NE '').ERR03                     @Q8C 13218900
         AIF   ('&POENET' NE '').ERR03                             @LGA 13219200
         AIF   ('&FILTER' NE '').ERR03                             @M7A 13219600
         AIF   ('&BRANCH&MATCHGN' NE '').ERR03                     @P5A 13220300
         AIF   ('&REMOTE' NE '').ERR03                             @M8A 13221000
         AIF   ('&EVENT&EVQUAL' NE '').ERR03                       @M9A 13221700
         AIF   ('&FORMOUT' NE '').ERR03                            @D3A 13222400
         AIF   ('&NEWNAMX&MENTX&ENTITYX&ENTRY' NE '').ERR03        @N3C 13222700
         AIF   ('&RESULT&STORCLA' NE '').ERR03                     @Q8A 13222900
         AIF   ('&XMREQ' NE '').ERR03                              @N5A 13223000
         AIF   ('&LSTTYPE&VERBEXIT&ENVRIN&ENVROUT&SYSTEM' NE '').ERR03  13223200
         AIF   ('&GLOBAL' NE '').ERR03                             @L9A 13223300
         AIF   ('&COPY' NE '').ERR03                               @D6A 13223400
         AIF   ('&COPYLEN' NE '').ERR03                            @D6A 13223500
         AIF   ('&DATEFMT' NE '').ERR03                            @02A 13223600
         AIF   ('&ACEEALET&X500NAME' NE '').ERR03                  @LJC 13223700
.*                                                                 @N6A 13223900
         AGO   .CONT02                                             @M4A 13224100
.RTE0160 ANOP  ,                                                   @M4A 13224300
         AIF   ('&REQUEST' NE 'TOKENMAP').RTE0170                  @M4A 13224500
         AIF   (&ICHLFS).ERR13A                                    @D4A 13224800
         AIF   ('&XMREQ' EQ 'YES').RTE0162                         @N5A 13225000
&RQTYPE  SETA  8                                                   @M4A 13225200
&XTRAPRM SETC  'REQUEST=TOKENMAP'                                  @N4A 13225300
         AGO   .RTE0164                                            @N5A 13225400
.RTE0162 ANOP                                                      @N5A 13225500
&RQTYPE  SETA  16                                                  @N5A 13225600
&XTRAPRM SETC  'XMREQ=YES ON REQUEST=TOKENMAP'                     @N5A 13225700
.RTE0164 ANOP                                                      @N5A 13225800
.*                                                                 @N1A 13225900
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N1A 13226000
.*   REQUEST TOKENMAP.                                             @N1A 13226100
.*                                                                 @N1A 13226200
         AIF   ('&ACCLVL&ACTINFO&APPL&ATTR&AUDIT&CATGORY&CHKAUTH&CLASS&*13226300
               DATA&DERIVE&DSTYPE&ENCRYPT&ENTITY&ENVIR&ERASE&EXPDT&EXPD*13226600
               TX&FIELDS&FILESEQ&FLDACC&GENERIC' NE '').ERR03      @M4A 13227300
         AIF   ('&GROUP&GROUPID&INSTLN&JOBNAME&LEVEL&LIST&LOC&LOGSTR&MC*13228000
               LASS&MENTITY&MGENER&MGMTCLA&MSGRTRN&MSGSP&MSGSUPP&MVOLSE*13228700
               R&NEWNAME&NEWPASS&NOTIFY&OIDCARD' NE '').ERR03      @M4A 13229400
         AIF   ('&OLDVOL&OWNER&PASSCHK&PASSWRD&PGMNAME&PROFILE&RACFIND&*13230100
               RESOWN&RETPD&SECLVL&SEGDATA&SEGMENT&SMC&SPECIAL&START&ST*13230800
               AT&STATUS&TAPELBL&TERMID&UACC' NE '').ERR03         @M4A 13231500
         AIF   ('&UNIT&USERID&VOLSER&WARNING&WKAREA' NE '').ERR03  @D1C 13232200
         AIF   ('&RECVR&RTOKEN&ACEE&TYPE&FILTER' NE '').ERR03      @D1C 13232900
         AIF   ('&UTOKEN&STOKEN&SECLABL&EXENODE&SNODE&SUSERID&SGROUP&PO*13233600
               E&SESSION&TRUSTED' NE '').ERR03                     @Q8C 13234300
         AIF   ('&POENET' NE '').ERR03                             @LGA 13234600
         AIF   ('&BRANCH&MATCHGN' NE '').ERR03                     @P5A 13235000
         AIF   ('&REMOTE' NE '').ERR03                             @M8A 13235700
         AIF   ('&SUBPOOL' NE '').ERR03                            @P7A 13236400
         AIF   ('&EVENT&EVQUAL' NE '').ERR03                       @M9A 13237100
         AIF   ('&NEWNAMX&MENTX&ENTITYX&ENTRY' NE '').ERR03        @N3C 13237400
         AIF   ('&RESULT&DDNAME&LOG&STORCLA' NE '').ERR03          @Q8A 13237600
         AIF   ('&LSTTYPE&VERBEXIT&ENVRIN&ENVROUT&SYSTEM' NE '').ERR03  13237800
         AIF   ('&GLOBAL' NE '').ERR03                             @L9A 13237900
         AIF   ('&COPY' NE '').ERR03                               @D6A 13238000
         AIF   ('&COPYLEN' NE '').ERR03                            @D6A 13238100
         AIF   ('&DATEFMT' NE '').ERR03                            @02A 13238200
         AIF   ('&ACEEALET&X500NAME' NE '').ERR03                  @LJC 13238300
.*                                                                 @N6A 13238400
         AGO   .CONT02                                             @M4A 13238500
.RTE0170 ANOP                                                      @M4A 13238600
         AIF   ('&REQUEST' NE 'VERIFYX').RTE0180                   @M5A 13239200
         AIF   (&ICHLFS).ERR13B                                    @D4A 13239500
&RQTYPE  SETA  9                                                        13239900
&XTRAPRM SETC  'REQUEST=VERIFYX'                                   @N4A 13240000
.*                                                                 @N1A 13240100
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N1A 13240200
.*   REQUEST VERIFYX.                                              @N1A 13240300
.*                                                                 @N1A 13240400
         AIF   ('&ATTR&AUDIT&CLASS&DATA&DSTYPE&ENTITY&LEVEL&LIST&MENTIT*13240600
               Y&MVOLSER&NEWNAME&OLDVOL&OWNER&PROFILE&SPECIAL&TYPE&UACC*13241300
               &UNIT&VOLSER&WKAREA&GROUPID' NE '').ERR03           @M5A 13242000
         AIF   ('&RACFIND&ACCLVL&CHKAUTH' NE '').ERR03             @M5A 13242700
         AIF   ('&WARNING&GENERIC&FIELDS' NE '').ERR03             @M5A 13243400
         AIF   ('&FILESEQ&TAPELBL&STATUS&EXPDT&RETPD&ERASE&SECLVL&MCLAS*13244100
               S&MGENER&NOTIFY&CATGORY' NE '').ERR03               @M5A 13244800
         AIF   ('&SEGMENT&SEGDATA' NE '').ERR03                    @M5A 13245500
         AIF   ('&FLDACC&DERIVE' NE '').ERR03                      @M5A 13246200
         AIF   ('&RESOWN&STORCLA&MGMTCLA&EXPDTX' NE '').ERR03      @M5A 13246900
         AIF   ('&RTOKEN&UTOKEN&RECVR' NE '').ERR03                @D2C 13247600
         AIF   ('&FILTER' NE '').ERR03                             @M7A 13248300
         AIF   ('&BRANCH&MATCHGN' NE '').ERR03                     @P5A 13249000
         AIF   ('&EVENT&EVQUAL' NE '').ERR03                       @M9A 13249700
         AIF   ('&FORMOUT' NE '').ERR03                            @D3A 13249900
         AIF   ('&NEWNAMX&MENTX&ENTITYX&ENTRY' NE '').ERR03        @N3C 13250100
         AIF   ('&SUBPOOL' NE '').ERR03                            @Q9A 13250200
         AIF   ('&RELEASE' EQ '').ERTN22                           @D4A 13250300
         AIF   ('&XMREQ' NE '').ERR03                              @N5A 13250500
         AIF   ('&ICHMF' EQ 'S' AND '&RELEASE'(1,3) GE '1.9' AND       *13250700
               '&TOKNOUT' EQ '').ERR22                            1@Q8D 13251100
         AIF   ('&GLOBAL' NE '').ERR03                             @L9A 13251800
         AIF   ('&COPY' NE '').ERR03                               @D6A 13252000
         AIF   ('&COPYLEN' NE '').ERR03                            @D6A 13252200
         AIF   ('&DATEFMT' NE '').ERR03                            @02A 13252300
         AIF   ('&ACEEALET&X500NAME' NE '').ERR03                  @LJC 13252400
.ERTN22  ANOP                                                      @P6A 13252500
         AIF   ('&DDNAME&ENVIR&RESULT' NE '').ERR03                @R2M 13252800
         AIF   ('&LSTTYPE&VERBEXIT&ENVRIN&ENVROUT&SYSTEM' NE '').ERR03  13252900
.*                                                                 @N6A 13253000
         AGO   .CONT02                                             @M5A 13253200
.RTE0180 ANOP                                                      @M4A 13253900
         AIF   ('&REQUEST' NE 'TOKENXTR').RTE0185                  @M8A 13254600
         AIF   (&ICHLFS).ERR13C                                    @D4A 13254900
         AIF   ('&XMREQ' EQ 'YES').RTE0184                         @N5A 13255100
&RQTYPE  SETA  10                                                  @M8A 13255300
&XTRAPRM SETC  'REQUEST=TOKENXTR'                                  @N4A 13255400
         AGO   .RTE0187                                            @N5A 13255500
.RTE0184 ANOP                                                      @N5A 13255600
&RQTYPE  SETA  17                                                  @N5A 13255700
&XTRAPRM SETC  'XMREQ=YES ON REQUEST=TOKENXTR'                     @N5A 13255800
.RTE0187 ANOP                                                      @N5A 13255900
.*                                                                 @N1A 13256000
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N1A 13256100
.*   REQUEST TOKENXTR.                                             @N1A 13256200
.*                                                                 @N1A 13256300
         AIF   ('&ATTR&AUDIT&CLASS&DATA&DSTYPE&ENTITY&LEVEL&LIST&MENTIT*13256400
               Y&MVOLSER&NEWNAME&OLDVOL&OWNER&PROFILE&SPECIAL&TYPE&UACC*13256700
               &UNIT&VOLSER&WKAREA&GROUPID' NE '').ERR03           @M8A 13257400
         AIF   ('&RACFIND&ACCLVL&CHKAUTH' NE '').ERR03             @M8A 13258100
         AIF   ('&WARNING&GENERIC&FIELDS' NE '').ERR03             @M8A 13258800
         AIF   ('&FILESEQ&TAPELBL&STATUS&EXPDT&RETPD&ERASE&SECLVL&MCLAS*13259500
               S&MGENER&NOTIFY&CATGORY' NE '').ERR03               @M8A 13260200
         AIF   ('&SEGMENT&SEGDATA' NE '').ERR03                    @M8A 13260900
         AIF   ('&FLDACC&DERIVE' NE '').ERR03                      @M8A 13261600
         AIF   ('&RESOWN&STORCLA&MGMTCLA&EXPDTX' NE '').ERR03      @M8A 13262300
         AIF   ('&RECVR&RTOKEN&ENCRYPT&FILTER&REMOTE' NE '').ERR03 @D1C 13263000
         AIF   ('&BRANCH&MATCHGN' NE '').ERR03                     @P5A 13263700
         AIF   ('&SUBPOOL' NE '').ERR03                            @P7A 13264400
         AIF   ('&EVENT&EVQUAL' NE '').ERR03                       @M9A 13265100
         AIF   ('&FORMOUT' NE '').ERR03                            @D3A 13265800
         AIF   ('&NEWNAMX&MENTX&ENTITYX&ENTRY' NE '').ERR03        @N3C 13266100
         AIF   ('&ACTINFO&DDNAME&ENVIR&EXENODE' NE '').ERR03       @Q8A 13266200
         AIF   ('&GROUP&INSTLN&JOBNAME&LOC&LOG' NE '').ERR03       @Q8A 13266300
         AIF   ('&LOGSTR&NEWPASS&OIDCARD&PASSCHK' NE '').ERR03     @Q8A 13266400
         AIF   ('&PASSWRD&PGMNAME&POE&RESULT' NE '').ERR03         @Q8A 13266500
         AIF   ('&POENET' NE '').ERR03                             @LGA 13266600
         AIF   ('&SECLABL&SESSION&SGROUP&SMC&SNODE' NE '').ERR03   @Q8A 13266700
         AIF   ('&SUSERID&START&STAT&STOKEN&TERMID' NE '').ERR03   @Q8A 13266800
         AIF   ('&TRUSTED&USERID&UTOKEN' NE '').ERR03              @Q8A 13266900
         AIF   ('&LSTTYPE&VERBEXIT&ENVRIN&ENVROUT&SYSTEM' NE '').ERR03  13267000
         AIF   ('&GLOBAL' NE '').ERR03                             @L9A 13267100
         AIF   ('&COPY' NE '').ERR03                               @D6A 13267200
         AIF   ('&COPYLEN' NE '').ERR03                            @D6A 13267300
         AIF   ('&DATEFMT' NE '').ERR03                            @02A 13267400
         AIF   ('&ACEEALET&X500NAME' NE '').ERR03                  @LJC 13267500
.*                                                                 @N6A 13267600
         AGO   .CONT02                                             @M8A 13267700
.RTE0185 ANOP                                                      @M8A 13267800
         AIF   ('&REQUEST' NE 'TOKENBLD').RTE0190                  @M8A 13267900
         AIF   (&ICHLFS).ERR13D                                    @D4A 13268200
&RQTYPE  SETA  11                                                  @M8A 13268600
&XTRAPRM SETC  'REQUEST=TOKENBLD'                                  @N4A 13268700
.*                                                                 @N1A 13268800
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N1A 13268900
.*   REQUEST TOKENBLD.                                             @N1A 13269000
.*                                                                 @N1A 13269100
         AIF   ('&ATTR&AUDIT&CLASS&DATA&DSTYPE&ENTITY&LEVEL&LIST&MENTIT*13269300
               Y&MVOLSER&NEWNAME&OLDVOL&OWNER&PROFILE&SPECIAL&TYPE&UACC*13270000
               &UNIT&VOLSER&WKAREA&GROUPID' NE '').ERR03           @M8A 13270700
         AIF   ('&RACFIND&ACCLVL&CHKAUTH' NE '').ERR03             @M8A 13271400
         AIF   ('&WARNING&GENERIC&FIELDS' NE '').ERR03             @M8A 13272100
         AIF   ('&FILESEQ&TAPELBL&STATUS&EXPDT&RETPD&ERASE&SECLVL&MCLAS*13272800
               S&MGENER&NOTIFY&CATGORY' NE '').ERR03               @M8A 13273500
         AIF   ('&SEGMENT&SEGDATA' NE '').ERR03                    @M8A 13274200
         AIF   ('&FLDACC&DERIVE' NE '').ERR03                      @M8A 13274900
         AIF   ('&RESOWN&STORCLA&MGMTCLA&EXPDTX' NE '').ERR03      @M8A 13275600
         AIF   ('&RTOKEN&UTOKEN&RECVR' NE '').ERR03               1@Q8D 13276600
         AIF   ('&FILTER' NE '').ERR03                             @M8A 13277700
         AIF   ('&BRANCH&MATCHGN' NE '').ERR03                     @P5A 13278400
         AIF   ('&SUBPOOL' NE '').ERR03                            @P7A 13279100
         AIF   ('&EVENT&EVQUAL' NE '').ERR03                       @M9A 13279800
         AIF   ('&ACEE&ACTINFO&APPL&ENCRYPT&INSTLN&JOBNAME&LOC&LOG&NEWP*13280500
               ASS&OIDCARD&PASSCHK&PASSWRD&PGMNAME&SMC&START&STAT&SUBPO*13281200
               OL&LOGSTR' NE '').ERR03                             @D2A 13281900
         AIF   ('&FORMOUT' NE '').ERR03                            @D3A 13282600
         AIF   ('&NEWNAMX&MENTX&ENTITYX&ENTRY' NE '').ERR03        @N3C 13282900
         AIF   ('&DDNAME&ENVIR&RESULT' NE '').ERR03                @Q8A 13283000
         AIF   ('&RELEASE' EQ '').ERTN30                           @R1A 13283100
         AIF   ('&XMREQ' NE '').ERR03                              @N5A 13283200
         AIF   ('&ICHMF' EQ 'S' AND '&RELEASE(1)'(1,3) GE '1.9' AND    *13283300
               '&TOKNOUT' EQ '').ERR30                             @R1C 13283400
         AIF   ('&GLOBAL' NE '').ERR03                             @L9A 13283500
         AIF   ('&COPY' NE '').ERR03                               @D6A 13283600
         AIF   ('&COPYLEN' NE '').ERR03                            @D6A 13283700
         AIF   ('&DATEFMT' NE '').ERR03                            @02A 13283800
         AIF   ('&ACEEALET&X500NAME' NE '').ERR03                  @LJC 13283900
.ERTN30  ANOP                                                      @Q6A 13284000
         AIF   ('&LSTTYPE&VERBEXIT&ENVRIN&ENVROUT&SYSTEM' NE '').ERR03  13284100
.*                                                                 @N6A 13284200
         AGO   .CONT02                                             @M8A 13284300
.RTE0190 ANOP                                                      @M4A 13284400
         AIF   ('&REQUEST' NE 'AUDIT').RTE0200                     @M9A 13284700
         AIF   (&ICHLFS).ERR13E                                    @D4A 13285000
&RQTYPE  SETA  13                                                  @M9A 13285400
&XTRAPRM SETC  'REQUEST=AUDIT'                                     @N4A 13285500
.*                                                                 @N1A 13285600
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N1A 13285700
.*   REQUEST AUDIT.                                                @N1A 13285800
.*                                                                 @N1A 13285900
         AIF   ('&ACCLVL&ACTINFO&APPL&ATTR&AUDIT&CATGORY&CHKAUTH&DATA&D*13286100
               ERIVE&DSTYPE&ENCRYPT&ENTITY&ENVIR&ERASE&EXPDT&EXPDTX&FIE*13286800
               LDS&FILESEQ&FLDACC&GENERIC' NE '').ERR03            @M9A 13287500
         AIF   ('&GROUP&GROUPID&INSTLN&JOBNAME&LEVEL&LIST&LOC&MCLASS&ME*13288200
               NTITY&MGENER&MGMTCLA&MSGRTRN&MSGSP&MSGSUPP&MVOLSER&NEWNA*13288900
               ME&NEWPASS&NOTIFY&OIDCARD' NE '').ERR03             @D4C 13289600
         AIF   ('&OLDVOL&OWNER&PASSCHK&PASSWRD&PGMNAME&PROFILE&RACFIND&*13290300
               RESOWN&RETPD&SECLVL&SEGDATA&SEGMENT&SMC&SPECIAL&START&ST*13291000
               AT&STATUS&SUBPOOL&TAPELBL' NE '').ERR03             @M9A 13291700
         AIF   ('&TERMID&TYPE&UACC&UNIT&USERID&VOLSER&WARNING&WKAREA&TO*13292400
               KNIN&TOKNOUT&RECVR' NE '').ERR03                    @D1C 13293100
         AIF   ('&UTOKEN&STOKEN&SECLABL&EXENODE&SNODE&SUSERID&SGROUP&PO*13293800
               E&SESSION&TRUSTED' NE '').ERR03                     @D4C 13294500
         AIF   ('&POENET' NE '').ERR03                             @LGA 13294800
         AIF   ('&FILTER' NE '').ERR03                             @M9A 13295200
         AIF   ('&BRANCH&MATCHGN' NE '').ERR03                     @M9A 13295900
         AIF   ('&RTOKEN&LOG' NE '').ERR03                         @M9A 13296600
         AIF   ('&REMOTE' NE '').ERR03                             @M9A 13297300
         AIF   ('&FORMOUT' NE '').ERR03                            @D3A 13298000
         AIF   ('&NEWNAMX&MENTX&ENTRY' NE '').ERR03                @N3C 13298300
         AIF   ('&DDNAME&STORCLA' NE '').ERR03                     @Q8A 13298500
         AIF   ('&XMREQ' NE '').ERR03                              @N5A 13298600
         AIF   ('&LSTTYPE&VERBEXIT&ENVRIN&ENVROUT&SYSTEM' NE '').ERR03  13298800
         AIF   ('&GLOBAL' NE '').ERR03                             @L9A 13298900
         AIF   ('&COPY' NE '').ERR03                               @D6A 13299000
         AIF   ('&COPYLEN' NE '').ERR03                            @D6A 13299100
         AIF   ('&DATEFMT' NE '').ERR03                            @02A 13299200
         AIF   ('&ACEEALET&X500NAME' NE '').ERR03                  @LJC 13299300
.*                                                                 @N6A 13299400
         AGO   .CONT02                                             @M9A 13299500
.RTE0200 ANOP                                                      @M9A 13299600
         AIF   ('&REQUEST' NE 'STAT').RTE0205                      @N3A 13299700
         AIF   (&ICHLFS).ERR13F                                    @D4A 13299800
&RQTYPE  SETA  14                                                  @N3A 13299900
&XTRAPRM SETC  'REQUEST=STAT'                                      @N4A 13300000
.*                                                                 @N3A 13300100
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N3A 13300200
.*   REQUEST STAT.                                                 @N4C 13300300
.*                                                                 @N3A 13300400
         AIF   ('&ACCLVL&ACEE&ACTINFO&APPL&ATTR' NE '').ERR03      @N3A 13300500
         AIF   ('&AUDIT&BRANCH&CATGORY&CHKAUTH' NE '').ERR03       @N3A 13300600
         AIF   ('&DATA&DDNAME' NE '').ERR03                        @D4C 13300700
         AIF   ('&DERIVE&DSTYPE&ENCRYPT&ENTITY' NE '').ERR03       @N3A 13300800
         AIF   ('&ENTITYX&ENVIR&ERASE&EVENT' NE '').ERR03          @N3A 13300900
         AIF   ('&EVQUAL&EXENODE&EXPDT&EXPDTX' NE '').ERR03        @N3A 13301000
         AIF   ('&FIELDS&FILESEQ&FILTER&FLDACC' NE '').ERR03       @N3A 13301100
         AIF   ('&GENERIC&GROUP&GROUPID&INSTLN' NE '').ERR03       @N3A 13301200
         AIF   ('&JOBNAME&LEVEL&LIST&LOC&LOG' NE '').ERR03         @N3A 13301300
         AIF   ('&LOGSTR&MATCHGN&MCLASS&MENTITY' NE '').ERR03      @N3A 13301400
         AIF   ('&MENTX&MGENER&MGMTCLA&MSGRTRN' NE '').ERR03       @N3A 13301500
         AIF   ('&MSGSP&MSGSUPP&MVOLSER&NEWNAME' NE '').ERR03      @N3A 13301600
         AIF   ('&NEWNAMX&NEWPASS&NOTIFY&OIDCARD' NE '').ERR03     @N3A 13301700
         AIF   ('&OLDVOL&OWNER&PASSCHK&PASSWRD' NE '').ERR03       @N3A 13301800
         AIF   ('&PGMNAME&POE&PROFILE&RACFIND' NE '').ERR03        @N3A 13301900
         AIF   ('&POENET' NE '').ERR03                             @LGA 13302000
         AIF   ('&RECVR&REMOTE&RESOWN&RETPD' NE '').ERR03          @N3A 13302100
         AIF   ('&RTOKEN&SECLABL&SECLVL&SEGDATA' NE '').ERR03      @N3A 13302200
         AIF   ('&SEGMENT&SESSION&SGROUP&SMC' NE '').ERR03         @N3A 13302300
         AIF   ('&SNODE&SUSERID&SPECIAL&START' NE '').ERR03        @N3A 13302400
         AIF   ('&STAT&STATUS&STOKEN&STORCLA' NE '').ERR03         @N3A 13302500
         AIF   ('&SUBPOOL&TAPELBL&TERMID' NE '').ERR03             @D4C 13302600
         AIF   ('&TOKNIN&TOKNOUT&TRUSTED&TYPE' NE '').ERR03        @N3A 13302700
         AIF   ('&UACC&UNIT&USERID&UTOKEN&VOLSER' NE '').ERR03     @N3A 13302800
         AIF   ('&WARNING&WKAREA' NE '').ERR03                     @N3A 13302900
         AIF   ('&FORMOUT' NE '').ERR03                            @N3A 13303000
         AIF   ('&RESULT' NE '').ERR03                             @Q8A 13303100
         AIF   ('&XMREQ' NE '').ERR03                              @N5A 13303200
         AIF   ('&LSTTYPE&VERBEXIT&ENVRIN&ENVROUT&SYSTEM' NE '').ERR03  13303300
         AIF   ('&DATEFMT' NE '').ERR03                            @02A 13303400
         AIF   ('&GLOBAL' NE '').ERR03                             @L9A 13303500
         AIF   ('&ACEEALET&X500NAME' NE '').ERR03                  @LJC 13303600
.*                                                                 @N6A 13303700
         AGO   .CONT02                                             @N3A 13303800
.RTE0205 ANOP                                                      @N3A 13303900
         AIF   ('&REQUEST' NE 'SIGNON').RTE0208                    @N6A 13304000
&RQTYPE  SETA  15                                                  @N6A 13304100
&XTRAPRM SETC  'REQUEST=SIGNON'                                    @N6A 13304200
.*                                                                 @N6A 13304300
.*   TEST THE KEYWORDS WHICH ARE SPECIFIED AND ARE EXTRANEOUS FOR  @N6A 13304400
.*   REQUEST SIGNON.                                               @N6A 13304500
.*                                                                 @N6A 13304600
         AIF   ('&ACCLVL&ACTINFO&ATTR&AUDIT&BRANCH' NE '').ERR03   @N6A 13304700
         AIF   ('&CATGORY&CHKAUTH&CLASS&DATA' NE '').ERR03         @N6A 13304800
         AIF   ('&DDNAME&DERIVE&DSTYPE&ECB1&ECB2' NE '').ERR03     @N6A 13304900
         AIF   ('&ENCRYPT&ENTITY&ENTITYX&ENTRY&ENVIR' NE '').ERR03 @N6A 13305000
         AIF   ('&ERASE&EVENT&EVQUAL&EXENODE&EXPDT' NE '').ERR03   @N6A 13305100
         AIF   ('&EXPDTX&FIELDS&FILESEQ&FILTER' NE '').ERR03       @N6A 13305200
         AIF   ('&FLDACC&FORMOUT&GENERIC&GROUPID' NE '').ERR03     @N6A 13305300
         AIF   ('&INSTLN&JOBNAME&LEVEL&LIST&LOC&LOG' NE '').ERR03  @N6A 13305400
         AIF   ('&LOGSTR&MATCHGN&MCLASS&MENTITY' NE '').ERR03      @N6A 13305500
         AIF   ('&MENTX&MGENER&MGMTCLA&MSGRTRN&MSGSP' NE '').ERR03 @N6A 13305600
         AIF   ('&MSGSUPP&MVOLSER&NEWNAME&NEWNAMX' NE '').ERR03    @N6A 13305700
         AIF   ('&NEWPASS&NOTIFY&OIDCARD&OLDVOL' NE '').ERR03      @N6A 13305800
         AIF   ('&OWNER&PASSCHK&PASSWRD&PGMNAME' NE '').ERR03      @N6A 13305900
         AIF   ('&POSTEXI&PREEXI&PROFILE&RACFIND' NE '').ERR03     @N6A 13306000
         AIF   ('&RECVR&REMOTE&RESOWN&RETPD&RTOKEN' NE '').ERR03   @N6A 13306100
         AIF   ('&SECLVL&SEGDATA&SEGMENT&SESSION' NE '').ERR03     @N6A 13306200
         AIF   ('&SGROUP&SMC&SNODE&SUSERID&SPECIAL' NE'').ERR03    @N6A 13306300
         AIF   ('&START&STAT&STATUS&STOKEN&STORCLA' NE'').ERR03    @N6A 13306400
         AIF   ('&SUBPOOL&TAPELBL&TERMID&TOKNIN' NE '').ERR03      @N6A 13306500
         AIF   ('&TRUSTED&UACC&UNIT&USERWRD&UTOKEN' NE '').ERR03   @N6A 13306600
         AIF   ('&VOLSER&WARNING&WKAREA' NE '').ERR03              @N6A 13306700
         AIF   ('&XMREQ' NE '').ERR03                              @N6A 13306800
         AIF   ('&SYSTEM' NE '').ERR03                             @N6A 13306900
         AIF   ('&GLOBAL' NE '').ERR03                             @L9A 13307000
         AIF   ('&COPY' NE '').ERR03                               @D6A 13307100
         AIF   ('&DATEFMT' NE '').ERR03                            @02A 13307200
         AIF   ('&COPYLEN' NE '').ERR03                            @D6A 13307300
         AIF   ('&ACEEALET&X500NAME' NE '').ERR03                  @LJC 13307400
         AGO   .CONT02                                             @N6A 13307500
.RTE0208 ANOP                                                      @N6A 13307600
         AGO   .ERR04                                              @M9A 13307700
.CONT02  ANOP                                                           13307800
.****************************************************                   13307900
.*   VALIDATE MESSAGE REQUEST PARAMETER  AND                            13308000
.*   MESSAGE SUBPOOL PARAMETER                                          13308100
.****************************************************                   13308200
         AIF   ('&XMREQ' EQ '').ERTN08Y                            @N5A 13308300
         AIF   ('&XMREQ' EQ 'NO').ERTN08Y                          @N5A 13308400
         AIF   ('&XMREQ' NE 'YES').ERR32                           @N5A 13308500
.ERTN08Y ANOP                                                      @N5A 13308600
&BIT0    SETA  0                                                   @L8A 13308700
         AIF   ('&MSGRTRN' EQ '').CONT06                           @P1C 13308800
         AIF   ('&MSGRTRN' EQ 'NO').CONT06                         @L8A 13308900
         AIF   ('&MSGRTRN' NE 'YES').ERR07                         @L8A 13309000
&BIT0    SETA  1                                                   @L8A 13309100
.ERTN07  ANOP                                                      @M3A 13309200
.CONT06  ANOP                                                      @L8A 13309300
&SP      SETA  0                                                   @Q3M 13309400
         AIF   ('&MSGSP' EQ '').CONT06A                            @Q3C 13309900
         AIF   (T'&MSGSP  NE 'N').ERR06                            @Q3M 13310600
         AIF   (&MSGSP  LT  0  OR   &MSGSP  GT  255).ERR06         @Q3M 13311300
&SP      SETA  &MSGSP                                              @Q3M 13312000
.CONT06A ANOP                                                      @Q3A 13312700
&BIT2    SETA  0                                                   @L8A 13313400
         AIF   ('&MSGSUPP' EQ '').CONT07                           @L8A 13314100
         AIF   ('&MSGSUPP' EQ 'NO').CONT07                         @L8A 13314800
         AIF   ('&MSGSUPP' NE 'YES').ERR08                         @L8A 13315500
&BIT2    SETA  1            INDICATE MESSAGE SUPPRESSION REQUESTED @L8A 13316200
.CONT07  ANOP                                                      @P1A 13316900
&BIT3    SETA  0            PRESET DECOUPL=NO                      @M3A 13317600
         AIF   ('&TYPE'    EQ 'ENVRXTR').CONT07C FOR TYPE=ENVRXTR, @LHA*13317800
                                           DEFAULT TO DECOUPL=YES  @LHA 13318000
         AIF   ('&DECOUPL' EQ '').ERTN08A                          @M3A 13318300
         AIF   ('&DECOUPL' EQ 'NO').ERTN08A                        @M3A 13319000
         AIF   ('&DECOUPL' NE 'YES').ERR08A                        @M3A 13319700
.CONT07C ANOP                                                      @LHA 13320000
&BIT3    SETA  1            INDICATE DECOUPLE=YES REQUESTED        @M3A 13320400
.ERTN08A ANOP               DECOUPL MNOTE RETURN                   @M2A 13321100
&BIT4    SETA  0            PRESET SYSTEM=NO                       @N6A 13321200
         AIF   ('&SYSTEM' EQ '').ERTN08X                           @N6A 13321300
         AIF   ('&SYSTEM' EQ 'NO').ERTN08X                         @N6A 13321400
         AIF   ('&SYSTEM' NE 'YES').ERR36                          @N6A 13321500
&BIT4    SETA  1            INDICATE SYSTEM=YES REQUESTED          @N6A 13321600
.ERTN08X ANOP               MNOTE RETURN                           @N6A 13321700
&BIT1    SETA  0                                                   @P1A 13321800
         AIF   ('&RELEASE' EQ '').CONT08                           @P1A 13322500
         AIF   ('&RELEASE(1)' EQ '1.8.2').CONT07A                  @Q7C 13323600
         AIF   ('&RELEASE(1)' GE '1.8').CONT07B                    @Q7C 13324700
         AGO   .CONT08                                             @M6C 13326000
.CONT07A ANOP                                                      @M6A 13326700
         AIF   (NOT &ICHLFS).CONT07B                               @M6C 13327400
         AIF   ('&MSGRTRN' NE '').ERR09A                           @M2A 13328100
.ERTN09A ANOP                                                      @M2A 13328800
         AIF   ('&MSGSUPP' NE '').ERR10A                           @M2A 13329500
.ERTN10A ANOP                                                      @M2A 13330200
         AIF   ('&MSGSP' NE '').ERR12A                             @M2A 13330900
.ERTN12A ANOP                                                      @M2A 13331600
         AGO   .CONT09                                             @M2A 13332300
.CONT07B ANOP                                                      @M6C 13333000
&BIT1    SETA  1            INDICATE RELEASE 1.8 OR LATER          @P1A 13333700
         AGO   .CONT09                                                  13334400
.CONT08  ANOP               CHECK FOR MSG OPERANDS WITHOUT RELEASE=1.8 +13335100
                            OR LATER                               @P1A 13335800
         AIF   ('&MSGRTRN' NE '').ERR09                            @P1A 13336500
         AIF   ('&MSGSUPP' NE '').ERR10                            @P1A 13337200
         AIF   ('&MSGSP' NE '').ERR12                                   13337900
.CONT09  ANOP               CHECK FOR RELEASE 1.8 OR LATER         @P1A 13338600
.**************************************************************         13350000
.*  BEGIN THE PARAMETER LIST AND ESTABLISH ADDRESSABILITY TO IT         13400000
.*  IN REGISTER 14 FOR MF=S AND MF=E.                                   13450000
.**************************************************************         13500000
.RTE0210 ANOP                                                           13550000
         AIF   ('&ICHMF' EQ 'E').RTE0230                                13600000
         AIF   ('&ICHMF' EQ 'L').RTE0220                                13650000
         CNOP  0,4                                                      13700000
&NAME    BAL   1,IHB&NX.B                                               13750000
         AGO   .RTE0221                                                 13800000
.RTE0220 ANOP                                                           13850000
&NAME    DS    0F                                                       13900000
.RTE0221 ANOP                                                           13950000
IHB&NX.A EQU   *                                                        14000000
         DC    F'0'                 RACF OR INSTALL EXIT RETURN CODE    14050000
         DC    F'0'                 RACF OR INSTALL EXIT REASON CODE    14100000
         AIF   ('&RELEASE' EQ '').REL17PL                          @D4A 14102000
         AIF   ('&RELEASE'(1,3) LT '1.9').REL17PL                  @D4C 14104100
         DC    AL2(104)             LENGTH OF LIST IN BYTES        @N2C 14108200
.*                                                                 @N4D 14112300
         AGO   .RTE0226                                            @N2A 14116400
.REL17PL ANOP                                                      @N2A 14120500
         DC    AL2(40)              LENGTH OF LIST IN BYTES             14150000
.*                                                                 @N4D 14192600
.RTE0226 ANOP                                                      @M2A 14235200
.*************************************************************     @N4A 14235900
.*  SET VERSION/RELEASE INDICATOR - REFERENCE ICHSAFP FOR LIST     @N4A 14236600
.*  OF VERSION/RELEASES AND THEIR CORRESPONDING CODES.  THE        @N4A 14237300
.*  VERSION/RELEASE INDICATOR WILL BE USED FOR DECOUPL VALIDATION. @N4A 14238000
.*************************************************************     @N4A 14238700
         AIF   ('&RELEASE' EQ '').RELNULL                          @N4A 14239400
         AIF   ('&RELEASE' EQ '1.9.2').REL192                      @N6A 14239800
         AIF   ('&RELEASE' EQ '2.1').REL21                         @LAA 14240100
         AIF   ('&RELEASE' EQ '2.2').REL22                         @LBA 14240300
         AIF   ('&RELEASE' EQ '2.3').REL23                         @LCA 14240400
         AIF   ('&RELEASE' EQ '2.4').REL24                         @LDA 14240500
         AIF   ('&RELEASE' EQ '2.6').REL26                         @LGA 14240600
         AIF   ('&RELEASE'(1,4) EQ '2608').REL28                   @LIA 14240700
         AIF   ('&RELEASE'(1,4) EQ '7703').REL7703                 @LJA 14240800
         AIF   ('&RELEASE'(1,4) GT '7703').FUTREL                  @LJC 14240900
.*                                                                 @LJC 14241000
.RELNULL ANOP                     RELEASE NOT SPECIFIED            @N4A 14241200
         DC    AL1(0)             SET VER/REL FLAG TO 1.9 OR PREV  @N4A 14241500
         AGO   .NXTPARM                                            @N4A 14242200
.REL192  ANOP                     RELEASE 1.9.2 SPECIFIED          @N6A 14242300
         DC    AL1(2)             SET VER/REL FLAG TO 1.9.2        @N6A 14242400
         AGO   .NXTPARM                                            @N6A 14242500
.REL21   ANOP                     RELEASE 2.1 SPECIFIED            @LAA 14242600
         DC    AL1(3)             SET VER/REL FLAG TO 2.1          @LAC 14242700
         AGO   .NXTPARM                                            @LAA 14242800
.REL22   ANOP                     RELEASE 2.2 SPECIFIED            @LBA 14242900
         DC    AL1(4)             SET VER/REL FLAG TO 2.2          @LBC 14243000
         AGO   .NXTPARM                                            @LBA 14243100
.REL23   ANOP                     RELEASE 2.3 SPECIFIED            @LCA 14243200
         DC    AL1(5)             SET VER/REL FLAG TO 2.3          @LCC 14243300
         AGO   .NXTPARM                                            @LCA 14243400
.REL24   ANOP                     RELEASE 2.4 SPECIFIED            @LDA 14243500
         DC    AL1(6)             SET VER/REL FLAG TO 2.4          @LDA 14243600
         AGO   .NXTPARM                                            @LDA 14243700
.REL26   ANOP                     RELEASE 2.6 SPECIFIED            @LGA 14243800
         DC    AL1(7)             SET VER/REL FLAG TO 2.6          @LGA 14243900
         AGO   .NXTPARM                                            @LGA 14244000
.REL28   ANOP                     RELEASE 2608 SPECIFIED           @LIA 14244100
         DC    AL1(8)             SET VER/REL FLAG TO 2608         @LIA 14244200
         AGO   .NXTPARM                                            @LIA 14244300
.REL7703 ANOP                     RELEASE 7703 SPECIFIED           @LJA 14244400
         DC    AL1(9)             SET VER/REL FLAG TO 7703         @LJA 14244500
         AGO   .NXTPARM                                            @LJA 14244600
.*************************************************************     @N4A 14244700
.*  THE CODE BEFORE FUTREL SHOULD BE UPDATED TO                    @N4A 14244800
.*  CONTAIN A NEW FLAG CODE WITH EACH NEW VERSION/RELEASE          @N4A 14244900
.*************************************************************     @N4A 14245000
.FUTREL  ANOP                       WHEN THERE IS A NEW RELEASE    @N4A 14245700
         DC    AL1(255)             SET VER/REL FLAG TO NEXT CODE  @N4A 14246400
.NXTPARM ANOP                                                      @N4A 14247100
         DC    AL1(0)               RESERVED                       @N4C 14247800
         DC    AL2(&RQTYPE)         REQUEST BYTE                        14250000
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'  FLAGS  @L8A 14275000
.*                                  MESSAGE RETURN                 @L8A 14300000
         DC    AL1(&SP)             MESSAGE SUBPOOL                @L8A 14325000
         AGO   .CONT03                                                  14350000
.RTE0230 ANOP                                                           14400000
&NAME    IHBINNRA &MF(2)                                                14450000
.CONT03  ANOP                                                           14500000
.*************************************************************          14550000
.*   USING THE INNER MACRO ICHMM , THE PARAMETERS ARE SET INTO          14600000
.*   THE PARAMETER LIST AT THE CORRECT OFFSETS.                         14650000
.*************************************************************          14700000
&ICHCT   SETA  8                    INITIALIZE PARAMETER COUNTER   @N5A 14700800
.******************************************************************@N5A 14701600
.* FOR MF=E OR M TOKENXTR WITH XMREQ SPECIFIED, SET REQTYPE        @N5A 14702400
.******************************************************************@N5A 14703200
         AIF   ('&ICHMF' NE 'E' OR &ICHLIST EQ 1).RTE0268          @N5A 14704000
         AIF   (&RQTYPE NE 10 AND &RQTYPE NE 17).RTE0268           @N5A 14704800
         AIF   (T'&XMREQ EQ 'O').RTE0268                           @N5A 14705600
         LA    15,&RQTYPE           REQUEST TYPE EXTRACT CODE      @N5A 14706400
         STH   15,12(1)                                            @N5A 14707200
.RTE0268 ANOP                                                      @N5A 14708000
&ICHCT   SETA 12                    INITIALIZE PARAMETER COUNTER   @N5A 14708800
.******************************************************************@N5A 14709600
.* FOR MF=E OR M TOKENMAP WITH XMREQ SPECIFIED, SET REQTYPE        @N5A 14710400
.******************************************************************@N5A 14711200
         AIF   ('&ICHMF' NE 'E' OR &ICHLIST EQ 1).RTE0269          @N5A 14712000
         AIF   (&RQTYPE NE 8 AND &RQTYPE NE 16).RTE0269            @N5A 14712800
         AIF   (T'&XMREQ EQ 'O').RTE0269                           @N5A 14713600
         LA    15,&RQTYPE           REQUEST TYPE EXTRACT CODE      @N5A 14714400
         STH   15,12(1)                                            @N5A 14715200
.RTE0269 ANOP                                                      @N5A 14716000
&ICHCT   SETA  4                    INITIALIZE PARAMETER COUNTER        14717800
.******************************************************************@P8A 14735600
.* FOR MF=E OR M EXTRACT WITH BRANCH SPECIFIED, SET REQTYPE        @P8A 14753400
.******************************************************************@P8A 14771200
         AIF   ('&ICHMF' NE 'E' OR &ICHLIST EQ 1).RTE0270          @P8A 14789000
         AIF   (&RQTYPE NE 12 AND &RQTYPE NE 6).RTE0270            @P8A 14806800
         AIF   ('&TYPE' EQ 'ENVRXTR').RTE027                       @LHA 14815700
         AIF   (T'&BRANCH EQ 'O').RTE0270                          @P8A 14824600
.RTE027  ANOP                                                      @LHA 14833500
         LA    15,&RQTYPE           REQUEST TYPE EXTRACT CODE      @P8A 14842400
         STH   15,12(1)                                            @P8A 14860200
.RTE0270 ANOP                                                      @P8A 14878000
         ICHMM &REQSTOR             REQUESTOR ADDRESS                   14895800
         ICHMM &SUBSYS              SUBSYSTEM ADDRESS                   14913600
         ICHMM &WORKA               WORK AREA ADDRESS                   14931400
         AIF   (NOT &ICHLIST).CONT04                                    14950000
         DC    A(0)                 MESSAGE RETURN ADDRESS              14975000
         DC    A(0)                 RESVD                               15000000
         DC    A(&ICHL-IHB&NX.A)    OFFSET TO RACF PARAMETER LIST       15100000
         AIF   ('&RELEASE' EQ '').CONT04A                          @D4A 15103300
         AIF   ('&RELEASE'(1,3) LT '1.9').CONT04A                  @D4C 15106600
         DC    F'0'                 SAF RETURN CODE                @N2C 15113200
         DC    F'0'                 SAF REASON CODE                @N2C 15119800
         DC    AL2(64)              EXTENSION LENGTH               @N2A 15145100
         DC    AL2(0)               RESVD                          @M2A 15146300
         DC    A(0)                 RETURN DATA ADDRESS            @N2A 15147500
         DC    A(0)                 FLAT PLIST ADDRESS             @N2A 15148700
.CONT04  ANOP                                                           15150000
&ICHCT   SETA  15                   INITIALIZE PARAMETER COUNTER   @D4C 15150500
         ICHMM &ECB1                ECB1 ADDRESS                   @N2A 15151000
         ICHMM &ECB2                ECB2 ADDRESS                   @N2A 15151500
         AIF   (NOT &ICHLIST).CONT04B                              @N2A 15152000
         DC    A(0)                 PREVIOUS FLAT PLIST ADDRESS    @N2A 15152500
         DC    A(0)                 NEXT FLAT PLIST ADDRESS        @N2A 15153000
         DC    A(0)                 ORIGINAL PLIST ADDRESS         @N2A 15153500
         DC    F'0'                 FLAT PLIST LENGTH              @N2A 15154000
.CONT04B ANOP                                                      @N2A 15154500
&ICHCT   SETA  21                   INITIALIZE PARAMETER COUNTER   @D4C 15155000
         ICHMM &USERWRD             USERWORD                       @N2A 15155500
         ICHMM &PREEXI              PRE-PROCESSING VM EXIT         @N2A 15156000
         ICHMM &POSTEXI             PRE-PROCESSING VM EXIT         @N2A 15156500
         AIF   (NOT &ICHLIST).CONT04A                              @D4C 15157000
         DC    A(0)                 ASYNCHRONOUS ECB ADDRESS       @N2A 15157500
         DC    A(0)                 USED IN VM ENVIRONMENT         @N2A 15158000
.CONT04A ANOP                                                      @M2A 15190000
.***************************************************************        15200000
.*  AT THIS POINT, THE LIST AND EXECUTE FORMS ARE COMPLETED.  IF        15250000
.*  THE LIST PASS OF THE STANDARD FORM HAS JUST BEEN COMPLETED,         15300000
.*  RETURN FOR AN EXECUTE PASS.                                         15350000
.***************************************************************        15400000
         AIF   ('&ICHMF' NE 'S').CONT05                                 15450000
         AIF   (NOT &ICHLIST).CONT05                                    15500000
&ICHLIST SETB  0                                                        15550000
IHB&NX.B DS    0H                                                       15600000
         AGO   .CONT03           DO EXECUTE PATH OF STANDARD FORM       15650000
.CONT05  ANOP                                                           15700000
         AIF   ('&ICHMF' NE 'E').NECONT                        @YA20345 15700900
.*  COMPLETE THE EXECUTE FORM WITH ALREADY VALIDATED KEYWORDS  @YA20345 15701800
         AIF   ('&MSGSP' EQ '').ECONT1                         @YA20345 15702700
         AIF   (T'&MSGSP  NE 'N').ERR06                        @YA20345 15703600
         AIF   (&MSGSP  LT  0  OR   &MSGSP  GT  255).ERR06     @YA20345 15704500
&SP2     SETA  &MSGSP                                          @YA20345 15705400
         MVI   15(1),&SP2           MESSAGE SUBPOOL            @YA20345 15706300
.ECONT1  ANOP                                                  @YA20345 15707200
.*  INITIALIZE BITS FOR KEYWORDS SPECIFIED ON EXECUTE FORM     @YA20345 15708100
&BITA0   SETA  1                                               @YA20345 15709000
&BITA1   SETA  1                                               @YA20345 15709900
&BITA2   SETA  1                                               @YA20345 15710800
&BITA3   SETA  1                                               @YA20345 15711700
&BITA4   SETA  1                                               @YA20345 15712600
&BITA5   SETA  1                                               @YA20345 15713500
&BITA6   SETA  1                                               @YA20345 15714400
&BITA7   SETA  1                                               @YA20345 15715300
&BITB0   SETA  0                                               @YA20345 15716200
&BITB1   SETA  0                                               @YA20345 15717100
&BITB2   SETA  0                                               @YA20345 15718000
&BITB3   SETA  0                                               @YA20345 15718900
&BITB4   SETA  0                                               @YA20345 15719800
&BITB5   SETA  0                                               @YA20345 15720700
&BITB6   SETA  0                                               @YA20345 15721600
&BITB7   SETA  0                                               @YA20345 15722500
.*  SET BITS AND GENERATE INSTRUCTIONS TO MODIFY LIST FORM     @YA20345 15723400
         AIF   ('&MSGRTRN' NE 'NO').ECONT2                     @YA20345 15724300
&BITA0   SETA  0                                               @YA20345 15725200
.ECONT2  ANOP                                                  @YA20345 15726100
         AIF   ('&MSGSUPP' NE 'NO').ECONT3                     @YA20345 15727000
&BITA2   SETA  0                                               @YA20345 15727900
.ECONT3  ANOP                                                  @YA20345 15728800
         AIF   ('&BITA0&BITA1&BITA2&BITA3&BITA4&BITA5&BITA6&BITA7' EQ  *15729700
               '11111111').ECONT4                              @YA20345 15730600
         NI    14(1),B'&BITA0&BITA1&BITA2&BITA3&BITA4&BITA5&BITA6&BITA7*15731500
               '                                               @YA20345 15732400
.ECONT4  ANOP                                                  @YA20345 15733300
         AIF   ('&MSGRTRN' NE 'YES').ECONT5                    @YA20345 15734200
&BITB0   SETA  1                                               @YA20345 15735100
.ECONT5  ANOP                                                  @YA20345 15736000
         AIF   ('&MSGSUPP' NE 'YES').ECONT6                    @YA20345 15736900
&BITB2   SETA  1                                               @YA20345 15737800
.ECONT6  ANOP                                                  @YA20345 15738700
         AIF   ('&RELEASE' EQ '').ECONT7                       @YA20345 15739600
         AIF   ('&RELEASE(1)' NE '1.8' AND '&RELEASE(1)' NE '1.8.1'    *15740500
               AND '&RELEASE(1)' NE '1.8.2').ECONT7            @YA20345 15741400
&BITB1   SETA  1                                               @YA20345 15742300
.ECONT7  ANOP                                                  @YA20345 15743200
         AIF   ('&BITB0&BITB1&BITB2&BITB3&BITB4&BITB5&BITB6&BITB7' EQ  *15744100
               '00000000').NECONT                              @YA20345 15745000
         OI    14(1),B'&BITB0&BITB1&BITB2&BITB3&BITB4&BITB5&BITB6&BITB7*15745900
               '                                               @YA20345 15746800
.*****************************************************                  15750000
.*  THE RACF MACRO CORRESPONDING TO THE REQUEST TYPE                    15800000
.*  IS INVOKED, PASSING TO IT THE RELEVANT PARAMETERS.                  15850000
.*****************************************************                  15900000
.NECONT  ANOP                                                  @YA20345 15925000
         AIF   ('&ICHMF' EQ 'L').RTE0400                                15950000
.*  SAVE ADDRESSABILITY TO RACROUTE LIST IN REGISTER 14                 16000000
         LR    14,1                 SAVE RACROUTE LIST ADDR             16050000
.RTE0400 ANOP                                                           16100000
         AIF   (&RQTYPE NE 1).RTE2                                      16150000
.RTE1    ANOP                                                           16200000
         RACHECK ACCLVL=&ACCLVL,                                   @L5A*16250000
               ACEE=&ACEE,                                             *16300000
               APPL=&APPL,                                             *16350000
               ATTR=&ATTR,                                             *16400000
               CLASS=&CLASS,                                           *16450000
               DDNAME=&DDNAME,                                 @YA12773*16475000
               DSTYPE=&DSTYPE,                                         *16500000
               ENTITY=&ENTITY,                                         *16550000
               ENTITYX=&ENTITYX,                                   @N1A*16575000
               FILESEQ=&FILESEQ,                                   @L7A*16600000
               GENERIC=&GENERIC,                                   @L6A*16650000
               GROUPID=&GROUPID,                                   @L8A*16675000
               INSTLN=&INSTLN,                                         *16700000
               LOG=&LOG,                                               *16750000
               LOGSTR=&LOGSTR,                                     @M3A*16775000
               OLDVOL=&OLDVOL,                                         *16800000
               OWNER=&OWNER,                                           *16850000
               PROFILE=&PROFILE,                                       *16900000
               RACFIND=&RACFIND,                                   @L5A*16950000
               RECVR=&RECVR,                                       @P3A*16975000
               RELEASE=&RELEASE,                                   @L7A*17000000
               RTOKEN=&RTOKEN,                                     @P3A*17025000
               STATUS=&STATUS,                                     @L7A*17050000
               TAPELBL=&TAPELBL,                                   @L7A*17100000
               USERID=&USERID,                                     @L8A*17125000
               UTOKEN=&UTOKEN,                                     @P3A*17150000
               VOLSER=&VOLSER,                                     @D1D*17175000
               MF=&MF                                                   17200000
         AGO   .RTE0410                                                 17250000
.RTE2    ANOP                                                           17300000
         AIF   (&RQTYPE NE 2).RTE3                                      17350000
         FRACHECK ACEE=&ACEE,                                          *17400000
               ACEEALET=&ACEEALET,                                 @LEA*17425000
               ENVRIN=&ENVRIN,                                     @03A*17437500
               APPL=&APPL,                                             *17450000
               ATTR=&ATTR,                                             *17500000
               CLASS=&CLASS,                                           *17550000
               ENTITY=&ENTITY,                                     @Q5D*17600000
               ENTITYX=&ENTITYX,                                   @LGA*17625000
               INSTLN=&INSTLN,                                         *17650000
               RELEASE=&RELEASE,                                   @L7A*17700000
               WKAREA=&WKAREA,                                         *17750000
               LOG=&LOG,                                           @D5A*17775000
               LOGSTR=&LOGSTR,                                     @LFA*17787500
               MF=&MF                                                   17800000
         AGO   .RTE0410                                                 17850000
.RTE3    ANOP                                                           17900000
         AIF   (&RQTYPE NE 3).RTE4                                      17950000
         RACLIST ACEE=&ACEE,                                           *18000000
               APPL=&APPL,                                             *18050000
               CLASS=&CLASS,                                           *18100000
               ENVIR=&ENVIR,                                           *18150000
               GLOBAL=&GLOBAL,                                         *18175000
               INSTLN=&INSTLN,                                     @L9A*18200000
               LOC=&LOC,                                           @L7A*18250000
               LIST=&LIST,                                             *18300000
               FILTER=&FILTER,                                     @M7A*18325000
               OWNER=&OWNER,                                           *18350000
               RELEASE=&RELEASE,                                   @L7A*18400000
               SUBPOOL=&SUBPOOL,                                       *18450000
               MF=&MF                                                   18500000
         AGO   .RTE0410                                                 18550000
.RTE4    ANOP                                                           18600000
         AIF   (&RQTYPE NE 4).RTE5                                      18650000
         RACDEF ACCLVL=&ACCLVL,                                    @L7A*18700000
               ACEE=&ACEE,                                         @L7A*18750000
               AUDIT=&AUDIT,                                           *18800000
               CATGORY=&CATGORY,                                   @L7A*18850000
               CHKAUTH=&CHKAUTH,                                   @L5A*18900000
               CLASS=&CLASS,                                           *18950000
               DATA=&DATA,                                             *19000000
               DDNAME=&DDNAME,                                 @YA12773*19025000
               DSTYPE=&DSTYPE,                                         *19050000
               ENTITY=&ENTITY,                                         *19100000
               ENTITYX=&ENTITYX,                                   @N1A*19112500
               ENVIR=&ENVIR,                                       @L8A*19125000
               ERASE=&ERASE,                                       @L7A*19150000
               EXPDT=&EXPDT,                                       @L7A*19200000
               EXPDTX=&EXPDTX,                                     @L8A*19225000
               FILESEQ=&FILESEQ,                                   @L7A*19250000
               GENERIC=&GENERIC,                                   @L6A*19300000
               INSTLN=&INSTLN,                                         *19350000
               LEVEL=&LEVEL,                                           *19400000
               MCLASS=&MCLASS,                                     @L7A*19450000
               MENTITY=&MENTITY,                                       *19500000
               MENTX=&MENTX,                                       @N1A*19525000
               MGENER=&MGENER,                                     @L7A*19550000
               MGMTCLA=&MGMTCLA,                                   @L8A*19575000
               MVOLSER=&MVOLSER,                                       *19600000
               NEWNAME=&NEWNAME,                                       *19650000
               NEWNAMX=&NEWNAMX,                                   @N1A*19675000
               NOTIFY=&NOTIFY,                                     @L7A*19700000
               OLDVOL=&OLDVOL,                                         *19750000
               OWNER=&OWNER,                                           *19800000
               RACFIND=&RACFIND,                                   @L5A*19850000
               RELEASE=&RELEASE,                                   @L7A*19900000
               RESOWN=&RESOWN,                                     @L8A*19925000
               RETPD=&RETPD,                                       @L7A*19950000
               SECLABL=&SECLABL,                                   @M6A*19975000
               SECLVL=&SECLVL,                                     @L7A*20000000
               SPECIAL=&SPECIAL,                                       *20050000
               STORCLA=&STORCLA,                                   @L8A*20075000
               TAPELBL=&TAPELBL,                                   @L7A*20100000
               TYPE=&TYPE,                                             *20150000
               UACC=&UACC,                                             *20200000
               UNIT=&UNIT,                                             *20250000
               VOLSER=&VOLSER,                                         *20300000
               WARNING=&WARNING,                                   @L6A*20350000
               MF=&MF                                                   20400000
         AGO   .RTE0410                                                 20450000
.RTE5    ANOP                                                           20500000
         AIF   (&RQTYPE NE 5).RTE6                                 @L6A 20550000
         RACINIT ACEE=&ACEE,                                           *20600000
               ACTINFO=&ACTINFO,                                       *20650000
               APPL=&APPL,                                             *20700000
               ENCRYPT=&ENCRYPT,                                   @L6A*20750000
               ENVIR=&ENVIR,                                           *20800000
               GROUP=&GROUP,                                           *20850000
               INSTLN=&INSTLN,                                         *20900000
               JOBNAME=&JOBNAME,                                       *20950000
               LOC=&LOC,                                           @L7A*21000000
               LOG=&LOG,                                           @L7A*21050000
               NEWPASS=&NEWPASS,                                       *21100000
               OIDCARD=&OIDCARD,                                       *21150000
               PASSCHK=&PASSCHK,                                       *21200000
               PASSWRD=&PASSWRD,                                       *21250000
               PGMNAME=&PGMNAME,                                       *21300000
               RELEASE=&RELEASE,                                   @L7A*21350000
               SMC=&SMC,                                               *21400000
               START=&START,                                           *21450000
               STAT=&STAT,                                         @L6A*21500000
               SUBPOOL=&SUBPOOL,                                       *21550000
               TERMID=&TERMID,                                         *21600000
               USERID=&USERID,                                         *21650000
               TOKNIN=&TOKNIN,                                     @D2C*21653800
               TOKNOUT=&TOKNOUT,                                   @N4A*21655700
               STOKEN=&STOKEN,                                     @M5A*21657600
               SECLABL=&SECLABL,                                   @M5A*21661400
               EXENODE=&EXENODE,                                   @M5A*21665200
               SNODE=&SNODE,                                       @M5A*21669000
               SUSERID=&SUSERID,                                   @M5A*21672800
               SGROUP=&SGROUP,                                     @M5A*21676600
               POE=&POE,                                           @M5A*21680400
               POENET=&POENET,                                     @LGA*21682300
               LOGSTR=&LOGSTR,                                     @M5A*21684200
               SESSION=&SESSION,                                   @M5A*21688000
               TRUSTED=&TRUSTED,                                   @M5A*21691800
               REMOTE=&REMOTE,                                     @M8A*21695600
               ENVRIN=&ENVRIN,                                     @N6A*21697000
               ENVROUT=&ENVROUT,                                   @N6A*21698400
               X500NAME=&X500NAME,                                 @LJA*21699200
               MF=&MF                                                   21700000
         AGO   .RTE0410                                            @L6A 21750000
.RTE6    ANOP  ,                                                   @L8A 21783300
         AIF   (&RQTYPE NE 6 AND &RQTYPE NE 12).RTE7               @P8C 21816600
         RACXTRT ENTITY=&ENTITY,                                   @L6A*21850000
               ENTITYX=&ENTITYX,                                   @N1A*21875000
               ACEE=&ACEE,                                         @L6A*21900000
               ENCRYPT=&ENCRYPT,                                   @L6A*21950000
               ENVROUT=&ENVROUT,                                   @LHA*21975000
               FIELDS=&FIELDS,                                     @L6A*22000000
               RELEASE=&RELEASE,                                   @L7A*22050000
               SUBPOOL=&SUBPOOL,                                   @L6A*22100000
               TYPE=&TYPE,                                         @L6A*22150000
               CLASS=&CLASS,                                       @L8A*22155000
               SEGMENT=&SEGMENT,                                   @L8A*22160000
               SEGDATA=&SEGDATA,                                   @L8A*22165000
               VOLSER=&VOLSER,                                     @L8A*22170000
               GENERIC=&GENERIC,                                   @L8A*22175000
               DERIVE=&DERIVE,                                     @L8A*22180000
               FLDACC=&FLDACC,                                     @L8A*22185000
               BRANCH=&BRANCH,                                     @P4C*22190000
               MATCHGN=&MATCHGN,                                   @P5C*22195000
               DATEFMT=&DATEFMT,                                   @02A*22197500
               MF=&MF                                              @L6A 22200000
         AGO   .RTE0410                                            @M4A 22200700
.RTE7    ANOP  ,                                                   @M4A 22201400
         AIF   (&RQTYPE NE 7).RTE8                                 @M4A 22202100
         RACDAUTH RTOKEN=&RTOKEN,                                  @M4A*22202800
               LOG=&LOG,                                           @M4A*22203500
               RELEASE=&RELEASE,                                   @M4A*22204200
               MF=&MF                                              @P3C 22204900
         AGO   .RTE0410                                            @M4A 22205600
.RTE8    ANOP  ,                                                   @M4A 22206300
         AIF   (&RQTYPE NE 8 AND &RQTYPE NE 10 AND &RQTYPE NE 16 AND   *22206700
               &RQTYPE NE 17).RTE9                                 @N5C 22207100
         RACTKSRV TOKNIN=&TOKNIN,                                  @M4A*22207700
               ACEE=&ACEE,                                         @M3A*22208400
               TOKNOUT=&TOKNOUT,                                   @M4A*22209100
               FORMOUT=&FORMOUT,                                   @D3A*22209800
               RELEASE=&RELEASE,                                   @M4A*22210500
               MF=&MF                                              @P3C 22211200
         AGO   .RTE0410                                            @M4A 22211900
.RTE9    ANOP  ,                                                   @M5A 22212600
         AIF   (&RQTYPE NE 9 AND &RQTYPE NE 11).RTE10              @M9C 22213300
         RACINIT ENVIR=VERIFYX,                                    @M5A*22214000
               ACEE=&ACEE,                                         @M5A*22214700
               ACTINFO=&ACTINFO,                                   @M5A*22215400
               APPL=&APPL,                                         @M5A*22216100
               ENCRYPT=&ENCRYPT,                                   @M5A*22216800
               GROUP=&GROUP,                                       @M5A*22217500
               INSTLN=&INSTLN,                                     @M5A*22218200
               JOBNAME=&JOBNAME,                                   @M5A*22218900
               LOC=&LOC,                                           @M5A*22219600
               LOG=&LOG,                                           @M5A*22220300
               NEWPASS=&NEWPASS,                                   @M5A*22221000
               OIDCARD=&OIDCARD,                                   @M5A*22221700
               PASSCHK=&PASSCHK,                                   @M5A*22222400
               PASSWRD=&PASSWRD,                                   @M5A*22223100
               PGMNAME=&PGMNAME,                                   @M5A*22223800
               RELEASE=&RELEASE,                                   @M5A*22224500
               SMC=&SMC,                                           @M5A*22225200
               START=&START,                                       @M5A*22225900
               STAT=&STAT,                                         @M5A*22226600
               SUBPOOL=&SUBPOOL,                                   @M5A*22227300
               TERMID=&TERMID,                                     @M5A*22228000
               USERID=&USERID,                                     @M5A*22228700
               TOKNIN=&TOKNIN,                                     @D2C*22229400
               TOKNOUT=&TOKNOUT,                                   @D2C*22230100
               STOKEN=&STOKEN,                                     @M5A*22230800
               SECLABL=&SECLABL,                                   @M5A*22231500
               EXENODE=&EXENODE,                                   @M5A*22232200
               SNODE=&SNODE,                                       @M5A*22232900
               SUSERID=&SUSERID,                                   @M5A*22233600
               SGROUP=&SGROUP,                                     @M5A*22234300
               POE=&POE,                                           @M5A*22235000
               POENET=&POENET,                                     @LGA*22235300
               LOGSTR=&LOGSTR,                                     @M5A*22235700
               SESSION=&SESSION,                                   @M5A*22236400
               TRUSTED=&TRUSTED,                                   @M5A*22237100
               REMOTE=&REMOTE,                                     @M8A*22237800
               MF=&MF                                              @P3C 22238500
.RTE10   ANOP  ,                                                   @M9A 22239200
         AIF   (&RQTYPE NE 13).RTE11                               @M9A 22239900
         RACAUDIT ENTITYX=&ENTITYX,                                @M9A*22240600
               ACEE=&ACEE,                                         @M9A*22241300
               CLASS=&CLASS,                                       @M9A*22242000
               EVENT=&EVENT,                                       @M9A*22242700
               EVQUAL=&EVQUAL,                                     @M9A*22243400
               RELEASE=&RELEASE,                                   @M9A*22244100
               RESULT=&RESULT,                                     @D4A*22244300
               LOGSTR=&LOGSTR,                                     @D4A*22244500
               MF=&MF                                              @M9A 22244800
         AGO   .RTE0410                                            @M4A 22245500
.RTE11   ANOP                                                      @M8A 22246200
         AIF   (&RQTYPE NE 14).RTE12                               @N3A 22246600
         RACSTAT ENTRY=&ENTRY,                                     @N3A*22247000
               COPY=&COPY,                                         @D6A*22247100
               COPYLEN=&COPYLEN,                                   @D6A*22247200
               CLASS=&CLASS,                                       @N3A*22247400
               RELEASE=&RELEASE,                                   @N3A*22247800
               MF=&MF                                              @N3A 22248200
         AGO   .RTE0410                                            @N3A 22248600
.RTE12   ANOP                                                      @N3A 22249000
         AIF   (&RQTYPE NE 15).RTE13                               @N6A 22251600
         IRRSGNON TYPE=&TYPE,                                      @N6A*22254200
               APPL=&APPL,                                         @N6A*22256800
               POE=&POE,                                           @N6A*22259400
               POENET=&POENET,                                     @LGA*22260700
               LSTTYPE=&LSTTYPE,                                   @N6A*22262000
               RELEASE=&RELEASE,                                   @N6A*22264600
               USERID=&USERID,                                     @N6A*22267200
               GROUP=&GROUP,                                       @N6A*22269800
               SECLABL=&SECLABL,                                   @N6A*22272400
               VERBEXIT=&VERBEXIT,                                 @N6A*22275000
               TOKNOUT=&TOKNOUT,                                   @N6A*22277600
               ACEE=&ACEE,                                         @N6A*22280200
               ENVRIN=&ENVRIN,                                     @N6A*22282800
               ENVROUT=&ENVROUT,                                   @N6A*22285400
               MF=&MF                                              @N6A 22288000
         AGO   .RTE0410                                            @N6A 22290600
.RTE13   ANOP                                                      @N6A 22293200
.RTE0410 ANOP                                                           22295800
         AIF   ('&ICHMF' EQ 'L').EROUTE                                 22300000
         AIF   ('&ICHMF' EQ 'E').DCUP01                          @Q2M   22300500
         AIF   ('&MF(1)' EQ 'M').DCUP01                          @Q2M   22301000
         AGO   .MFEM10                    NOT MF=E OR MF=M       @Q3C   22301500
.* MODIFY DECOUPL FLAG FIELD AS REQUESTED                        @Q2M   22302000
.DCUP01  ANOP  ,                                                 @Q2M   22302500
         AIF   ('&TYPE'  EQ 'ENVRXTR').DCUP15  FOR TYPE=ENVRXTR,       *22302600
                                           DEFAULT TO DECOUPL=YES  @LHA 22302700
         AIF   ('&DECOUPL' EQ '').DCUP10                         @Q2M   22303000
         AIF   ('&DECOUPL' NE 'YES').DCUP20                      @Q2M   22303500
.DCUP15  ANOP  ,                                                 @LHA   22303700
         OI    14(14),B'00010000' DECOUPL=YES SPECIFIED          @Q2M   22304000
         AGO   .DCUP10                                           @Q2M   22304500
.DCUP20  ANOP  ,                                                 @Q2M   22305000
         NI    14(14),B'11101111' DECOUPL=NO SPECIFIED           @Q2M   22305500
.DCUP10  ANOP  ,                                                 @Q2M   22306000
.* MODIFY SYSTEM FLAG FIELD AS REQUESTED                         @N6A   22306100
.SYST01  ANOP                                                    @N6A   22306200
         AIF   ('&SYSTEM' EQ '').SYST10                          @N6A   22306300
         AIF   ('&SYSTEM' NE 'YES').SYST20                       @N6A   22306400
         OI    14(14),B'00001000' SYSTEM=YES SPECIFIED           @N6A   22306500
         AGO   .SYST10                                           @N6A   22306600
.SYST20  ANOP                                                    @N6A   22306700
         NI    14(14),B'11110111' SYSTEM=NO SPECIFIED            @N6A   22306800
.SYST10  ANOP                                                    @N6A   22306900
.* MODIFY MSGRTRN FLAG FIELD AS REQUESTED                        @Q3A   22307000
.MRTN01  ANOP  ,                                                 @Q3A   22307100
         AIF   ('&MSGRTRN' EQ '').MRTN20                         @Q3A   22307500
         AIF   ('&MSGRTRN' NE 'YES').MRTN10                      @Q3A   22308000
         OI    14(14),B'10000000' MSGRTRN=YES SPECIFIED          @Q3A   22308500
         AGO   .MRTN20                                           @Q3A   22309000
.MRTN10  ANOP  ,                                                 @Q3A   22309500
         NI    14(14),B'01111111' MSGRTRN=NO SPECIFIED           @Q3A   22310000
.MRTN20  ANOP  ,                                                 @Q3A   22310500
.* MODIFY MSGSUPP FLAG FIELD AS REQUESTED                        @Q3A   22311000
.MSUP01  ANOP  ,                                                 @Q3A   22311500
         AIF   ('&MSGSUPP' EQ '').MSUP20                         @Q3A   22312000
         AIF   ('&MSGSUPP' NE 'YES').MSUP10                      @Q3A   22312500
         OI    14(14),B'00100000' MSGSUPP=YES SPECIFIED          @Q3A   22313000
         AGO   .MSUP20                                           @Q3A   22313500
.MSUP10  ANOP  ,                                                 @Q3A   22314000
         NI    14(14),B'11011111' MSGSUPP=NO SPECIFIED           @Q3A   22314500
.MSUP20  ANOP  ,                                                 @Q3A   22315000
.* MODIFY MSGSP FIELD AS REQUESTED                               @Q3A   22315500
.MSPL01  ANOP  ,                                                 @Q3A   22316000
         AIF   ('&MSGSP' EQ '').MSPL20                           @Q3A   22316500
.MSPL10  ANOP  ,                                                 @Q3A   22317000
         MVI   15(14),&SP         MSGSP  SPECIFIED               @Q3A   22317500
.MSPL20  ANOP  ,                                                 @Q3A   22318000
.MFEM10  ANOP  ,                          NOT MF=E OR MF=M       @Q3A   22318500
         AIF   ('&MF(1)' EQ 'M').EROUTE                            @M3A 22319000
         AIF   (NOT &ICHLFS).RTE0420                              4@R2D 22320500
         L     15,24(0,14)          WORKAREA  ADDRS                @M2A 22322000
         XC    0(64,15),0(15)       CLEAR WORKAREA                 @M2A 22322500
         MVI   3(15),64             STORE WORK AREA LENGTH         @M2A 22323000
         MVC   4(1,15),8(1)         MOVE ATTR                      @M2A 22323500
         LR    0,1                                                 @M2A 22324000
         L     1,40(1)              POINT TO CLASS                 @M2A 22324500
         LTR   1,1                  CLASS SPECIFIED                @M2A 22325000
         BZ    *+10                                                @M2A 22325500
         MVC   7(9,15),0(1)         MOVE CLASS TO WORKAREA         @M2A 22326000
         LR    1,0                                                 @M2A 22326500
         L     1,60(1)              POINT TO USERID                @M2A 22327000
         LTR   1,1                  TEST IF USERID SPECIFIED       @M2A 22327500
         BZ    *+10                                                @M2A 22328000
         MVC   16(8,15),0(1)        MOVE USERID TO WORKAREA        @M2A 22328500
         LR    1,0                                                 @M2A 22329000
         L     1,36(1)              POINT TO ENTITY ADDRESS        @M2A 22329500
         LTR   1,1                  TEST IF ENTITY SPECIFIED       @M2A 22330000
         BZ    *+10                                                @M2A 22330500
         MVC   24(39,15),0(1)       MOVE ENTITY NAME               @M2A 22331000
         LR    1,15                 POINT TO WORKAREA              @M2A 22331500
         LA    15,32                SET DIAGNOSE SUBFUNCTION CODE  @M2A 22332000
         LA    0,64                 SET BUFFER LENGTH              @M2A 22332500
         DC    XL1'83',XL1'1F',XL2'00A0' ISSUE DIAGNOSE X'A0'      @M2A 22333000
.*                                                                 @M2A 22333500
.* SAVE THE RETURN CODE IN THE RACROUTE PARAMETER LIST             @M2A 22334000
.*                                                                 @M2A 22334500
         LA    0,84                                                @M2A 22335000
         CLR   0,15                                                @M2A 22335500
         BNE   *+12                                                @M2A 22336000
         LA    15,642                                              @D4C 22336500
         B     IHB&NX.G                                            @M2A 22337000
         LA    0,255                CHECK FOR SEVER                @M2A 22337500
         CLR   0,15                                                @M2A 22338000
         BNE   *+8                                                 @M2A 22338500
         LA    15,12                SEVER RETURN CODE              @R3C 22339300
         B     IHB&NX.G                                           2@R3D 22340100
IHB&NX.G DS    0F                                                  @M2A 22341000
         ST    15,0(14)             SAVE RACF RETURN CODE          @M2A 22341500
         XR    0,0                                                 @M2A 22342000
         XC    4(4,14),4(14)                                       @M2A 22342500
         AGO   .EROUTE                                             @M2A 22343000
.RTE0420 ANOP                                                      @M2A 22343500
         LR    1,14                 RESTORE ADDRESSABILITY TO PARM LIST 22350000
         L     15,16(0,0)           ADDRESS OF CVT                      22400000
         ICM   15,B'1111',248(15)   ADDRESS OF SAF VECTOR TABLE         22450000
         BNZ   IHB&NX.D                                                 22500000
         LA    15,4                 SAF ROUTER NOT AVAILABLE IN SYSTEM  22550000
         B     IHB&NX.E                                                 22600000
IHB&NX.D DS    0H                                                       22650000
         ICM   15,B'1111',12(15)    PICK UP ADDRESS OF SAF ROUTER  @R4C 22666600
         BNZ   IHB&NX.H                                            @R4A 22683200
         LA    15,4                 SAF ROUTER NOT AVAILABLE       @R4A 22699800
         B     IHB&NX.E                                                 22716400
IHB&NX.H DS    0H                                                  @R4A 22733000
         BALR  14,15                BRANCH TO SAF ROUTER                22750000
IHB&NX.E DS    0H                                                       22800000
         AGO   .EROUTE                                                  22850000
.*****************                                                      22900000
.*  ERROR MESSAGES                                                      22950000
.*****************                                                      23000000
.ERR01   ANOP                                                           23050000
         MNOTE 12,'*** INVALID VALUE FOR MF PARAMETER'                  23100000
         AGO   .EROUTE                                                  23150000
.ERR01A  ANOP                                                      @M2A 23162500
         MNOTE 12,'*** MF=M IS NOT VALID WHEN RELEASE=1.8.2 IS SPECIFIE*23171800
               D'                                                  @D4A 23181100
         AGO   .EROUTE                                             @D4C 23190400
.ERR02   ANOP                                                           23200000
         MNOTE 12,'*** REQUEST PARAMETER MISSING'                       23250000
         AGO   .EROUTE                                                  23300000
.ERR03   ANOP                                                           23350000
         MNOTE 08,'*** EXTRANEOUS PARAMETERS IGNORED FOR &XTRAPRM' @N4C 23400000
         AGO   .CONT02                                                  23500000
.ERR04   ANOP                                                           23550000
         MNOTE 12,'*** INVALID VALUE FOR REQUEST PARAMETER'             23600000
         AGO   .EROUTE                                                  23650000
.ERR05   ANOP                                                           23700000
         MNOTE 12,'*** WORKA PARAMETER MISSING'                         23750000
         AGO   .EROUTE                                                  23750600
.ERR06   ANOP                                                           23751200
         MNOTE 12,'*** INVALID VALUE FOR "MSGSP" PARAMETER: "&MSGSP"'   23751800
         AGO   .EROUTE                                             @P1A 23752400
.ERR07   ANOP                                                      @P1A 23753000
         MNOTE 12,'*** INVALID VALUE FOR "MSGRTRN" PARAMETER: "&MSGRTRN+23753600
               "'                                                  @P1A 23754200
         AGO   .ERTN07                                             @M3C 23754800
.ERR08   ANOP                                                      @P1A 23755400
         MNOTE 12,'*** INVALID VALUE FOR "MSGSUPP" PARAMETER: "&MSGSUPP+23756000
               "'                                                  @P1A 23756600
         AGO   .CONT07                                             @M3C 23757200
.ERR08A  ANOP                                                      @M3A 23757800
         MNOTE 12,'*** INVALID VALUE FOR "DECOUPL" PARAMETER: "&DECOUPL+23758400
               "'                                                  @M3A 23759000
         AGO   .ERTN08A                                            @M3A 23759600
.ERR09   ANOP                                                      @P1A 23760200
         MNOTE 12,'*** RELEASE=1.8 (OR LATER) MUST BE CODED TO USE THE +23760800
               "MSGRTRN" PARAMETER'                                @M4C 23761400
         AGO   .EROUTE                                             @P1A 23762000
.ERR09A  ANOP                                                      @M2A 23762600
         MNOTE 4,'*** "MSGRTRN" PARAMETER IS IGNORED WITH RELEASE=1.8.2+23763200
                SPECIFIED'                                         @D4A 23763800
         AGO   .ERTN09A                                            @M2A 23764400
.ERR10   ANOP                                                      @P1A 23765000
         MNOTE 12,'*** RELEASE=1.8 (OR LATER) MUST BE CODED TO USE THE +23765600
               "MSGSUPP" PARAMETER'                                @M4C 23766200
         AGO   .EROUTE                                             @P1A 23766800
.ERR10A  ANOP                                                      @M2A 23767400
         MNOTE 4,'*** "MSGSUPP" PARAMETER IS IGNORED WITH RELEASE=1.8.2+23768000
                SPECIFIED'                                         @D4A 23768600
         AGO   .ERTN10A                                            @M2A 23769200
.ERR12   ANOP                                                      @P1A 23769800
         MNOTE 12,'*** RELEASE=1.8 (OR LATER) MUST BE CODED TO USE THE +23770400
               "MSGSP" PARAMETER'                                  @M4C 23771000
         AGO   .EROUTE                                                  23771600
.ERR12A  ANOP                                                      @M2A 23772200
         MNOTE 4,'*** "MSGSP" PARAMETER IS IGNORED WITH RELEASE=1.8.2 S+23772800
               PECIFIED'                                           @D4C 23773400
         AGO   .ERTN12A                                            @M2A 23774000
.ERR13   ANOP                                                      @M2A 23774600
         MNOTE 12,'*** REQUEST=DIRAUTH IS INVALID IF RELEASE=1.8.2 IS S+23775200
               PECIFIED'                                           @D4C 23775800
         AGO   .EROUTE                                             @M2A 23776400
.ERR13A  ANOP                                                      @D4A 23776500
         MNOTE 12,'*** REQUEST=TOKENMAP IS INVALID IF RELEASE=1.8.2 IS +23776600
               SPECIFIED'                                          @D4A 23776700
         AGO   .EROUTE                                             @D4A 23776800
.ERR13B  ANOP                                                      @D4A 23776900
         MNOTE 12,'*** REQUEST=VERIFYX IS INVLAID IF RELEASE=1.8.2 IS S+23777000
               PECIFIED'                                           @D4A 23777100
         AGO   .EROUTE                                             @D4A 23777200
.ERR13C  ANOP                                                      @D4A 23777300
         MNOTE 12,'*** REQUEST=TOKENXTR IS INVALID IF RELEASE=1.8.2 IS +23777400
               SPECIFIED'                                          @D4A 23777500
         AGO   .EROUTE                                             @D4A 23777600
.ERR13D  ANOP                                                      @D4A 23777700
         MNOTE 12,'*** REQUEST=TOKENBLD IS INVALID IF RELEASE=1.8.2 IS +23777800
               SPECIFIED'                                          @D4A 23777900
         AGO   .EROUTE                                             @D4A 23778000
.ERR13E  ANOP                                                      @D4A 23778100
         MNOTE 12,'*** REQUEST=AUDIT IS INVALID IF RELEASE=1.8.2 IS SPE+23778200
               CIFIED'                                             @D4A 23778300
         AGO   .EROUTE                                             @D4A 23778400
.ERR13F  ANOP                                                      @D4A 23778500
         MNOTE 12,'*** REQUEST=STAT IS INVALID IF RELEASE=1.8.2 IS SPEC+23778600
               IFIED'                                              @D4A 23778700
         AGO   .EROUTE                                             @D4A 23778800
.ERR15   ANOP                                                      @M2A 23779400
         MNOTE 12,'*** REQUEST=FASTAUTH IS INVALID IF RELEASE=1.8.2 IS +23780000
               SPECIFIED'                                          @D4C 23780600
         AGO   .EROUTE                                             @M2A 23781200
.ERR16   ANOP                                                      @M2A 23781800
         MNOTE 12,'*** REQUEST=LIST IS INVALID IF RELEASE=1.8.2 IS SPEC+23782400
               IFIED'                                              @D4C 23783000
         AGO   .EROUTE                                             @M2A 23783600
.ERR17   ANOP                                                      @M2A 23784200
         MNOTE 12,'*** REQUEST=DEFINE IS INVALID IF RELEASE=1.8.2 IS SP+23784800
               ECIFIED'                                            @D4C 23785400
         AGO   .EROUTE                                             @M2A 23786000
.ERR18   ANOP                                                      @M2A 23786600
         MNOTE 12,'*** REQUEST=VERIFY IS INVALID IF RELEASE=1.8.2 IS SP+23787200
               ECIFIED'                                            @D4A 23787800
         AGO   .EROUTE                                             @M2A 23788400
.ERR19   ANOP                                                      @M2A 23789000
         MNOTE 12,'*** REQUEST=EXTRACT IS INVALID IF RELEASE=1.8.2 IS S+23789600
               PECIFIED'                                           @D4C 23790200
         AGO   .EROUTE                                             @M2A 23790800
.ERR20   ANOP                                                      @M2A 23791400
         MNOTE 4,'*** "REQSTOR" IS IGNORED WHEN RELEASE=1.8.2 IS SPECIF+23792000
               IED'                                                @D4C 23792600
         AGO   .ERTN20                                             @M2A 23793200
.ERR21   ANOP                                                      @M2A 23793800
         MNOTE 4,'*** "SUBSYS" IS IGNORED WHEN RELEASE=1.8.2 IS SPECIFI+23794400
               ED'                                                 @D4C 23795000
         AGO   .ERTN21                                             @M2A 23795600
.ERR22   ANOP                                                      @P6A 23796200
         MNOTE 8,'*** "TOKNOUT" IS A REQUIRED PARAMETER FOR VERIFYX REQ+23796800
               UEST ***'                                           @Q4C 23797400
         AGO   .ERTN22                                             @P6A 23798000
.ERR22A  ANOP                                                      @N5A 23798300
         MNOTE 8,'*** "XMREQ" IS A SUPPORTED BY RELEASE 1.9 AND LATER O+23798600
               NLY ***'                                            @N5A 23798900
         AGO   .ERTN22A                                            @N5A 23799200
.ERR23   ANOP                                                      @N1A 23799700
         MNOTE 8,'*** "DECOUPL" IS SUPPORTED BY RELEASE 1.9 AND LATER O+23801400
               NLY ***'                                            @N1A 23803100
         AGO   .ERTN23                                             @N1A 23804800
.ERR24   ANOP                                                      @N2A 23806500
         MNOTE 8,'*** "ECB1" IS SUPPORTED BY RELEASE 1.9 AND LATER ONLY+23808200
                ***'                                               @N2A 23809900
         AGO   .ERTN24                                             @N2A 23811600
.ERR25   ANOP                                                      @N2A 23813300
         MNOTE 8,'*** "ECB2" IS SUPPORTED BY RELEASE 1.9 AND LATER ONLY+23815000
                ***'                                               @N2A 23816700
         AGO   .ERTN25                                             @N2A 23818400
.ERR26   ANOP                                                      @N2A 23820100
         MNOTE 8,'*** "USERWRD" IS SUPPORTED BY RELEASE 1.9 AND LATER O+23821800
               NLY ***'                                            @N2A 23823500
         AGO   .ERTN26                                             @N2A 23825200
.ERR27   ANOP                                                      @N2A 23826900
         MNOTE 8,'*** "POSTEXI" IS SUPPORTED BY RELEASE 1.9 AND LATER O+23828600
               NLY ***'                                            @N2A 23830300
         AGO   .ERTN27                                             @N2A 23832000
.ERR28   ANOP                                                      @N2A 23833700
         MNOTE 8,'*** "PREEXI" IS SUPPORTED BY RELEASE 1.9 AND LATER ON+23835400
               LY ***'                                             @N2A 23837100
         AGO   .ERTN28                                             @N2A 23838800
.ERR29   ANOP                                                      @N3A 23840500
         MNOTE 8,'*** "REQUEST=STAT" IS SUPPORTED BY RELEASE 1.9 AND LA+23842200
               TER ONLY ***'                                       @N3A 23843900
         AGO   .ERTN29                                             @N3A 23845600
.ERR30   ANOP                                                      @Q6A 23845900
         MNOTE 8,'*** "TOKNOUT" IS A REQUIRED PARAMETER FOR TOKENBLD RE+23846200
               QUEST ***'                                          @Q6A 23846500
         AGO   .ERTN30                                             @Q6A 23846800
.ERR31   ANOP                                                      @N4A 23847000
         MNOTE 8,'*** "TOKNOUT" KEYWORD IN COMBINATION WITH "REQUEST=VE+23847200
               RIFY" IS SUPPORTED BY RELEASE 1.9 AND LATER ONLY ***'   +23847400
                                                                   @N4A 23847600
         AGO   .CONT02                                             @N4A 23847800
.ERR32   ANOP                                                      @N5A 23848000
         MNOTE 12,'*** INVALID VALUE FOR "XMREQ"  PARAMETER: "&XMREQ"  +23848200
               ***'                                                @N5A 23848400
         AGO   .ERTN08Y                                            @N5A 23848600
.ERR33   ANOP                                                      @N6A 23851800
         MNOTE 8,'*** "REQUEST=SIGNON" IS SUPPORTED BY RELEASE 1.9.2 AN+23855000
               D LATER ONLY ***'                                   @N6A 23858200
         AGO   .EROUTE                                             @N6A 23861400
.ERR34   MNOTE 8,'*** "SYSTEM" KEYWORD IS SUPPORTED BY RELEASE 1.9.2 AN+23864600
               D LATER ONLY ***'                                   @N6A 23867800
         AGO   .ERTN34                                             @N6A 23871000
.ERR35   MNOTE 8,'*** "ENVRIN/ENVROUT" KEYWORDS ARE SUPPORTED BY RELEAS+23874200
               E 1.9.2 AND LATER ONLY ***'                         @N6A 23877400
         AGO   .ERTN35                                             @N6A 23880600
.ERR36   MNOTE 12,'*** INVALID VALUE FOR "SYSTEM" PARAMETER: "&SYSTEM" +23883800
               ***'                                                @N6A 23887000
         AGO   .ERTN08X                                            @N6A 23890200
.ERR37   MNOTE 8,'*** "GLOBAL" KEYWORD IS SUPPORTED BY RELEASE 2.1 AND +23891000
               LATER ONLY ***'                                     @L9A 23891800
         AGO   .ERTN37                                             @L9A 23892600
.ERR38   MNOTE 8,'*** "COPY" KEYWORD IS SUPPORTED BY RELEASE 2.2 AND LA+23892700
               TER ONLY ***'                                       @D6A 23892800
         AGO   .ERTN38                                             @D6A 23892900
.ERR39   MNOTE 8,'*** "COPYLEN" KEYWORD IS SUPPORTED BY RELEASE 2.2 AND+23893000
                LATER ONLY ***'                                    @D6A 23893100
         AGO   .ERTN39                                             @D6A 23893200
.ERR40   MNOTE 8,'*** "POENET" KEYWORD IS SUPPORTED BY RELEASE 2.6 AND +23893800
                LATER ONLY ***'                                    @LGA 23894400
         AGO   .ERTN40                                             @LGA 23895000
.ERR41   MNOTE 8,'*** "DATEFMT" KEYWORD IS SUPPORTED BY RELEASE 1.9.2 A+23895100
               ND LATER ONLY ***'                                  @02A 23895200
         AGO   .ERTN41                                             @02A 23895300
.ERR42   MNOTE 8,'*** "X500NAME" KEYWORD IS SUPPORTED BY RELEASE 7703 A+23895500
               ND LATER ONLY ***'                                  @LJA 23895700
         AGO   .ERTN42                                             @LJA 23895900
.EROUTE  ANOP                                                           23896100
.* RESET GLOBALS                                                        23896600
&ICHRAC  SETB  0                                                        23900000
&ICHL    SETC  ''                                                       23950000
&ICHLFS  SETB  0                                                   @M2A 23975000
         MEND                                                           24000000
