         MACRO                                                          03000019
&NAME    RDLNE &DCB                                                     06000019
.*                                                                      06050002
.* MODULE-NAME=RDLNE(OS/VS2)MACRO                              @YM00638 06100002
.*                                                                      06150002
.* DESCRIPTIVE-NAME=READ LINE IN ONLINE CORRECTION MODE        @YM00638 06200002
.*                                                                      06250002
.* COPYRIGHT=NONE                                              @YM00638 06300002
.*                                                                      06350002
         LCLC  &REG1,&REG2                                              09000019
         AIF   (T'&DCB NE 'O').RL002                                    12000019
.RL001   IHBERMAC 202                                                   15000019
         MEXIT                                                          18000019
.RL002   AIF   (T'&NAME EQ 'O').RL003                                   21000019
&NAME    EQU   *                                                        24000019
.RL003   AIF   ('&DCB'(1,1) NE '(').RL007                               27000019
         AIF   ('&DCB'(K'&DCB,1) NE ')').RL001                          30000019
         AIF   (K'&DCB EQ 4).RL004                                      33000019
&REG1    SETC  '&DCB'(2,1)                                              36000019
         AIF   ('&REG1' EQ '1').RL008                                   39000019
         AIF   ('&REG1' GT '1' AND '&REG1' LE '9').RL006                42000019
         AGO   .RL001                                                   45000019
.RL004   AIF   ('&DCB'(2,1) NE '1').RL001                               48000019
         AIF   ('&DCB'(3,1) GE '0' AND '&DCB'(3,1) LE '2').RL005        51000019
         AGO   .RL001                                                   54000019
.RL005   ANOP                                                           57000019
&REG1    SETC  '&DCB'(2,1)                                              60000019
&REG2    SETC  '&DCB'(3,1)                                              63000019
.RL006   LR    1,&REG1&REG2 GET DCB ADDRESS                             66000019
         AGO   .RL008                                                   69000019
.RL007   LA    1,&DCB GET DCB ADDRESS                                   72000019
.RL008   L     15,12(1) GET ADDRESS OF RDLNE MODULE                     75000019
         BALR  14,15 LINK TO RDLNE MODULE                               78000019
         MEND                                                           81000019
