         MACRO                                                          03000003
&NAME    SBT   &D,&A                   SEARCH BINARY           @ZA00773 06000003
         GBLA  &DISP                   DISPLACEMENT            @ZA00773 09000003
         GBLC  &LBL1                   LABEL ON ENTR MACRO     @ZA00773 12000003
         LCLA  &DL                                             @ZA00773 15000003
         AIF   ('&D' LE '15').SBT1     DISPLACEMENT IS 0-15    @ZA00773 18000003
         MNOTE 4,'*** IHB349 DISPLACEMENT NOT 0-15 DIGITS'              21000003
.*                                                             @ZA00773 21050003
         AGO   .SBT2                                           @ZA00773 24000003
.SBT1    ANOP                                                  @ZA00773 27000003
         AIF   ((&D-(&D/2)*2) NE 1).SBT2 DISPLACEMENT EVEN     @ZA00773 30000003
         MNOTE 4,'*** IHB426 DISPLACEMENT IS ODD'                       33000003
.*                                                             @ZA00773 33050003
.SBT2    ANOP                                                  @ZA00773 36000003
&DL      SETA  16*&D                   PUT DISPLACEMENT IN HIGH ORDER   39000003
.*                                     4 BITS                  @ZA00773 42000003
&NAME    DC    0H'0',X'5A',AL1(&DL),AL2(&A-&LBL1+&DISP)                 45000003
.*                                                             @ZA00773 45050003
         MEND                                                           48000003
