         MACRO                                                          01000003
&NAME    SBTBL &N                      BINARY SEARCH TABLE     @ZA00773 02000003
         LCLA  &X                      INDEX FOR TABLE ENTRIES @ZA00773 03000003
         LCLA  &ENT                    NUMBER OF ENTRIES       @ZA00773 04000003
         LCLA  &ENTL                   ENTRY LENGTH            @ZA00773 05000003
         LCLA  &COMPL                  COMPARE LENGTH          @ZA00773 06000003
         LCLA  &P                      LENGTH OF INDIVIDUAL ENTRY       07000003
.*                                                             @ZA00773 07050003
         LCLC  &PREV                   PREVIOUS ENTRY (OLD)    @ZA37241 08000000
         LCLC  &CURR                   CURRENT ENTRY  (NEW)    @ZA37241 08050000
         LCLA  &I                      CHARACTER INDEX         @ZA37241 08100000
         LCLA  &C                      COMPARE LENGTH          @ZA37246 08150000
         LCLA  &L                      ENTRY LENGTH            @ZA00773 08200000
         GBLC  &LBL1                   LABEL ON ENTR MACRO     @ZA00773 08250000
         GBLA  &DISP                   DISPLACEMENT            @ZA00773 08300000
         ACTR  600000                  SET AGO/AIF COUNTER     @ZA04464 08350000
         DS    0H                                                       08400000
.*                                                             @ZA00733 08450000
&ENT     SETA  N'&SYSLIST-1                                    @ZA00773 12000003
&ENTL    SETA  (K'&SYSLIST(2)+1)/2                             @ZA00773 13000003
&L       SETA  K'&SYSLIST(2)           ENTRY LENGTH FOR THIS TABLE      14000003
.*                                                             @ZA00773 14050003
&NAME    EQU   *                                                        15000003
.*                                                             @ZA00733 15050000
         DC    AL2(&NAME-&LBL1+&DISP+6+(&ENTL*&ENT)-&ENTL)              16000003
.*                                     END OF TABLE ADDRESS    @ZA00773 17000003
         DC    H'&ENT'                 NUMBER OF ENTRIES IN TABLE       18000003
.*                                                             @ZA00773 18050003
         DC    AL1(&ENTL)              LENGTH OF ENTRIES                19000003
.*                                                             @ZA00773 19050003
&C       SETA  (&SYSLIST(1)+1)/2*2     SET COMPARE LENGTH      @ZA37246 19100000
&COMPL   SETA  (&SYSLIST(1)+1)/2                               @ZA00773 20000003
         DC    AL1(&COMPL)             COMPARE LENGTH                   21000003
.*                                                             @ZA00773 21050003
&X       SETA  1                       INITIALIZE INDEX TO IGNORE       22000003
.*                                     COMPARE LENGTH          @ZA00773 23000003
.SBTBL1  ANOP                                                  @ZA00773 24000003
&X       SETA  &X+1                    INCREMENT INDEX         @ZA00773 25000003
         AIF   ('&SYSLIST(&X)' EQ '').END END OF ENTRIES       @ZA00773 26000003
&P       SETA  K'&SYSLIST(&X)          NO,LENGTH OF THIS ENTRY @ZA00773 27000003
         AIF   ('&P' GT '0' AND '&P' LE '32').SBTBL2           @ZA00773 28000003
         MNOTE 12,'*** IHB427 ENTRY LENGTH GREATER THAN 32 DIGITS'      29000003
.*                                                             @ZA00773 29050003
         AGO   .ERROR                                          @ZA00773 30000003
.SBTBL2  ANOP                                                  @ZA00773 31000003
         AIF   (&P EQ &L).SBTBL15      CORRECT ENTRY LENGTH    @ZA00773 32000003
         MNOTE 8,'*** IHB358 ALL TABLE ENTRIES MUST BE EQUAL LENGTH'    33000003
.*                                                             @ZA00773 33050003
         AGO   .ERROR                                          @ZA00773 34000003
.SBTBL15 ANOP                                                  @ZA00773 35000003
         AIF   ((&P-(&P/2)*2) NE 1).SBTBL3 DISPLACEMENT EVEN   @ZA00773 36000003
         MNOTE 12,'*** IHB428 ENTRY LENGTH IS ODD'                      37000003
.*                                                             @ZA00773 37050003
         AGO   .ERROR                                          @ZA00773 38000003
.SBTBL3  ANOP                                                  @ZA00773 39000003
         AIF   ('&ENTL' GE '&COMPL').SBTBL4                    @YM01767 40000003
         MNOTE 12,'*** IHB429 ENTRY LENGTH LESS THAN COMPARE LENGTH'    41000003
.*                                                             @ZA00773 41050003
         AGO   .ERROR                                          @ZA00773 42000003
.SBTBL4  ANOP                                                  @ZA00773 43000003
&CURR    SETC  '&SYSLIST(&X)'          GET CURRENT ENTRY       @ZA37244 44000000
         AIF   ('&X' EQ '2').SBTBL5    FIRST ENTRY, NO SEQ CHK @ZA37242 44050000
&I       SETA  1                       POINT TO FIRST CHAR     @ZA37241 44100000
.SBTBL42 ANOP                                                  @ZA00773 44150000
         AIF   ('&CURR'(&I,1) LT '0').SBTBL44 NEW IS A-F       @ZA37241 44200000
.*                                     NEW IS 0-9              @ZA37241 44250000
         AIF   ('&PREV'(&I,1) LT '0').SBTBL49 OLD IS A-F, SEQ ERR      C44300000
                                                               @ZA37241 44350000
         AGO   .SBTBL46                OLD IS 0-9, GO COMPARE  @ZA37241 44400000
.SBTBL44 ANOP                                                  @ZA37241 44450000
         AIF   ('&PREV'(&I,1) GE '0').SBTBL5 OLD IS 0-9, SEQ OK@ZA37241 44500000
.SBTBL46 ANOP                                                  @ZA37241 44550000
.*       CONTROL COMES HERE IF THE PREVIOUS ENTRY CHARACTER    @ZA37241 44600000
.*       AND THE CURRENT ENTRY CHARACTER ARE BOTH 0-9 OR BOTH  @ZA37241 44650000
.*       A-F TO PERFORM A COMPARE.  THE ASSEMBLER WILL FLAG    @ZA37241 44700000
.*       INVALID HEX DIGITS.                                   @ZA37241 44750000
         AIF   ('&CURR'(&I,1) GT '&PREV'(&I,1)).SBTBL5 NEW IS GT OLD,  C44800000
                                       SEQ OK                  @ZA37241 44850000
.*                                     NEW IS NGT OLD, CHK LT  @ZA37241 44900000
         AIF   ('&CURR'(&I,1) LT '&PREV'(&I,1)).SBTBL49 NEW IS LT OLD, C44950000
                                       SEQ ERR                 @ZA37241 45000000
.*                                     NEW IS EQ OLD, CONT CHK @ZA37241 45050000
         AIF   ('&I' GE '&C').SBTBL49  LAST CHAR, SEQ ERR      @ZA37243 45100000
&I       SETA  &I+1                    POINT TO NEXT CHAR      @ZA37241 45150000
         AGO   .SBTBL42                COMPARE NEXT CHAR       @ZA37241 45200000
.*                                                             @ZA37241 45250000
.SBTBL49 ANOP                                                  @ZA37241 45300000
         MNOTE 4,'*** IHB430 ENTRY OUT OF SEQUENCE'                     45350000
.*                                                             @ZA00773 45400000
         DC    XL&ENTL'&SYSLIST(&X)'   SEQUENCE ERROR                   45450000
.*                                                             @ZA37244 45500000
         AGO   .SBTBL1                 GET NEXT ENTRY          @ZA37244 45550000
.SBTBL5  ANOP                                                  @ZA00773 45600000
         DC    XL&ENTL'&SYSLIST(&X)'   TABLE ENTRY                      45650000
.*                                                             @ZA00773 45700000
&PREV    SETC  '&CURR'                 NEW NOW OLD             @ZA37244 45750000
         AGO   .SBTBL1                 GET NEXT ENTRY          @ZA00773 49000003
.END     ANOP                                                  @ZA00773 50000003
.ERROR   ANOP                                                  @ZA00773 51000003
         MEND                                                           52000003
