         MACRO                                                          00050000
&NAME    SDUMP7 &HDR=,&HDRAD=,&DCB=,&ASID=,&ASIDLST=,&ECB=,&SDATA=,    X00100000
               &STORAGE=,&LIST=,&SUMLIST=,&BUFFER=,&QUIESCE=,&BRANCH=, X00150000
               &LISTA=,&TYPE=,&SUMLSTA=,&SUSPEND=,&MF=         @G860P1X 00200000
.********************************************************************** 00250000
.*   MACRO NAME = SDUMP7                                      @G860P1X* 00300000
.*                                                                    * 00350000
.*   DESCRIPTIVE NAME = SDUMP7 EXECUTABLE MACRO               @G860P1X* 00400000
.*                                                                    * 00450000
.*   PROPRIETARY STATEMENT =                                          * 00500000
.*                                                                    * 00550000
.*               LICENSED MATERIALS - PROPERTY OF IBM                 * 00592800
.*               THIS MACRO IS "RESTRICTD MATERIALS OF IBM"           * 00635600
.*               5740-XC6 (C) COPYRIGHT IBM CORP. 1980, 1981          * 00678400
.*               SEE COPYRIGHT INSTRUCTIONS                           * 00721200
.*                                                                    * 00764000
.*   STATUS = OS/VS2 HBB2102                                  @G860P1X* 00806800
.*                                                                    * 00850000
.*   FUNCTION = PROVIDES THE INTERFACE BETWEEN THE CALLER AND SVC     * 00900000
.*              DUMP.  LIST AND EXECUTE FORMS EXIST TO GENERATE       * 00950000
.*              THE SDUMP7 PARAMETER LIST AND PROPER LINKAGE  @G860P1X* 01000000
.*              TO THE SVC DUMP SERVICE.                              * 01050000
.*                                                                    * 01100000
.*   NOTES = THE PARAMETER LIST GENERATED BY THE STANDARD AND LIST    * 01150000
.*           FORMS OF THIS MACRO IS AT LEAST 40 BYTES IN LENGTH.      * 01200000
.*           IF ANY OF THE NEW MVS/JBB1226 PARAMETERS ARE SPECIFIED,  * 01250000
.*           THE PARAMETER LIST LENGTH IS 48 BYTES.                   * 01300000
.*                                                                    * 01350000
.*   CHANGE ACTIVITY = FIX PROBLEM WITH ECB OPTION 6/22/79    @ZMB0025* 01400000
.*                     OS/VS2 JBB1226                         @G383P1U* 01450000
.*                     1. SUPPORT FOR NEW KEYWORDS:                   * 01500000
.*                        LISTA,SUMLSTA,TYPE=XMEM             @G383P1U* 01550000
.*                     2. SUPPORT FOR NEW KEYWORD                     * 01600000
.*                        SUSPEND= YES OR NO                          * 01650000
.*                        SUPPORT FOR SDUMP7 EXITS            @G860P1X* 01700000
.*                     3. SUPPORT FOR NEW KEYWORD: TYPE=XMEME @G38AP31* 01750000
.*                     APAR OZ51194 - MF=(E,(1)) ON EXECUTE   @ZA51194* 01800000
.*                        FORM WITH NO OTHER PARAMETERS       @ZA51194* 01850000
.*                        GENERATES AN OR IMMEDIATE.          @ZA51194* 01900000
.*                     OS/VS2 JBB1326                             @L1A* 01950000
.*                     @L1= RAS JBB1326 810130 PD31:PAGE PROTECT  @L1A* 02000000
.*                     0S/VS2 HBB2102                         @G860P1X* 02006200
.*                       THIS MACRO IS NEW FOR HBB2102. IT IS @G860P1X* 02012400
.*                       ESSENTIALLY THE SAME MACRO AS THE    @G860P1X* 02018600
.*                       JBB1326 VERSION OF THE SDUMP MACRO   @G860P1X* 02024800
.*                       WITH THE MACRO NAME CHANGED TO       @G860P1X* 02031000
.*                       SDUMP7. IT IS CALLED FROM THE SDUMP  @G860P1X* 02037200
.*                       MACRO IF SPLEVEL IS ONE.             @G860P1X* 02043400
.*                                                                    * 02050000
.********************************************************************** 02100000
.*                                                                      02150000
.*       DEFINE SET SYMBOLS                                             02200000
.*                                                                      02250000
         GBLB  &SDSE3LT         SET IF JBB1226 LIST FORM MACRO @G860P1X 02300000
         GBLB  &SDSE3EX         SET IF JBB1226 EXECUTE FORM    @G860P1X 02350000
         GBLB  &SDLISTF    LIST FORM WAS PREVIOUSLY SPECIFIED @G383P1U  02400000
         LCLA  &SDFLAG0           SDFLAG0 FIELD OF PARAMETER LIST       02450000
         LCLA  &SDFLAG1           SDFLAG1 FIELD OF PARAMETER LIST       02500000
         LCLA  &SDFLAG2           SDFLAG2 PARAMETER LIST FIELD @G383P1U 02550000
         LCLA  &SDATAF1,&SDATAF2  SDATA FIELD OF PARAMETER LIST         02600000
         LCLA  &SDATAF3           SDATA EXIT FIELDS PARM LIST  @G383P1U 02650000
         LCLA  &SDTYPF1           TYPE FIELD OF PARAMETER LIST @G383P1U 02700000
         LCLA  &CTR1,&CTR2        COUNTERS FOR LOOP CONTROL, INDEX      02750000
         LCLA  &HDRCTR            NUMBER OF PAIRED APOSTROPHES          02800000
         LCLA  &DISP              DISPLACEMENT FOR STORING ADDRESSES    02850000
         LCLC  &GNAME             SYMBOLIC NAME-BRANCH AROUND CONSTANTS 02900000
         LCLB  &SDDCB             SET IF DCB ADDRESS IS SPECIFIED       02950000
         LCLB  &SDBUFF            SET IF BUFFER IS TO BE DUMPED         03000000
         LCLB  &SDSTOR            SET IF STORAGE OR LIST IS SPECIFIED   03050000
         LCLB  &SDHDR             SET IF HDR OR HDRAD IS SPECIFIED      03100000
         LCLB  &SDECB             SET IF AN ECB ADDRESS IS SUPPLIED     03150000
         LCLB  &SDASID            SET IF AN ASID IS SPECIFIED           03200000
         LCLB  &SDASIDL           SET IF AN ASIDLIST IS SPECIFIED       03250000
.*                                                             @G33VPHD 03300000
         LCLB  &SDQUIET           SET IF SYSTEM IS TO BE QUIESCED       03350000
         LCLB  &SDBRNCH           SET IF INTERFACE IS BRANCH ENTRY      03400000
         LCLB  &DUMPTYP           ALWAYS SET FOR SVC DUMP               03450000
         LCLB  &SDALPSA           SET IF ALL PSA IN SYSTEM TO BE DUMPED 03500000
         LCLB  &SDPSA             SET IF CURRENT PSA IS TO BE DUMPED    03550000
         LCLB  &SDNUC             SET IF NUCLEUS IS TO BE DUMPED        03600000
         LCLB  &SDSQA             SET IF SQA IS TO BE DUMPED            03650000
         LCLB  &SDLSQA            SET IF LSQA IS TO BE DUMPED           03700000
         LCLB  &SDRGN             SET IF VIRTUAL MEMORY IS TO BE DUMPED 03750000
         LCLB  &SDLPA             SET IF ACTIVE LPA MOD FOR MEMORY REQ  03800000
         LCLB  &SDTRT             SET IF GTF INCORE TRACE BUFFERS  REQ  03850000
         LCLB  &SDCSA             SET IF CSA SUBPOOLS ARE TO BE DUMPED  03900000
         LCLB  &SDSWA             SET IF SWA FOR MEMORY TO BE DUMPED    03950000
.*                                                                      04000000
         LCLB  &SDSUMLT           SET IF SUMLIST SPECIFIED     @G33VPHD 04050000
         LCLB  &SDSMDMP           SET IF SUMDUMP SPECIFIED     @G33VPHD 04100000
         LCLB  &SDNSMDP           SET IF NO SUMDUMP SPECIFIED  @G33VPHD 04150000
         LCLB  &SDNSQA            SET IF NO SQA SPECIFIED      @G33VPHD 04200000
         LCLB  &SDNAPSA           SET IF NOALLPSA IS SPECIFIED @G33VPHD 04250000
         LCLB  &SDNEW             SET IF ENHANCED SVC DUMP     @G33VPHD 04300000
         LCLB  &SDSE3PM         SET IF JBB1226 PARMS SPECIFIED @G860P1X 04350000
         LCLB  &SDGRSQ            SET IF SDATA=GRSQ SPECIFIED  @G383P1U 04400000
.********************************************************************** 04450000
.* FOR EACH NEW SDUMP EXIT, ADD A NEW VARIABLE DEFINED SIMILAR TO       04500000
.* SDGRSQ.                                                     @G386P31 04550000
.********************************************************************** 04600000
         LCLB  &SDLISTA           SET IF LISTA PARM SPECIFIED  @G383P1U 04650000
         LCLB  &SDSMLTA           SET IF SUMLSTA SPECIFIED     @G383P1U 04700000
         LCLB  &SDSPEND           SET IF SUSPEND=YES SPECIFIED @G386P31 04750000
         LCLB  &SDTYPXM           SET IF TYPE=XMEM SPECIFIED   @ZMB0025 04800000
         LCLB  &SDTPXME           SET IF TYPE=XMEME SPECIFIED  @G38AP31 04850000
.*       INITIAL ERRORS                                                 04900000
.*                                                                      04950000
         AIF   ('&HDR' NE '' AND '&HDRAD' NE '').MESG2A     MUTUALLY    05000000
         AIF   ('&STORAGE' NE '' AND '&LIST' NE '').MESG2B   EXCLUSIVE  05050000
.*       TEST STORAGE AND LISTA - MUTUALLY EXCLUSIVE           @G383P1U 05100000
         AIF   ('&STORAGE' NE '' AND '&LISTA' NE '').MESG2C    @G383P1U 05150000
.*       TEST LIST AND LISTA - MUTUALLY EXCLUSIVE              @G383P1U 05200000
         AIF   ('&LIST' NE '' AND '&LISTA' NE '').MESG2D       @G383P1U 05250000
.*       TEST SUMLIST AND SUMLSTA - MUTUALLY EXCLUSIVE         @G383P1U 05300000
         AIF   ('&SUMLIST' NE '' AND '&SUMLSTA' NE '').MESG2E  @G383P1U 05350000
.*       TEST ASID AND ASIDLST - MUTUALLY EXCLUSIVE            @G386P31 05400000
         AIF   ('&ASID' NE '' AND '&ASIDLST' NE '').MESG10     @G383P1U 05450000
         AIF   ('&HDR' EQ '').SD3           HDR SPECIFIED               05500000
         AIF   ('&HDR'(1,1) NE '''').MESG9  IS FIRST CHAR APOSTROPHE    05550000
&CTR1    SETA  K'&HDR-1                     LENGTH OF USER DATA +1      05600000
&HDRCTR  SETA  0                            NUMBER OF PAIRED APOSTROHES 05650000
&CTR2    SETA  2                            INDEX FIRST CHAR-USER DATA  05700000
.SDLOOP  ANOP                                                           05750000
         AIF   (&CTR2 GE &CTR1).SD2              END OF SCAN            05800000
         AIF   ('&HDR'(&CTR2,2) EQ '''''').SD1   PAIRED APOSTROPHES     05850000
&CTR2    SETA  &CTR2+1                           UPDATE INDEX BY 1      05900000
         AGO   .SDLOOP                           CONTINUE LOOP          05950000
.SD1     ANOP                                                           06000000
&HDRCTR  SETA  &HDRCTR+1                    ONE MORE PAIRED APOSTROPHES 06050000
&CTR2    SETA  &CTR2+2                      UPDATE INDEX BY 2           06100000
         AGO   .SDLOOP                      CONTINUE LOOP               06150000
.SD2     ANOP                                                           06200000
&CTR1    SETA  K'&HDR-2-&HDRCTR             LENGTH OF USER DATA         06250000
         AIF   (&CTR1 GT 100).MESG8         USER DATA TOO LONG          06300000
.SD3     AIF   ('&MF' NE 'L').SD5           IS MF STANDARD OR EXECUTE   06350000
         AIF   ('&ASID' NE '').MESG5A       ASID INVALID W/MF=L         06400000
         AIF   ('&ECB' NE '').MESG5B        ECB INVALID W/MF=L          06450000
         AIF   ('&BRANCH' NE '').MESG5C     BRANCH INVALID W/MF=L       06500000
         AIF   ('&ASIDLST' NE '').MESG5D   ASID INV W/MF=L     @G33VPHD 06550000
.SD5     AIF   ('&BUFFER' EQ '').SD9        IS BUFFER SPECIFIED         06600000
.*                                                             @G33VPHD 06650000
         AIF   ('&BUFFER' NE 'YES' AND '&BUFFER' NE 'NO').MESG4B        06700000
.*                                                             @G33VPHD 06750000
.SD9     AIF   ('&BRANCH' EQ '').SD11       IS BRANCH SPECIFIED         06800000
         AIF   ('&BRANCH' NE 'YES' AND '&BRANCH' NE 'NO').MESG4C        06850000
.SD11    AIF   ('&QUIESCE' EQ '').SD13      IS QUIESCE SPECIFIED        06900000
         AIF   ('&QUIESCE' NE 'YES' AND '&QUIESCE' NE 'NO').MESG4D      06950000
.SD13    AIF   ('&STORAGE' EQ '').SD15      IS STORAGE SPECIFIED        07000000
&CTR1    SETA  N'&STORAGE/2                 NUMBER OF ADDRESS PAIRS     07050000
&CTR2    SETA  (N'&STORAGE-1)/2             NUMBER OF PAIRS MINUS 1     07100000
         AIF   (&CTR1 EQ &CTR2).MESG6       ODD NUMBER OF ADDRESSES     07150000
.SD15    ANOP                                                           07200000
.*                                                                      07250000
.*       SDFLAG0 PROCESSING                                             07300000
.*                                                                      07350000
&SDDCB   SETB  ('&DCB' NE '')                IF DCB SPECIFIED           07400000
&SDBUFF  SETB  ('&BUFFER' EQ 'YES')          IF BUFFER TO BE DUMPED     07450000
&SDSTOR  SETB  ('&STORAGE' NE '' OR '&LIST' NE '')    STORAGE ADDR LIST 07500000
&SDHDR   SETB  ('&HDR' NE '' OR '&HDRAD' NE '')       USER DATA         07550000
&SDECB   SETB  ('&ECB' NE '')                IF ECB SPECIFIED           07600000
&SDASID  SETB  ('&ASID' NE '')               IF ASID SPECIFIED          07650000
&SDQUIET SETB  ('&QUIESCE' NE 'NO')          IF SYSTEM TO BE QUIESCED   07700000
&SDBRNCH SETB  ('&BRANCH' EQ 'YES')          IF LINKAGE BY BRANCH ENTRY 07750000
&SDFLAG0 SETA  128*&SDDCB+64*&SDBUFF+32*&SDSTOR+16*&SDHDR+8*&SDECB+4*&SX07800000
               DASID+2*&SDQUIET+1*&SDBRNCH                              07850000
.*                                                                      07900000
.*       SDFLAG1 PROCESSING                                             07950000
.*                                                                      08000000
&DUMPTYP SETB  1                  ALWAYS ON FOR SVC DUMP                08050000
&SDNEW   SETB  1                  ALWAYS SET TO 1 FOR NEW SDUMP MACRO   08100000
.*                                                             @G33VPHD 08150000
&SDASIDL SETB  ('&ASIDLST' NE '') IF ASIDLIST WAS SPECIFIED             08200000
.*                                                             @G33VPHD 08250000
&SDSUMLT SETB  ('&SUMLIST' NE '') IF SUMLIST WAS SPECIFIED              08300000
.*                                                             @G33VPHD 08350000
&SDFLAG1 SETA  128*&DUMPTYP+32*&SDNEW+16*&SDASIDL+8*&SDSUMLT            08400000
.*                                                             @G383P1U 08450000
.*        SDFLAG2 PROCESSING                                   @G383P1U 08500000
.*                                                             @G383P1U 08550000
&SDLISTA SETB  ('&LISTA' NE '')   SET IF LISTA IS SPECIFIED    @G383P1U 08600000
&SDSMLTA SETB  ('&SUMLSTA' NE '') SET IF SUMLSTA SPECIFED      @G383P1U 08650000
&SDFLAG2 SETA  128*&SDLISTA+64*&SDSMLTA                        @G383P1U 08700000
.*                                                                      08750000
.*       SDATA PROCESSING                                               08800000
.*                                                                      08850000
         AIF   ('&SDATA' EQ '').SD80        IS SDATA SPECIFIED          08900000
         AIF   ('&SDATA'(1,1) EQ '(').SD60  MORE THAN 1 OPTION, IN ()   08950000
&CTR1    SETA  0                                                        09000000
&SDALPSA SETB  ('&SDATA' EQ 'ALLPSA')       SET IF ALLPSA SPECIFIED     09050000
&SDPSA   SETB  ('&SDATA' EQ 'PSA')          SET IF PSA SPECIFIED        09100000
&SDNUC   SETB  ('&SDATA' EQ 'NUC')          SET IF NUC SPECIFIED        09150000
&SDSQA   SETB  ('&SDATA' EQ 'SQA')          SET IF SQA SPECIFIED        09200000
&SDLSQA  SETB  ('&SDATA' EQ 'LSQA')         SET IF LSQA SPECIFIED       09250000
&SDRGN   SETB  ('&SDATA' EQ 'RGN')          SET IF RGN SPECIFIED        09300000
&SDLPA   SETB  ('&SDATA' EQ 'LPA')          SET IF LPA SPECIFIED        09350000
&SDTRT   SETB  ('&SDATA' EQ 'TRT')          SET IF TRT SPECIFIED        09400000
&SDCSA   SETB  ('&SDATA' EQ 'CSA')          SET IF CSA SPECIFIED        09450000
&SDSWA   SETB  ('&SDATA' EQ 'SWA')          SET IF SWA SPECIFIED        09500000
&SDSMDMP SETB  ('&SDATA' EQ 'SUMDUMP' OR '&SDATA' EQ 'SUM')             09550000
.*                         SET IF SUMDUMP OR SUM ARE SPECIFIED @G33VPHD 09600000
&SDNSQA  SETB  ('&SDATA' EQ 'NOSQA')        SET IF NOSQA SPECIFIED      09650000
.*                                                             @G33VPHD 09700000
&SDNAPSA SETB  ('&SDATA' EQ 'NOALLPSA' OR '&SDATA' EQ 'NOALL')          09750000
.*                          SET IF NOALLPSA OR NOALL SPECIFIED @G33VPHD 09800000
&SDNSMDP SETB  ('&SDATA' EQ 'NOSUMDUMP' OR '&SDATA' EQ 'NOSUM')         09850000
.*          SET IF NOSUMDUMP OR NOSUM ARE SPECIFIED            @G33VPHD 09900000
         AIF   (&SDNSMDP  EQ  0).SD30  IF NOSUM NOT SPECIFIED  @G383P1U 09950000
         AIF   (&SDSUMLT  EQ  1).MESG15  NOSUM AND SUMLIST     @G383P1U 10000000
         AIF   (&SDSMLTA  EQ  1).MESG15A  NOSUM AND SUMLSTA    @G383P1U 10050000
.SD30    ANOP                                                  @G383P1U 10100000
&SDGRSQ  SETB  ('&SDATA' EQ 'GRSQ')  SET IF GRSQ SPECIFIED     @G383P1U 10150000
.********************************************************************** 10200000
.* FOR EACH NEW SDUMP EXIT, ADD A 'SETB' INSTRUCTION SIMILAR TO THE ONE 10250000
.* ABOVE AND ADD THE EXIT VARIABLE INTO THE FOLLOWING SETA.    @G386P31 10300000
.********************************************************************** 10350000
&CTR1    SETA  &SDALPSA+&SDPSA+&SDNUC+&SDSQA+&SDLSQA+&SDRGN+&SDLPA+&SDTX10400000
               RT+&SDCSA+&SDSWA+&SDSMDMP+&SDNSMDP+&SDNSQA+&SDNAPSA+&SDGX10450000
               RSQ                                             @G386P31 10500000
&CTR2    SETA  1                            IF INVALID, MESG PRINTS IT  10550000
         AIF   ('&CTR1' EQ '0').MESG4A      IS SPECIFIED OPTION VALID   10600000
         AGO   .SD80                        SDATA OPTION PROCESSED      10650000
.SD60    ANOP                     SDATA OPTIONS IN PARENTHESIS          10700000
&CTR1    SETA  N'&SDATA           NUMBER OF OPTIONS ON SDATA PARAMETER  10750000
&CTR2    SETA  0                  NUMBER BY POSITION OPERAND WORKING ON 10800000
.LOOPA1  ANOP                                                           10850000
&CTR2    SETA  &CTR2+1            NUMBER OF NEXT OPTION TO WORK ON      10900000
         AIF   ('&SDATA(&CTR2)' EQ 'ALLPSA').SETAPSA                    10950000
         AIF   ('&SDATA(&CTR2)' EQ 'PSA').SETPSA                        11000000
         AIF   ('&SDATA(&CTR2)' EQ 'NUC').SETNUC                        11050000
         AIF   ('&SDATA(&CTR2)' EQ 'SQA').SETSQA                        11100000
         AIF   ('&SDATA(&CTR2)' EQ 'LSQA').SETLSQA                      11150000
         AIF   ('&SDATA(&CTR2)' EQ 'RGN').SETRGN                        11200000
         AIF   ('&SDATA(&CTR2)' EQ 'LPA').SETLPA                        11250000
         AIF   ('&SDATA(&CTR2)' EQ 'TRT').SETTRT                        11300000
         AIF   ('&SDATA(&CTR2)' EQ 'CSA').SETCSA                        11350000
         AIF   ('&SDATA(&CTR2)' EQ 'SWA').SETSWA                        11400000
         AIF   ('&SDATA(&CTR2)' EQ 'SUMDUMP').SETSUM SUMDUMP SPEC       11450000
.*                                                             @G33VPHD 11500000
         AIF   ('&SDATA(&CTR2)' EQ 'SUM').SETSUM  SET IF SUM SPECIFIED  11550000
.*                                                             @G33VPHD 11600000
         AIF   ('&SDATA(&CTR2)' EQ 'NOSUMDUMP').SETNSUM SET IF          11650000
.*                                   NO SUMDUMP IS SPECIFIED   @G33VPHD 11700000
         AIF   ('&SDATA(&CTR2)' EQ 'NOSUM').SETNSUM  SET IF NOSUM IS    11750000
.*                                                   SPECIFIED          11800000
.*                                                             @G33VPHD 11850000
         AIF   ('&SDATA(&CTR2)' EQ 'NOSQA').SETNSQA  SET IF NOSQA SPEC  11900000
.*                                                             @G33VPHD 11950000
         AIF   ('&SDATA(&CTR2)' EQ 'NOALLPSA').SETNAPA                  12000000
.*                                                             @G33VPHD 12050000
         AIF   ('&SDATA(&CTR2)' EQ 'NOALL').SETNAPA                     12100000
.*                                                             @G33VPHD 12150000
         AIF   ('&SDATA(&CTR2)' EQ 'GRSQ').SETGRSQ SET IF GRSQ @G383P1U 12200000
.********************************************************************** 12250000
.* FOR EACH NEW SDUMP EXIT, ADD AN 'AIF' INSTRUCTION SIMILAR TO THE ONE 12300000
.* ABOVE AND ADD THE NEW LABEL FOR THE SET.                    @G386P31 12350000
.********************************************************************** 12400000
         AGO   .MESG4A                 SDATA OPTION IS INVALID          12450000
.LOOPA2  AIF   (&CTR1 NE &CTR2).LOOPA1 MORE OPTIONS, CONTINUE LOOP      12500000
         AGO   .SD80                   ALL OPTIONS PROCESSED            12550000
.SETAPSA ANOP                          ALLPSA SPECIFIED                 12600000
         AIF   (&SDNAPSA EQ 1).MESG13  NOALLPSA AND ALLPSA IS ERROR     12650000
.*                                                             @G33VPHD 12700000
&SDALPSA SETB  1                       SET INDICATOR                    12750000
         AGO   .LOOPA2                 CONTINUE LOOP                    12800000
.SETPSA  ANOP                          PSA SPECIFIED                    12850000
&SDPSA   SETB  1                       SET INDICATOR                    12900000
         AGO   .LOOPA2                 CONTINUE LOOP                    12950000
.SETNUC  ANOP                          NUC SPECIFIED                    13000000
&SDNUC   SETB  1                       SET INDICATOR                    13050000
         AGO   .LOOPA2                 CONTINUE LOOP                    13100000
.SETSQA  ANOP                          SQA SPECIFIED                    13150000
         AIF   (&SDNSQA EQ 1).MESG12   SQA AND NOSQA IS ERROR           13200000
.*                                                             @G33VPHD 13250000
&SDSQA   SETB  1                       SET INDICATOR                    13300000
         AGO   .LOOPA2                 CONTINUE LOOP                    13350000
.SETLSQA ANOP                          LSQA SPECIFIED                   13400000
&SDLSQA  SETB  1                       SET INDICATOR                    13450000
         AGO   .LOOPA2                 CONTINUE LOOP                    13500000
.SETRGN  ANOP                          RGN SPECIFIED                    13550000
&SDRGN   SETB  1                       SET INDICATOR                    13600000
         AGO   .LOOPA2                 CONTINUE LOOP                    13650000
.SETLPA  ANOP                          LPA SPECIFIED                    13700000
&SDLPA   SETB  1                       SET INDICATOR                    13750000
         AGO   .LOOPA2                 CONTINUE LOOP                    13800000
.SETTRT  ANOP                          TRT SPECIFIED                    13850000
&SDTRT   SETB  1                       SET INDICATOR                    13900000
         AGO   .LOOPA2                 CONTINUE LOOP                    13950000
.SETCSA  ANOP                          CSA SPECIFIED                    14000000
&SDCSA   SETB  1                       SET INDICATOR                    14050000
         AGO   .LOOPA2                 CONTINUE LOOP                    14100000
.SETSWA  ANOP                          SWA SPECIFIED                    14150000
&SDSWA   SETB  1                       SET INDICATOR                    14200000
         AGO  .LOOPA2                  CONTINUE LOOP                    14250000
.SETSUM  ANOP                          SUMDUMP OR SUM SPECIFIED         14300000
.*                                                             @G33VPHD 14350000
         AIF   (&SDNSMDP EQ 1).MESG11  NOSUMDUMP AND SUMDUMP IS ERROR   14400000
.*                                                             @G33VPHD 14450000
&SDSMDMP SETB  1                       SET SUMDUMP INDICATOR            14500000
.*                                                             @G33VPHD 14550000
         AGO   .LOOPA2                 CONTINUE LOOP                    14600000
.*                                                             @G33VPHD 14650000
.SETNSUM ANOP                          NOSUMDUMP OR NOSUM SPECIFIED     14700000
.*                                                             @G33VPHD 14750000
         AIF   (&SDSMDMP EQ 1).MESG11  NOSUMDUMP AND SUMDUMP IS ERROR   14800000
.*                                                             @G33VPHD 14850000
&SDNSMDP SETB  1                       SET NOSUMDUMP INDICATOR          14900000
.*                                                             @G33VPHD 14950000
         AGO   .LOOPA2                 CONTINUE LOOP                    15000000
.*                                                             @G33VPHD 15050000
.SETNSQA ANOP                          NOSQA SPECIFIED                  15100000
.*                                                             @G33VPHD 15150000
         AIF   (&SDSQA EQ 1).MESG12    SQA AND NOSQA IS AN ERROR        15200000
.*                                                             @G33VPHD 15250000
&SDNSQA  SETB  1                       SET NOSQA INDICATOR              15300000
.*                                                             @G33VPHD 15350000
         AGO   .LOOPA2                 CONTINUE LOOP                    15400000
.*                                                             @G33VPHD 15450000
.SETNAPA ANOP                          NOALLPSA OR NOALL SPECIFIED      15500000
.*                                                             @G33VPHD 15550000
         AIF   (&SDALPSA EQ 1).MESG13  NOALLPSA AND ALLPSA IS ERROR     15600000
.*                                                             @G33VPHD 15650000
&SDNAPSA SETB  1                       SET NOALLPSA INDICATOR           15700000
.*                                                             @G33VPHD 15750000
         AGO   .LOOPA2                 CONTINUE LOOP                    15800000
.*                                                             @G33VPHD 15850000
.SETGRSQ ANOP                       GRSQ OPTION SPECIFIED      @G383P1U 15900000
&SDGRSQ  SETB  1                    GRSQ OPTION SPECIFIED      @G383P1U 15950000
         AGO   .LOOPA2                 CONTINUE LOOP           @G383P1U 16000000
.********************************************************************** 16050000
.* FOR EACH NEW SDUMP EXIT, ADD A SET OF 3 INSTRUCTIONS SIMILAR TO THE  16100000
.* 3 PREVIOUS INSTRUCTIONS.                                    @G386P31 16150000
.********************************************************************** 16200000
.SD80    ANOP         ALL SDATA OPTIONS PROCESSED,BUILD SDATA  @G33VPHD 16250000
&SDATAF1 SETA  128*&SDALPSA+64*&SDPSA+32*&SDNUC+16*&SDSQA+8*&SDLSQA+4*&X16300000
               SDRGN+2*&SDLPA+1*&SDTRT                                  16350000
&SDATAF2 SETA  128*&SDCSA+64*&SDSWA+32*&SDSMDMP+16*&SDNSMDP+8*&SDNAPSA+X16400000
               4*&SDNSQA                                                16450000
.*                                                             @G383P1U 16500000
.*       EXIT SDATA PARAMETER PROCESSING                       @G383P1U 16550000
.*                                                             @G383P1U 16600000
&SDATAF3 SETA  128*&SDGRSQ               CALC EXIT FLAG VALUE  @G383P1U 16650000
.********************************************************************** 16700000
.* FOR EACH NEW SDUMP EXIT, ADD ON TO THE SDATAF3 FIELD AN APPROPRIATE  16750000
.* BIT SETTING.                                                @G386P31 16800000
.********************************************************************** 16850000
.*                                                             @G386P31 16900000
.* SUSPEND KEYWORD PROCESSING                                  @G386P31 16950000
.*                                                             @G386P31 17000000
         AIF   ('&SUSPEND' EQ '').SD73  CHECK IF SUSPEND       @G386P31 17050000
.*                      PARAMETER SPECIFIED ?                  @G386P31 17100000
         AIF   ('&SUSPEND' EQ 'NO').SD73  SUSPEND=NO IS SAME   @G386P31 17150000
.*                      AS NOT SPECIFYING THE SUSPEND KEYWORD  @G386P31 17200000
         AIF   ('&SUSPEND' NE 'YES').MESG16A  INVALID SUSPEND  @G386P31 17250000
.* SUSPEND=YES REQUIRES BRANCH=YES AND SUMDUMP                 @G386P31 17300000
         AIF   ('&BRANCH' NE 'YES').MESG16B    NO BRANCH=YES   @G386P31 17350000
         AIF   (&SDNSMDP EQ 1).MESG16C    NOSUMDUMP INVALID    @G386P31 17400000
.* IF YOU HAVE GOTTEN TO HERE THEN SUSPEND=YES IS VALID.       @G386P31 17450000
&SDSPEND SETB  1             TURN ON SUSPEND=YES BIT           @G386P31 17500000
.*                                                             @G383P1U 17550000
.*       TYPE PARAMETER PROCESSING                             @G383P1U 17600000
.*                                                             @G383P1U 17650000
.SD73    AIF   ('&TYPE' EQ '').SD90    IS TYPE PARAMETER SPEC  @G383P1U 17700000
         AIF   ('&TYPE'(1,1) EQ '(').SD75 MORE THAN ONE OPTION @G383P1U 17750000
&CTR1    SETA  0              INITIALIZE LOOP COUNTER          @G383P1U 17800000
&SDTYPXM SETB  ('&TYPE' EQ 'XMEM')  SET IF TYPE=XMEM SPECIFIED @G383P1U 17850000
&SDTPXME SETB  ('&TYPE' EQ 'XMEME') SET IF TYPE=XMEME          @G38AP1U 17900000
&CTR1    SETA  &SDTYPXM+&SDTPXME      CALCULATE VALID OPTIONS  @G38AP1U 17950000
&CTR2    SETA  1             INITIALIZE FOR MNOTE              @G383P1U 18000000
         AIF   ('&CTR1'  EQ  '0').MESG4E  NO VALID OPTIONS     @G383P1U 18050000
         AGO   .SD90         TYPE OPTION PROCESSED             @G383P1U 18100000
.SD75    ANOP         TYPE PARAMETERS IN PARENTHESIS           @G383P1U 18150000
&CTR1    SETA  N'&TYPE       NUMBER OF TYPE PARAMETERS         @G383P1U 18200000
&CTR2    SETA  0             INDEX OF OPERAND ADDRESSED        @G383P1U 18250000
.SD76    ANOP                TOP OF OPTION LOOP                @G383P1U 18300000
&CTR2    SETA  &CTR2+1       INDEX NEXT OPTION TO WORK ON      @G383P1U 18350000
         AIF    ('&TYPE(&CTR2)' EQ 'XMEM').SETTPXM   XMEM SPEC @G383P1U 18400000
         AIF    ('&TYPE(&CTR2)' EQ 'XMEME').SETTXME XMEME SPEC @G38AP1U 18450000
         AGO    .MESG4E      EXIT PARAMETER INVALID            @G383P1U 18500000
.SETTPXM ANOP                XMEM SPECIFIED                    @G383P1U 18550000
&SDTYPXM SETB  1             SET INDICATOR                     @G383P1U 18600000
         AGO   .SD77         GOTO CHECK FOR END OF TYPE LOOP   @G38AP31 18650000
.SETTXME ANOP                XMEME SPECIFIED                   @G38AP31 18700000
&SDTPXME SETB  1             SET INDICATOR                     @G38AP31 18750000
.SD77    AIF   (&CTR1 NE &CTR2).SD76  MORE OPTIONS CONTINUE    @G38AP31 18800000
         AIF   (&SDTYPXM EQ 1 AND &SDTPXME EQ 1).MESG4F    CHECK FOR    18850000
.*                          MUTUALLY EXCLUSIVE TYPE PARAMETERS @G38AP31 18900000
.SD90    ANOP               BUILD TYPE FLAG BYTES              @G383P1U 18950000
&SDTYPF1 SETA  128*&SDTYPXM+64*&SDTPXME   CALC EXIT FLAG VALUE @G38AP31 19000000
         AIF   (&SDTYPF1  NE  0).SETS3PM     IF TYPE SPECIFIED @G383P1U 19050000
         AIF   (&SDATAF3  NE  0).SETS3PM   IF EXIT SDATA SPEC  @G383P1U 19100000
         AIF   (&SDLISTA  NE  0).SETS3PM    IF LISTA SPECIFIED @G383P1U 19150000
         AIF   (&SDSPEND  NE  0).SETS3PM  IF SUSPEND SPECIFIED @G386P31 19200000
         AIF   (&SDSMLTA  EQ  0).SDFORM1   IF SUMLSTA SPECD    @G383P1U 19250000
.SETS3PM ANOP                 INDICATE NEW PARM LIST SPECIFIED @G383P1U 19300000
&SDSE3PM SETB  1               SET JBB1226 PARM LIST INDICATOR @G860P1X 19350000
.SDFORM1 ANOP                                                  @G383P1U 19400000
         AIF   (&SDECB  EQ  0).SDFORM2 IF ECB NOT SPECIFIED OK @ZMB0025 19450000
         AIF   (&SDASID EQ  1).SDFORM2 IF ASID IS SPECIFIED OK @ZMB0025 19500000
         AIF   (&SDASIDL EQ 1).SDFORM2 IF ASIDLST SPECIFIED OK @ZMB0025 19550000
         AIF   (&SDLISTA EQ 1).SDFORM2   IF LISTA SPECIFIED OK @ZMB0025 19600000
         AIF   (&SDBRNCH EQ 1).SDFORM2 BRANCH YES SPECIFIED OK @ZMB0025 19650000
         AIF   (&SDTPXME EQ 1).SDFORM2 TYPE=XMEME SPECIFIED OK @G38AP31 19700000
         AIF   (&SDTYPXM EQ 0).MESG3B ECB SPECIFIED WITHOUT    @ZMB0025 19750000
.*       ASID ASIDLST LISTA BRANCH=YES TYPE=XMEM OR TYPE=XMEME @G38AP31 19800000
.*       IS AN ERROR                                           @G38AP31 19850000
.SDFORM2 ANOP                                                  @G383P1U 19900000
.*       RESET SDFLAG1 FOR JBB1226 BIT                         @G860P1X 19950000
&SDFLAG1 SETA  &SDFLAG1+1*&SDSE3PM SET SDFLAG1 FOR JBB1226 PRM @G860P1X 20000000
.*       RESET SDFLAG2 FOR JBB1226 SUSPEND PARAMETER           @G860P1X 20050000
&SDFLAG2 SETA  &SDFLAG2+32*&SDSPEND  SET SDFLAG1 FOR JBB1226   @G860P1X 20100000
.*                                                                      20150000
.*       WHICH FORM OF MACRO                                            20200000
.*                                                                      20250000
         AIF   ('&MF' EQ '').STFORM          IS IT STANDARD FORM        20300000
         AIF   ('&MF' EQ 'L').LSTFORM        IS IT LIST FORM            20350000
         AIF   ('&MF'(1,3) NE '(E,').MESG7   ELSE, IF NOT EXECUTE, ERR  20400000
.*                                                                      20450000
.*       EXECUTE FORM OF MACRO                                          20500000
.*                                                                      20550000
         AIF   (&SDSE3PM  EQ  0).SDEX1 IF ANY JBB1226 PARAMETERS WERE   20600000
.*                                     SPECIFIED               @G860P1X 20650000
&SDSE3EX SETB  1       INDICATE JBB1226 PARMS SPECIFIED ON EXEC FORM    20700000
.*                                                             @G860P1X 20750000
.SDEX1   ANOP                                                  @G383P1U 20800000
         AIF   ('&NAME' EQ '').SDEX2        IS NAME SPECIFIED           20850000
&NAME    DS    0H                                                       20900000
.SDEX2   ANOP                                                           20950000
         IHBSETR   &MF(2),1                 LOAD REG 1 WITH LIST ADDR   21000000
.*                                                                      21050000
.* MAKE SURE NO STORAGE IS ALTERED ON AN EXECUTE FORM OF THE            21100000
.*  SDUMP MACRO WHEN THE ONLY PARAMETER SPECIFIED IS MF.                21150000
.*                                                             @ZA51194 21200000
         AIF   ('&HDR' NE '' OR  '&HDRAD' NE '' OR '&DCB' NE '' OR '&AS*21250000
               ID' NE '' OR '&ASIDLST' NE '' OR '&ECB' NE '' OR '&SDATA*21300000
               ' NE '' OR '&STORAGE' NE '' OR '&LIST' NE '').SDEX2A     21350000
.*                                                             @ZA51194 21400000
         AIF   ('&SUMLIST' NE '' OR '&BUFFER' NE '' OR '&QUIESCE' NE ''*21450000
               OR '&LISTA' NE '' OR '&TYPE' NE '' OR '&SUMLSTA' NE '' O*21500000
               R '&SUSPEND' NE '' OR '&BRANCH' NE '').SDEX2A            21550000
         AGO   .SDEX49                                         @ZA51194 21600000
.*                                                             @ZA51194 21650000
.SDEX2A  ANOP                                                           21700000
         AIF   ('&QUIESCE' NE '').SDEX3     IS QUIESCE SPECIFIED        21750000
&SDFLAG0 SETA  &SDFLAG0-2                   NO, LEAVE AS SPECIFIED ON L 21800000
.SDEX3   AIF   ('&SDFLAG0' EQ '0').SDEX3A   ANY OPTIONS TO TURN ON      21850000
         OI    0(1),&SDFLAG0                SET OPTION FLAGS            21900000
.SDEX3A  AIF   ('&BUFFER' EQ 'NO').SDEX4    BUFFER NOT REQUESTED        21950000
         AGO   .SDEX6                       GO CHECK FOR QUIESCE        22000000
.SDEX4   ANOP                                                           22050000
         NI    0(1),X'BF'                   TURN OFF BUFFER FLAG        22100000
.SDEX6   AIF   ('&QUIESCE' EQ 'NO').SDEX8   QUIESCE NOT REQUESTED       22150000
         AGO   .SDEX10                      GO SET SVC DUMP FLAG        22200000
.SDEX8   ANOP                                                           22250000
         NI    0(1),X'FD'                   TURN OFF QUIESCE FLAG       22300000
.SDEX10  ANOP                                                           22350000
         AIF  ('&SDFLAG1' EQ '0').SDEX11 ANY OPTIONS TO TURN ON         22400000
.*                                                             @G383P1U 22450000
         OI    1(1),&SDFLAG1                 SET OPTION BITS            22500000
.SDEX11  ANOP                                                  @G33VPHD 22550000
         AIF   ('&SDATA' EQ '').SDEX12      IS SDATA OPTIONS SPECIFIED  22600000
         MVI   2(1),&SDATAF1                SET OPTION FLAGS            22650000
         MVI   3(1),&SDATAF2                SET OPTION FLAGS            22700000
.SDEX12  AIF   ('&DCB' EQ '').SDEX15        IS DCB SPECIFIED            22750000
         IHBSETR   &DCB,0                   LOAD REG 0 WITH DCB ADDR    22800000
         ST    0,4(1,0)               ADDR OF DCB INTO PARAM LISTYM1995 22850000
.SDEX15  ANOP                                                           22900000
         AIF   ('&LIST' EQ '').SDEX16       IS LIST SPECIFIED  @G383P1U 22950000
         IHBSETR   &LIST,0                  LOAD REG 0 WITH LIST ADDR   23000000
         ST    0,8(1,0)               ADDR OF LIST INTO PARAM LSTYM1995 23050000
         AGO   .SDEX25                      GO CHECK FOR USER DATA      23100000
.SDEX16  ANOP                LISTA OPTION PROCESSING           @G383P1U 23150000
         AIF   ('&LISTA' EQ '').SDEX20   IS LISTA SPECIFIED    @G383P1U 23200000
         IHBSETR    &LISTA,0      LOAD R0 WITH LISTA ADDRESS   @G383P1U 23250000
         ST    0,8(1)             PUT LISTA ADDR IN PARM LIST  @G383P1U 23300000
         AGO   .SDEX25            GO CHECK FOR USERS DATA      @G383P1U 23350000
.SDEX20  AIF   ('&STORAGE' EQ '').SDEX25    IS STORAGE SPECIFIED        23400000
         L     15,8(1,0)    ADDR OF STORAGE LIST FROM PARAM LIST YM1995 23450000
&DISP    SETA  -4                 DISPLACEMENT OF ADDR IN STORAGE LIST  23500000
&CTR1    SETA  N'&STORAGE         NUMBER OF ADDRESSES SPECIFIED         23550000
&CTR2    SETA  0                  POSITION NUMBER OF ADDR WORKING ON    23600000
.LOOPC1  ANOP                                                           23650000
&DISP    SETA  &DISP+4                 DISP OF NEXT ADDR IN STORAGE LST 23700000
&CTR2    SETA  &CTR2+1                 POSITION NUMBER OF NEXT ADDRESS  23750000
         IHBSETR   &STORAGE(&CTR2),0   PUT STORAGE ADDRESS IN REG 0     23800000
         ST    0,&DISP.(0,15)          STORAGE ADDR INTO STORAGE LIST   23850000
&CTR1    SETA  &CTR1-1                 NUMBER OF REMAINING ADDRESSES    23900000
         AIF   (&CTR1 NE 0).LOOPC1   ANY MORE ADDRESSES                 23950000
         OI    &DISP.(15),X'80'      SET END OF LIST INDICATOR          24000000
.SDEX25  AIF   ('&HDRAD' EQ '').SDEX30      IS HDRAD SPECIFIED          24050000
         IHBSETR   &HDRAD,0                 LOAD REG0 WITH HDR RCD ADDR 24100000
         ST    0,12(1,0)              ADDR OF USER DATA INTO LISTYM1995 24150000
         AGO   .SDEX35                      GO CHECK FOR ECB            24200000
.SDEX30  AIF   ('&HDR' EQ '').SDEX35        IS HDR SPECIFIED            24250000
&GNAME   SETC  'IHB'.'&SYSNDX'              GET A UNIQUE SYMBOL         24300000
         BAL   15,&GNAME                    BRANCH AROUND USER DATA     24350000
&CTR1    SETA  K'&HDR-2-&HDRCTR             LENGTH OF USER DATA         24400000
         DC    AL1(&CTR1)                   LENGTH OF USER DATA         24450000
         DC    C&HDR                        USER DATA                   24500000
         CNOP  2,4                                                      24550000
&GNAME   DS    0H                                                       24600000
         ST    15,12(1,0)             ADDR OF USER DATA INTO LISTYM1995 24650000
.SDEX35  AIF   ('&ECB' EQ '').SDEX40        IS ECB SPECIFIED            24700000
         AIF   ('&ECB'(1,1) EQ '(').SDEX37  IS ADDR OF ECB IN A REG     24750000
         L     15,&ECB                      ADDRESS OF ECB              24800000
         ST    15,16(1,0)             ADDR OF ECB INTO PARAM LISTYM1995 24850000
         AGO   .SDEX40                      GO CHECK FOR ASID           24900000
.SDEX37  ANOP                                                           24950000
         ST    &ECB,16(1,0)           ADDR OF ECB INTO PARAM LISTYM1995 25000000
.SDEX40  AIF   ('&ASID' EQ '').SDEX45       IS ASID SPECIFIED           25050000
         AIF   ('&ASID'(1,1) EQ '(').SDEX42 IS ASID IN A REGISTER       25100000
         LH    0,&ASID                      ASID OF MEMORY TO BE DUMPED 25150000
         STH   0,22(1,0)              ASID INTO PARAMETER LIST   YM1995 25200000
         AGO   .SDEX47                  GO CHECK FOR SUMLIST   @GXXXPXX 25250000
.*                                                             @G33VPHD 25300000
.SDEX42  ANOP                                                           25350000
         STH   &ASID,22(1,0)          ASID INTO PARAMETER LIST   YM1995 25400000
         AGO   .SDEX47                      GO CHECK FOR SUMLIST        25450000
.*                                                             @G33VPHD 25500000
.SDEX45  AIF   ('&ASIDLST' EQ '').SDEX47 IF ASIDLIST SPECIFIED          25550000
.*                                                             @G33VPHD 25600000
         IHBSETR   &ASIDLST,0           LOAD REG 0 WITH ASIDLIST ADDR   25650000
.*                                                             @G33VPHD 25700000
         ST    0,24(1)                  ADDR ASIDLIST INTO PARM LIST    25750000
.*                                                             @G33VPHD 25800000
.SDEX47  AIF   ('&SUMLIST' EQ '').SDEX48 IF SUMLIST SPECIFIED  @G383P1U 25850000
         AIF   (&SDNSMDP EQ 1).MESG15 SUMLIST WITH NOSUMDUMP   @G383P1U 25900000
         IHBSETR   &SUMLIST,0           LOAD REG 0 WITH SUMLIST ADDR    25950000
.*                                                             @G33VPHD 26000000
         ST    0,28(1)                  ADDR SUMLIST INTO PARM LIST     26050000
.SDEX48  ANOP                                                  @G383P1U 26100000
         AIF   ('&SUMLSTA' EQ '').SDEX48A IS SUMLSTA SPECIFIED @G383P1U 26150000
         AIF   (&SDNSMDP EQ 1).MESG15A  SUMLSTA WITH NOSUMDUMP @G383P1U 26200000
         IHBSETR    &SUMLSTA,0    LOAD R0 WITH SUMLSTA ADDRESS @G383P1U 26250000
         ST    0,28(1)           MOVE SUMLSTA ADDR TO PARMLIST @G383P1U 26300000
.SDEX48A AIF   ('&SDFLAG2' EQ '0').SDEX48B  ANY FLAG2 FIELDS   @G383P1U 26350000
         OI    40(1),&SDFLAG2    SET OPTION FLAGS              @G383P1U 26400000
.SDEX48B AIF   ('&SDTYPF1' EQ '0').SDEX48C  ANY TYPE OPTIONS   @G383P1U 26450000
         OI    42(1),&SDTYPF1    SET TYPE FLAGS                @G383P1U 26500000
.SDEX48C AIF   ('&SDATAF3' EQ '0').SDEX49   ANY EXIT OPTIONS   @G383P1U 26550000
         OI    44(1),&SDATAF3    SET EXIT FLAGS                @G383P1U 26600000
.SDEX49  ANOP                                                  @G383P1U 26650000
         AIF   (&SDLISTF  EQ  0).SDEX49A  IF NO PREV LIST FORM @G383P1U 26700000
         AIF   (&SDSE3LT  EQ  1).SDEX49A  IF JBB1226 LIST FORM @G860P1X 26750000
         AIF   (&SDSE3EX  EQ  1).MESG14  EXEC AND LIST DONT MATCH       26800000
.*                                                             @G383P1U 26850000
.SDEX49A AIF   ('&BRANCH' EQ 'YES').SDEX50  IS A BRANCH ENTRY  @G383P1U 26900000
         SVC   51                           INVOKE SVC DUMP VIA SVC     26950000
         AGO   .SDEND                       GO END MACRO PROCESSING     27000000
.SDEX50  ANOP                                                           27050000
         L     15,CVTPTR(0,0)               ADDRESS OF CVT       YM1995 27100000
         L     15,CVTSDMP-CVTMAP(15,0)  ADDRESS OF SVC DUMP ENTRYYM1995 27150000
         BALR  14,15                        INVOKE SVC DUMP VIA BAL     27200000
         AGO   .SDEND                       GO END MACRO PROCESSING     27250000
.*                                                                      27300000
.*       LIST FORM OF MACRO                                             27350000
.*                                                                      27400000
.LSTFORM ANOP                                                           27450000
&SDLISTF SETB  1         INDICATE LIST FORM HAS BEEN SPECIFIED @G383P1U 27500000
&NAME    DS    0F                           SDUMP PARAMETER LIST        27550000
         DC    AL1(&SDFLAG0)                FLAG BYTE                   27600000
         DC    AL1(&SDFLAG1)                FLAG BYTE                   27650000
         DC    AL1(&SDATAF1)                FLAG BYTE                   27700000
         DC    AL1(&SDATAF2)                FLAG BYTE                   27750000
         AIF   ('&DCB' EQ '').SDLST10       IS DCB SPECIFIED            27800000
         AIF   ('&DCB'(1,1) EQ '(').MESG1   IS DCB ADDRESS IN A REG     27850000
         DC    A(&DCB)                      ADDRESS OF DCB              27900000
         AGO   .SDLST15                     GO CHECK FOR STORAGE ADDR   27950000
.SDLST10 ANOP                                                           28000000
         DC    A(0)                         ADDRESS OF DCB              28050000
.SDLST15 AIF   ('&SDSTOR' NE '0').SDLST16   STORAGE/LIST SPEC @G383P1U  28100000
         AIF   ('&LISTA' EQ '').SDLST24     IS LISTA SPECIFIED @G383P1U 28150000
         AIF   ('&LISTA'(1,1) EQ '(').MESG1  CHECK FOR R FORM  @G383P1U 28200000
         DC    A(&LISTA)               ADDRESS OF STORAGE LIST @G383P1U 28250000
         AGO   .SDLST25                     LISTA OPTION DONE  @G383P1U 28300000
.SDLST16 AIF   ('&LIST' EQ '').SDLST20      IS LIST SPECIFIED           28350000
         AIF   ('&LIST'(1,1) EQ '(').MESG1  IS LIST ADDRESS IN A REG    28400000
         DC    A(&LIST)                     ADDRESS OF STORAGE LIST     28450000
         AGO   .SDLST25                     GO CHECK FOR USER DATA      28500000
.SDLST20 ANOP                                                           28550000
         AIF   (&SDSE3PM  EQ  0 AND &SDSE3EX EQ 0).SDLST21 IF SHORT     28600000
.*                                           PARAMETER LIST    @G383P1U 28650000
         DC    A(*+40)                 ADDRESS OF STORAGE LIST @G383P1U 28700000
         AGO   .SDLST25                     GO CHECK FOR USER DATA      28750000
.SDLST21 ANOP                                                  @G383P1U 28800000
         DC    A(*+32)                 ADDRESS OF STORAGE LIST @G383P1U 28850000
         AGO   .SDLST25                SKIP NULL DECLARE       @G383P1U 28900000
.SDLST24 ANOP                                                           28950000
         DC    A(0)                         ADDRESS OF STORAGE LIST     29000000
.SDLST25 ANOP                                                           29050000
         AIF   ('&SDHDR' EQ '0').SDLST38    IS USER DATA SPECIFIED      29100000
         AIF   ('&HDRAD' NE '').SDLST35     IS HDRAD SPECIFIED          29150000
&CTR1    SETA  0                            PROCESS FOR HDR             29200000
         AIF   ('&STORAGE' EQ '').SDLST28   IS STORAGE SPECIFIED        29250000
&CTR1    SETA  N'&STORAGE                   NUMBER OF STORAGE ADDRESSES 29300000
&CTR1    SETA  &CTR1*4                      LENGTH OF STORAGE ADDR LIST 29350000
.SDLST28 ANOP                                                           29400000
         AIF   (&SDSE3PM  EQ  0 AND &SDSE3EX EQ 0).SDLST30     @G383P1U 29450000
.*                                  SHORT PARM LIST NO JBB1226 @G383P1U 29500000
&DISP    SETA  36+&CTR1                     DISPL TO USER DATA @G383P1U 29550000
         AGO   .SDLST31                     SKIP SECOND CALC   @G383P1U 29600000
.SDLST30 ANOP                                                  @G383P1U 29650000
&DISP    SETA  28+&CTR1                     DISPL TO USER DATA @G383P1U 29700000
.SDLST31 ANOP                                                  @G383P1U 29750000
         DC    A(*+&DISP)                   ADDRESS OF USER DATA        29800000
         AGO   .SDLST40                     GO DEFINE REST OF PARAM LST 29850000
.SDLST35 AIF   ('&HDRAD'(1,1) EQ '(').MESG1 IS ADDR OF USER DATA IN REG 29900000
         DC    A(&HDRAD)                    ADDRESS OF USER DATA        29950000
         AGO   .SDLST40                     GO DEFINE REST OF PARAM LST 30000000
.SDLST38 ANOP                                                           30050000
         DC    A(0)                         ADDRESS OF USER DATA        30100000
.SDLST40 ANOP                                                           30150000
         DC    A(0)                         ADDRESS OF ECB              30200000
         DC    AL2(0)                       CURRENT ASID                30250000
         DC    AL2(0)                       OTHER ASID                  30300000
         DC    A(0)                         ADDRESS OF ASID LIST        30350000
         AIF   (&SDSUMLT EQ 0).SDLST45 IF SUMLIST NO SPECIFIED @G383P1U 30400000
         AIF   ('&SUMLIST'(1,1) EQ '(').MESG1 REGISTER INVALID @G383P1U 30450000
         DC    A(&SUMLIST)                 ADDRESS OF SUMLIST  @G383P1U 30500000
         AGO   .SDLST50                                        @G383P1U 30550000
.SDLST45 ANOP                                                  @G383P1U 30600000
         AIF   (&SDSMLTA EQ 0).SDLST49 IF SUMLSTA NO SPECIFIED @G383P1U 30650000
         AIF   ('&SUMLSTA'(1,1) EQ '(').MESG1 REGISTER INVALID @G383P1U 30700000
         DC    A(&SUMLSTA)                  ADDRESS OF SUMLSTA @G383P1U 30750000
         AGO   .SDLST50                                        @G383P1U 30800000
.SDLST49 ANOP                                                  @G383P1U 30850000
         DC    A(0)           ADDRESS OF SUMLIST/SUMLSTA LIST  @G383P1U 30900000
.SDLST50 ANOP                                                           30950000
         DC    A(0)                      RESERVED              @G33VPHD 31000000
         DC    A(0)                      RESERVED              @G33VPHD 31050000
         AIF   (&SDSE3EX  EQ  1).SDLST54 JBB1226 EXECUTE ALREADY        31100000
.*                                       SPECIFIED             @G860P1X 31150000
         AIF   (&SDSE3PM  EQ  0).SDLST55 IF NO NEW PARAMETERS SPECIFIED 31200000
.*                                                             @G383P1U 31250000
.SDLST54 ANOP                                                  @G383P1U 31300000
&SDSE3LT SETB  1          INDICATE JBB1226 LIST FORM SPECIFIED @G383P1U 31350000
         DC    AL1(&SDFLAG2)             FLAG BYTE             @G383P1U 31400000
         DC    AL1(0)                    RESERVED              @G383P1U 31450000
         DC    AL1(&SDTYPF1)             TYPE FLAG BYTE        @G383P1U 31500000
         DC    AL1(0)                    RESERVED              @G383P1U 31550000
         DC    AL1(&SDATAF3)             EXIT FLAG BYTE        @G383P1U 31600000
         DC    AL3(0)                    RESERVED              @G383P1U 31650000
.SDLST55 ANOP                                                  @G383P1U 31700000
         AIF   ('&STORAGE' EQ '').SDLST60   BUILD STORAGE LIST          31750000
.*                                                             @G33VPHD 31800000
&CTR1    SETA  N'&STORAGE                   NUMBER OF STORAGE ADDRESSES 31850000
&CTR2    SETA   0                           POSITION NO. OF ADDRESS     31900000
.LOOPD1  ANOP                                                           31950000
&CTR2    SETA  &CTR2+1                      NUMBER OF NEXT ADDRESS      32000000
         AIF   ('&STORAGE(&CTR2)'(1,1) EQ '(').MESG1  ADDR IN A REG     32050000
         DC    A(&STORAGE(&CTR2))           STORAGE ADDRESS             32100000
&CTR1    SETA  &CTR1-1                      NUMBER OF REMAINING ADDR.S  32150000
         AIF   ('&CTR1' GT '1').LOOPD1      IF NOT LAST ADDRESS, LOOP   32200000
&CTR2    SETA  &CTR2+1                      NUMBER OF LAST ADDRESS      32250000
         AIF   ('&STORAGE(&CTR2)'(1,1) EQ '(').MESG1  ADDR IN A REG     32300000
         DC    AL4(X'80000000'+&STORAGE(&CTR2))  LAST ADDRESS           32350000
.SDLST60 ANOP                                                           32400000
.*                                                             @G33VPHD 32450000
         AIF   ('&HDR' EQ '').SDEND         IS USER DATA SPECIFIED      32500000
&CTR1    SETA  K'&HDR-2-&HDRCTR             LENGTH OF USER DATA         32550000
         DC    AL1(&CTR1)                   LENGTH OF USER DATA         32600000
         DC    C&HDR                        USER DATA                   32650000
         AGO   .SDEND                       GO END MACRO PROCESSING     32700000
.*                                                                      32750000
.*       STANDARD FORM                                                  32800000
.*                                                                      32850000
.STFORM  ANOP                                                           32900000
&GNAME   SETC  'IHB'.'&SYSNDX'              OBTAIN UNIQUE SYMBOL-LABEL  32950000
         CNOP  0,4                                                      33000000
         AIF   ('&NAME' EQ '').SDSTF10      IS NAME SPECIFIED           33050000
&NAME    DS    0F                                                       33100000
.SDSTF10 ANOP                                                           33150000
         BAL   1,&GNAME                     BRANCH AROUND PARAM LIST    33200000
         DC    AL1(&SDFLAG0)                FLAG BYTE                   33250000
         DC    AL1(&SDFLAG1)                FLAG BYTE                   33300000
         DC    AL1(&SDATAF1)                FLAG BYTE                   33350000
         DC    AL1(&SDATAF2)                FLAG BYTE                   33400000
         DC    A(0)                         ADDRESS OF DCB              33450000
         DC    A(0)                         ADDRESS OF STORAGE LIST     33500000
         DC    A(0)                         ADDRESS OF HEADER RECORD    33550000
         DC    A(0)                         ADDRESS OF ECB              33600000
         DC    AL2(0)                       CURRENT ASID                33650000
         DC    AL2(0)                       OTHER ASID                  33700000
         DC    A(0)                         ADDRESS OF ASID LIST        33750000
.*                                                             @G33VPHD 33800000
         DC    A(0)                         ADDRESS OF SUMLIST          33850000
         DC    A(0)                         RESERVED           @G33VPHD 33900000
         DC    A(0)                         RESERVED           @G33VPHD 33950000
         AIF   (&SDSE3PM  EQ  0).SDSTF11    NEW PARM LIST      @G383P1U 34000000
         DC    AL1(&SDFLAG2)                FLAG BYTE          @G383P1U 34050000
         DC    AL1(0)                       RESERVED           @G383P1U 34100000
         DC    AL1(&SDTYPF1)                TYPE FLAG BYTE     @G383P1U 34150000
         DC    AL1(0)                       RESERVED           @G383P1U 34200000
         DC    AL1(&SDATAF3)                EXIT FLAG BYTE     @G383P1U 34250000
         DC    AL3(0)                       RESERVED           @G383P1U 34300000
.SDSTF11 ANOP                   OLD PARMS SPECIFIED            @G383P1U 34350000
         AIF   ('&STORAGE' EQ '').SDSTF20   IS STORAGE SPECIFIED        34400000
&CTR1    SETA  N'&STORAGE                   NUMBER OF STORAGE ADDRESSES 34450000
         DC    &CTR1.F'0'                   STORAGE ADDRESSES           34500000
.SDSTF20 ANOP                                                           34550000
         AIF   ('&HDR' EQ '').SDSTF30       IS HDR SPECIFIED            34600000
&CTR1    SETA  K'&HDR-2-&HDRCTR             LENGTH OF USER DATA         34650000
         DC    AL1(&CTR1)                   LENGTH OF USER DATA         34700000
         DC    C&HDR                        USER DATA                   34750000
         CNOP  2,4                                                      34800000
.SDSTF30 ANOP                                                           34850000
&GNAME   DS    0H                                                       34900000
         AIF   ('&DCB' EQ '').SDSTF35       IS DCB SPECIFIED            34950000
         IHBSETR   &DCB,0                   ADDRESS OF DCB IN REG 0     35000000
         ST    0,4(1,0)               ADDR OF DCB INTO PARAM LISTYM1995 35050000
.SDSTF35 AIF   ('&LIST' EQ '').SDSTF37      IS LIST SPECIFIED  @G383P1U 35100000
         IHBSETR   &LIST,0                  ADDR OF STORAGE LIST IN R0  35150000
         ST    0,8(1,0)               ADDR OF LIST INTO PARAM LSTYM1995 35200000
         AGO   .SDSTF50                     GO CHECK FOR USER DATA      35250000
.SDSTF37 AIF   ('&LISTA' EQ '').SDSTF40  IS LISTA SPECIFIED    @G383P1U 35300000
         IHBSETR   &LISTA,0           LISTA ADDRESS TO R0      @G383P1U 35350000
         ST    0,8(1)              STORE LISTA IN PARM LIST    @G383P1U 35400000
         AGO   .SDSTF50              GO CHECK FOR TITLE        @G383P1U 35450000
.SDSTF40 AIF   ('&STORAGE' EQ '').SDSTF50   STORAGE ADDRESSES SPECIFIED 35500000
         AIF   (&SDSE3PM EQ 0).SDSTF41  SEE IF OLD PARAMETERS  @G383P1U 35550000
         LA    15,48(1,0)             ADDR OF STORAGE LIST     @G383P1U 35600000
         AGO   .SDSTF42               SKIP OLD PARM EXPANSION  @G383P1U 35650000
.SDSTF41 ANOP                         ONLY OLD PARMS SPECIFIED @G383P1U 35700000
         LA    15,40(1,0)             ADDR OF STORAGE LIST     @G383P1U 35750000
.SDSTF42 ANOP                                                  @G383P1U 35800000
         ST    15,8(1,0)              INTO PARAM LIST            YM1995 35850000
&CTR1    SETA  N'&STORAGE          NUMBER OF STORAGE ADDRESSES          35900000
&CTR2    SETA  0                   NUMBER ADDRESSES BY POSITION         35950000
         AIF   (&SDSE3PM EQ 0).SDSTF43   SEE IF OLD PARMS ONLY @G383P1U 36000000
&DISP    SETA  44               DISPLACEMENT INTO STORAGE LIST @G383P1U 36050000
         AGO   .LOOPE1                SKIP OLD PARM EXPANSION  @G383P1U 36100000
.SDSTF43 ANOP                         ONLY OLD PARMS SPECIFIED @G383P1U 36150000
&DISP    SETA  36               DISPLACEMENT INTO STORAGE LIST @G383P1U 36200000
.LOOPE1  ANOP                                                           36250000
&CTR2    SETA  &CTR2+1                 NUMBER OF ADDRESS WORKING ON     36300000
&DISP    SETA  &DISP+4                 DISP OF ADDRESS INTO LIST        36350000
         IHBSETR   &STORAGE(&CTR2),0   PUT ADDRESS INTO REGISTER 0      36400000
         ST    0,&DISP.(1,0)     STORAGE ADDRESS INTO LIST       YM1995 36450000
         AIF   ('&CTR1' NE '&CTR2').LOOPE1  ANY  MORE ADDRESSES         36500000
         OI    &DISP.(1),X'80'              END OF LIST INDICATOR       36550000
.SDSTF50 AIF   ('&HDRAD' EQ '').SDSTF60     IS HDRAD SPECIFIED          36600000
         IHBSETR   &HDRAD,0                 ADDR OF USER DATA IN REG 0  36650000
         ST    0,12(1,0)         ADDR OF USER DATA INTO PARAM LSTYM1995 36700000
         AGO   .SDSTF70                     GO CHECK FOR ECB            36750000
.SDSTF60 AIF   ('&HDR' EQ '').SDSTF70       IS HDR SPECIFIED            36800000
&CTR1    SETA  0                                                        36850000
         AIF   ('&STORAGE' EQ '').SDSTF62   IS STORAGE SPECIFIED        36900000
&CTR1    SETA  N'&STORAGE                   NUMBER OF STORAGE ADDRESSES 36950000
&CTR1    SETA  &CTR1*4                      LENGTH OF STORAGE LIST      37000000
.SDSTF62 ANOP                                                           37050000
         AIF   (&SDSE3PM EQ 0).SDSTF63   SEE IF OLD PARMS ONLY @G383P1U 37100000
&DISP    SETA  48+&CTR1             DISPLACEMENT TO USER DATA  @G383P1U 37150000
         AGO   .SDSTF64               SKIP OLD PARM EXPANSION  @G383P1U 37200000
.SDSTF63 ANOP                         ONLY OLD PARMS SPECIFIED @G383P1U 37250000
&DISP    SETA  40+&CTR1             DISPLACEMENT TO USER DATA  @G383P1U 37300000
.SDSTF64 ANOP                                                  @G383P1U 37350000
         LA    0,&DISP.(1,0)          ADDRESS OF USER DATA       YM1995 37400000
         ST    0,12(1,0)              INTO PARAMETER LIST        YM1995 37450000
.SDSTF70 AIF   ('&ECB' EQ '').SDSTF80       IS ECB SPECIFIED            37500000
         AIF   ('&ECB'(1,1) EQ '(').SDSTF72 IS ECB ADDRESS IN A REG     37550000
         L     0,&ECB                       ADDRESS OF ECB              37600000
         ST    0,16(1,0)              ADDR OF ECB INTO PARAM LISTYM1995 37650000
         AGO   .SDSTF80                     GO CHECK FOR ASID           37700000
.SDSTF72 ANOP                                                           37750000
         ST    &ECB,16(1,0)           ADDR OF ECB INTO PARAM LISTYM1995 37800000
.SDSTF80 AIF   ('&ASID' EQ '').SDSTF90      IS ASID SPECIFIED           37850000
         AIF   ('&ASID'(1,1) EQ '(').SDSTF82     IS ASID IN A REGISTER  37900000
         LH    0,&ASID                      ASID OF MEMORY TO BE DUMPED 37950000
         STH   0,22(1,0)              ASID INTO PARAMETER LIST   YM1995 38000000
         AGO   .SDSTF90                     GO CHECK FOR BRANCH ENTRY   38050000
.SDSTF82 ANOP                                                           38100000
         STH   &ASID,22(1,0)          ASID INTO PARAMETER LIST   YM1995 38150000
.SDSTF90 AIF   ('&ASIDLST' EQ '').SDSTF93  IS ASIDLIST SPECIFIED        38200000
.*                                                             @G33VPHD 38250000
         IHBSETR   &ASIDLST,0           ADDR OF ASIDLIST IN R0          38300000
.*                                                             @G33VPHD 38350000
         ST    0,24(1)                  ADDR ASIDLIST INTO PARM LIST    38400000
.*                                                             @G33VPHD 38450000
.SDSTF93 AIF   ('&SUMLIST' EQ '').SDSTF94 IS SUMLIST SPECIFIED          38500000
         IHBSETR   &SUMLIST,0                                           38550000
         ST    0,28(1)                                                  38600000
         AGO   .SDSTF98                DONE SO DO ENTRY LOGIC  @G383P1U 38650000
.SDSTF94 AIF   ('&SUMLSTA' EQ '').SDSTF98  SUMLSTA SPECIFIED   @G383P1U 38700000
         IHBSETR   &SUMLSTA,0        GET SUMLSTA ADDR IN R0    @G383P1U 38750000
         ST    0,28(1)               SUMLSTA ADDR TO PARM LIST @G383P1U 38800000
.SDSTF98 AIF   ('&BRANCH' EQ 'YES').SDSTF99  IS BRANCH ENTRY REQUESTED  38850000
.*                                                             @G33VPHD 38900000
         SVC   51                           INVOKE SVC DUMP VIA SVC     38950000
         AGO   .SDEND                       GO END MACRO PROCESSING     39000000
.SDSTF99 ANOP                                                           39050000
.*                                                             @G33VPHD 39100000
         L     15,CVTPTR(0,0)               ADDRESS OF CVT       YM1995 39150000
         L     15,CVTSDMP-CVTMAP(15,0)  ADDRESS OF SVC DUMP ENTRYYM1995 39200000
         BALR  14,15                        INVOKE SVC DUMP VIA BAL     39250000
         AGO   .SDEND                       GO END MACRO PROCESSING     39300000
.*                                                                      39350000
.*       MESSAGES                                                       39400000
.*                                                                      39450000
.MESG1   MNOTE 12,'REGISTER NOTATION INVALID W/MF=L'                    39500000
         MEXIT                                                          39550000
.MESG2A  MNOTE 12,'HDR AND HDRAD MUTUALLY EXCLUSIVE'                    39600000
         MEXIT                                                          39650000
.MESG2B  MNOTE 12,'STORAGE AND LIST MUTUALLY EXCLUSIVE'                 39700000
         MEXIT                                                          39750000
.MESG2C  MNOTE 12,'STORAGE AND LISTA ARE MUTUALLY EXCLUSIVE'   @G383P1U 39800000
         MEXIT                                                 @G383P1U 39850000
.MESG2D  MNOTE 12,'LIST AND LISTA ARE MUTUALLY EXCLUSIVE'      @G383P1U 39900000
         MEXIT                                                 @G383P1U 39950000
.MESG2E  MNOTE 12,'SUMLIST AMD SUMLSTA ARE MUTUALLY EXCLUSIVE' @G383P1U 40000000
         MEXIT                                                 @G383P1U 40050000
.MESG3B  MNOTE 12,'MISSING PARAMETERS ASID, ASIDLST, LISTA, TYPE=XMEM, X40100000
               TYPE=XMEME, OR BRANCH=YES REQUIRED WITH ECB'    @G38AP31 40150000
         MEXIT                                                          40200000
.MESG4A  MNOTE 12,'INVALID SDATA OPERAND SPECIFIED &SDATA(&CTR2)'       40250000
         MEXIT                                                          40300000
.MESG4B  MNOTE 12,'INVALID BUFFER OPERAND SPECIFIED &BUFFER'            40350000
         MEXIT                                                          40400000
.MESG4C  MNOTE 12,'INVALID BRANCH OPERAND SPECIFIED &BRANCH'            40450000
         MEXIT                                                          40500000
.MESG4D  MNOTE 12,'INVALID QUIESCE OPERAND SPECIFIED &QUIESCE'          40550000
         MEXIT                                                 @G383P1U 40600000
.MESG4E  MNOTE 12,'INVALID TYPE OPERAND SPECIFIED &TYPE(&CTR2)'         40650000
.*                                                             @G383P1U 40700000
         MEXIT                                                 @G383P1U 40750000
.MESG4F  MNOTE 12,'MUTUALLY EXCLUSIVE TYPE OPERANDS: XMEM AND XMEME'    40800000
.*                                                             @G38AP31 40850000
         MEXIT                                                 @G38AP31 40900000
.MESG5A  MNOTE 12,'ASID OPERAND INVALID W/MF=L'                         40950000
         MEXIT                                                          41000000
.MESG5B  MNOTE 12,'ECB OPERAND INVALID W/MF=L'                          41050000
         MEXIT                                                          41100000
.MESG5C  MNOTE 12,'BRANCH OPERAND INVALID W/MF=L'                       41150000
         MEXIT                                                          41200000
.MESG5D  MNOTE 12,'ASIDLST OPERAND INVALID W/MF=L'                      41250000
         MEXIT                                                          41300000
.MESG6   MNOTE 12,'ODD NUMBER OF STORAGE ADDRESSES'                     41350000
         MEXIT                                                          41400000
.MESG7   MNOTE 12,'MACRO FORM IS INVALID'                               41450000
         MEXIT                                                          41500000
.MESG8   MNOTE 12,'USER DATA TOO LONG'                                  41550000
         MEXIT                                                          41600000
.MESG9   MNOTE 12,'INITIAL CHARACTER OF HDR OPERAND NOT AN APOSTROPHE'  41650000
         MEXIT                                                          41700000
.*                                                             @G33VPHD 41750000
.MESG10  MNOTE 12,'MUTUALLY EXCLUSIVE OPERANDS: ASID AND ASIDLST'       41800000
.*                                                             @G33VPHD 41850000
         MEXIT                                                          41900000
.*                                                             @G33VPHD 41950000
.MESG11  MNOTE 12,'MUTUALLY EXCLUSIVE OPERANDS: SUMDUMP/SUM AND NOSUMDUX42000000
               MP/NOSUM'                                                42050000
.*                                                             @G33VPHD 42100000
         MEXIT                                                          42150000
.*                                                             @G33VPHD 42200000
.MESG12  MNOTE 12,'MUTUALLY EXCLUSIVE OPERANDS:SQA AND NOSQA'           42250000
.*                                                             @G33VPHD 42300000
         MEXIT                                                          42350000
.*                                                             @G33VPHD 42400000
.MESG13  MNOTE 12,'MUTUALLY EXCLUSIVE OPERANDS: ALLPSA AND NOALLPSA'    42450000
.*                                                             @G33VPHD 42500000
         MEXIT                                                          42550000
.*                                                             @G33VPHD 42600000
.MESG14  MNOTE 12,'EXECUTE MACRO FORM USES A LIST FORM PARAMETER LIST WX42650000
               HOSE LENGTH IS LESS THAN THE PARAMETER LIST LENGTH USED X42700000
               BY THE EXECUTE MACRO FORM'                      @G383P1U 42750000
         MEXIT                                                 @G383P1U 42800000
.MESG15  MNOTE 12,'NOSUMDUMP SPECIFIED WITH SUMLIST INVALID'   @G383P1U 42850000
         MEXIT                                                 @G383P1U 42900000
.MESG15A MNOTE 12,'NOSUMDUMP SPECIFIED WITH SUMLSTA INVALID'   @G383P1U 42950000
         MEXIT                                                 @G386P31 43000000
.MESG16A MNOTE 12,'INVALID SUSPEND OPERAND SPECIFIED &SUSPEND' @G386P31 43050000
         MEXIT                                                 @G386P31 43100000
.MESG16B MNOTE 12,'BRANCH=YES IS REQUIRED WITH SUSPEND=YES'    @G386P31 43150000
         MEXIT                                                 @G386P31 43200000
.MESG16C MNOTE 12,'SDATA=NOSUM/NOSUMDUMP INVALID WITH SUSPEND=YES'      43250000
.*                                                             @G386P31 43300000
.SDEND   MEXIT                                                          43350000
         MEND                                                           43400000
