.********************************************************************** 00050000
.* MACRO-NAME = SMFEWTM                                               * 00100000
.*                                                                      00133300
.***** PROPRIETARY_STATEMENT ****************************************   00166600
.*01* PROPRIETARY STATEMENT:                                            00199900
.*                                                                      00233200
.*     LICENSED MATERIALS - PROPERTY OF IBM                             00266500
.*     5647-A01 (C) COPYRIGHT IBM CORP. 1979, 2000                      00299800
.*                                                                      00333100
.* STATUS= HBB7703                                                      00366400
.*                                                                      00399700
.**** END_OF_PROPRIETARY_STATEMENT **********************************   00433000
.*                                                                      00466300
.*01* EXTERNAL CLASSIFICATION: PI                                       00499600
.*01* END OF EXTERNAL CLASSIFICATION:                                   00532900
.*                                                                      00566200
.* FUNCTION:                                                          * 00600000
.*           TO ESTABLISH A PARAMETER LIST AND CALL IEEMB838          * 00650000
.*           WHICH WRITES A RECORD TO THE SMF DATA SET                * 00700000
.*                                                                    * 00750000
.* OPERATION:                                                         * 00800000
.*           GENERATES A CALL TO IEEMB838, FOLLOWED BY AN INLINE      * 00850000
.*           PARAMETER LIST. IEEMB838 MODIFIES THE RETURN ADDRESS     * 00900000
.*           SO AS TO RETURN TO A POINT AFTER THE PARAMETER LIST.     * 00950000
.*                                                                    * 01000000
.* INPUT:                                                             * 01050000
.*       THE FORMAT OF THE PARAMETER LIST IS                          * 01100000
.*                                                                    * 01150000
.*       OFFSET  LENGTH  MEANING                                      * 01200000
.*         0        2    FLAGS:                                       * 01250000
.*                        BIT 0 - ADDRESS OF SUBSYSTEM NAME IS        * 01300000
.*                                CONTAINED IN A REGISTER. PARMLIST   * 01350000
.*                                CONTAINS REGISTER NUMBER.           * 01400000
.*                                OTHERWISE, THE PARMLIST CONTAINS    * 01450000
.*                                THE SUBSYSTEM NAME.                 * 01500000
.*                        BIT 1 - INDICATES THAT THE SUBSYSTEM NAME   * 01550000
.*                                IS TO BE OBTAINED FROM THE OUCB.    * 01600000
.*                        BIT 2 - RECORD ADDRESS IS IN A REGISTER.    * 01650000
.*                                REGISTER NUMBER IS IN THE PARAMETER * 01700000
.*                                LIST. OTHERWISE, THE RECORD ADDRESS * 01750000
.*                                IS IN THE PARMLIST.                 * 01800000
.*                        BIT 3 - RESERVED                            * 01850000
.*                        BIT 4 - BRANCH=YES OR BRANCH=(YES,NOSUSPND) * 01900000
.*                                WAS SPECIFIED.                      * 01950000
.*                        BIT 5 - BRANCH=(YES,NOSUSPND) WAS SPECIFIED * 02000000
.*                        BIT 6 - MODE=XMEM SPECIFIED                 * 02033300
.*                        BIT 7-15 - RESERVED                         * 02066600
.*                                                                    * 02100000
.*         2        1    LENGTH OF PARAMETER LIST                     * 02150000
.*                                                                    * 02200000
.*         3        1    FUNCTION INDICATOR=4 (SMFEWTM)               * 02250000
.*                                                                    * 02300000
.*         4        4    ADDRESS OF SUBSYSTEM NAME, OR REGISTER WHICH * 02350000
.*                       CONTAINS ADDRESS OF SUBSYSTEM NAME           * 02400000
.*                                                                    * 02450000
.*         8        4    ADDRESS OF THE RECORD, OR REGISTER WHICH     * 02500000
.*                       CONTAINS THE ADDRESS OF THE RECORD           * 02550000
.*                                                                    * 02600000
.*        12        4    ADDRESS OF THE WORK AREA, OR REGISTER WHICH  * 02650000
.*                       CONTAINS THE ADDRESS OF THE WORK AREA        * 02700000
.*                                                                    * 02750000
.* CHANGE ACTIVITY:                                                   * 02800000
.*                 OZ51263 - ADD LABEL OPERAND TO MACRO                 02850000
.*                                                                    * 02900000
.* $DJ=DCR30   ,JBB3313,881216,PDJB:  SMFEWTM CROSS MEMORY        @DJA* 02916600
.*                                                                    * 02933200
.********************************************************************** 02950000
       MACRO                                                            03000000
&NAME  SMFEWTM &REC,&SUBSYS=,&BRANCH=,&WRKAREA=,&MODE=           @DJC   03050000
       LCLA    &A,&FCN,&REG,&PARML                                      03100000
       LCLB    &ARG,&BRG,&SSRG,&SSDEFLT,&BRENTER,&NSPND,&XMEM    @DJC   03150000
       LCLC    &SSADR,&BRANCHR,&WKAR,&RECR                              03200000
.*                                                                      03250000
.*       GET SUBSYSTEM ADDRESS                                          03300000
.*                                                                      03350000
        AIF    ('&SUBSYS' EQ '').DEFLT                                  03400000
        AIF    ('&SUBSYS'(1,1) EQ '(').SSREG                            03450000
.*   SUBSYSTEM ADDRESS IS IN PARM FIELD                                 03500000
&SSADR SETC     '&SUBSYS'                                               03550000
       AGO      .CHECKA                                                 03600000
.DEFLT ANOP                                                             03650000
.* SUBSYSTEM NOT SPECIFIED - - USE DEFAULT                              03700000
&SSDEFLT SETB   1                                                       03750000
&SSADR  SETC    '00000000'                                              03800000
        AGO     .CHECKA                                                 03850000
.SSREG  ANOP                                                            03900000
.* SUBSYSTEM NAME ADDRESS IS IN REGISTER                                03950000
&SSRG SETB      1                                                       04000000
&SSADR   SETC  '&SUBSYS(1)'                                             04050000
.CHECKA  ANOP                                                           04100000
.*                                                                      04150000
.* CHECK REC TO SEE IF IT IS IN REGISTER                                04200000
.*                                                                      04250000
         AIF   ('&REC' EQ '').ANULL                                     04300000
         AIF   ('&REC'(1,1) EQ '(').AREG                                04350000
.*  REC IS SPECIFIED DIRECTLY                                           04400000
&RECR SETC      '&REC'                                                  04450000
         AGO    .CHECKB                                                 04500000
.*  REC IS IN A REGISTER                                                04550000
.AREG     ANOP                                                          04600000
&RECR SETC      '&REC(1)'                                               04650000
&ARG     SETB   1                                                       04700000
.CHECKB  ANOP                                                           04750000
.*                                                                      04800000
.* CHECK WRKAREA TO SEE IF IS IN A REGISTER                             04850000
.*                                                                      04900000
         AIF   ('&WRKAREA' EQ '').BNULL                                 04950000
         AIF   ('&WRKAREA'(1,1) EQ '(').BREG                            05000000
.*  WRKAREA IS SPECIFIED DIRECTLY                                       05050000
&WKAR SETC      '&WRKAREA'                                              05100000
         AGO    .CHKMODE                                         @DJC   05150000
.*  WRKAREA IS IN A REGISTER                                            05200000
.BREG   ANOP                                                            05250000
&WKAR SETC      '&WRKAREA(1)'                                           05300000
&BRG     SETB   1                                                       05350000
        AGO    .CHKMODE                                          @DJC   05400000
.ANULL   ANOP                                                           05450000
         MNOTE  8,'RECORD ADDRESS NOT SPECIFIED'                        05500000
         MEXIT                                                          05550000
.BNULL    ANOP                                                          05600000
&WKAR     SETC    '00000000'       DUMMY WORKAREA                       05650000
.CHKMODE  ANOP                                                   @DJA   05652700
         AIF     ('&MODE' EQ '').CHECKBR  DEFAULT TO NO XMEM     @DJA   05655400
         AIF     ('&MODE' EQ 'XMEM').CHKWRK CHECK FOR WORKAREA   @DJA   05658100
         MNOTE   4,'ILLEGAL MODE PARAMETER SPECIFIED - IGNORED'  @DJA   05660800
         AGO     .CHECKBR                                        @DJA   05663500
.CHKWRK   ANOP                                                   @DJA   05666200
         AIF     ('&WRKAREA' EQ '').NOWRK  NO WORKAREA SPECIFIED @DJA   05668900
         AIF     ('&BRANCH' EQ '').NOBRNCH NOT BRANCH=YES        @DJA   05671600
         AIF     ('&BRANCH' EQ 'NO').NOBRNCH NOT BRANCH=YES      @DJA   05674300
&XMEM    SETB    1                INDICATE MODE=XMEM SPECIFIED   @DJA   05677000
         AGO     .CHECKBR                                        @DJA   05679700
.NOWRK    ANOP                    NO WORKAREA SUPPLIED           @DJA   05682400
         MNOTE   8,'REQUIRED WORKAREA NOT SUPPLIED FOR MODE=XMEM' @DJA  05685100
         MEXIT                                                   @DJA   05687800
.NOBRNCH  ANOP                    ILLEGAL BRANCH TYPE            @DJA   05690500
         MNOTE   8,'BRANCH=YES MUST BE CODED FOR MODE=XMEM'      @DJA   05693200
         MEXIT                                                          05695900
.CHECKBR  ANOP                                                          05700000
         AIF     ('&BRANCH' EQ '').GEN USE DEFAULT BRANCH=NO            05750000
         AIF     ('&BRANCH'(1,1) EQ '(').BRSUB                          05800000
         AIF     ('&BRANCH' EQ 'NO').GEN                                05850000
         AIF     ('&BRANCH' EQ 'YES').BRYES                             05900000
.BRERROR ANOP                                                           05950000
         MNOTE   4,'ILLEGAL BRANCH TYPE. BRANCH=NO ASSUMED'             06000000
         AGO     .GEN                                                   06050000
.BRYES   ANOP                                                           06100000
&BRENTER SETB   1  INDICATE BRANCH = YES                                06150000
         AGO    .GEN                                                    06200000
.BRSUB   ANOP ,        BRANCH IS IN PARENTHESES                      */ 06250000
         AIF   ('&BRANCH(1)' EQ 'YES').BRYES1                           06300000
         AGO   .BRERROR                                                 06350000
.BRYES1  ANOP                                                           06400000
&BRENTER SETB 1                                                         06450000
         AIF  ('&BRANCH(2)' EQ '').GEN                                  06500000
         AIF  ('&BRANCH(2)' EQ 'NOSUSPND').NOSPD                        06550000
         MNOTE 4,'ILLEGAL NOSUSPEND PARAMETER SPECIFIED - IGNORED'      06600000
         AGO   .GEN                                                     06650000
.NOSPD   ANOP                                                           06700000
         AIF   ('&WRKAREA' EQ '').NOWORK                                06750000
&NSPND   SETB  1                                                        06800000
         AGO   .GEN                                                     06850000
.NOWORK  ANOP                                                           06900000
         MNOTE  8,'REQUIRED WORK AREA NOT SUPPLIED FOR NOSUSPEND'       06950000
         MEXIT                                                          07000000
.GEN      ANOP                                                          07050000
.* GENERATE THE CODE AS COLLECTED                                       07100000
&A      SETA    &SYSNDX                                                 07150000
&FCN    SETA     4                                                      07200000
         AIF     ('&NAME' EQ '').NONE  IF NO LABEL GO TO NONE           07250000
&NAME    DS      0H                                                     07300000
.NONE    ANOP                                                           07350000
         L       15,16(0,0)                                             07400000
         L       15,196(,15)                                            07450000
         LTR      15,15                                                 07500000
         BNM      SMF1&A                     CHECK IF SMF ACTIVE        07550000
         L        15,SMCAMACR-SMCABASE(,15)   GET SUBROUTINE ADDRESS    07600000
         BALR     14,15                                                 07650000
SMFA&A   EQU      *                                                     07700000
         DC      B'&SSRG&SSDEFLT&ARG&BRG&BRENTER&NSPND&XMEM.000000000'  07750000
         DC       AL1(SMF2&A-SMFA&A) PARAMETER LENGTH                   07800000
         DC       X'&FCN'                                               07850000
         DC       AL4(&SSADR)     SUBSYSTEM ADDRESS                     07900000
         DC       AL4(&RECR)      RECORD ADDRESS                        07950000
         DC      AL4(&WKAR)      WRKAREA                                08000000
SMF1&A   EQU      *                                                     08050000
         LA       15,16      SMF NOT ACTIVE                             08100000
SMF2&A   EQU      *          RETURN POINT                               08150000
         MEND                                                           08200000
