         MACRO                                                          05000000
&NAME    SMFWTM  &MSGAD                                                 10000000
         AIF   ('&MSGAD' EQ '').E1                                      15000000
         AIF   ('&MSGAD' EQ '(1)').SVCA                                 20000000
         AIF   ('&MSGAD'(1,1) EQ '(').REGA                              25000000
         AGO   .LODIT                                                   30000000
.E1      MNOTE  '* * * NO OPERAND SPECIFIED * * *'                      35000000
         MEXIT                                                          40000000
.SVCA    ANOP                                                           45000000
&NAME    SVC   83                  ISSUE SVC                            50000000
         MEXIT                                                          55000000
.REGA    ANOP                                                           60000000
&NAME    LR    1,&MSGAD(1)         LOAD PARAMETER REG 1                 65000000
         AGO   .SVC                                                     70000000
.LODIT   ANOP                                                           75000000
&NAME    LA    1,&MSGAD            LOAD PARAMETER REG 1                 80000000
.SVC     SVC   83                  ISSUE SVC                            85000000
         MEND                                                           90000000
