*********************************************************************** 00045400
*                                                                     * 00090800
*  $MAC(SYNADAF): SYNAD ANALYZE AND FORMAT                            * 00136200
*                                                                     * 00181600
*  DESCRIPTIVE-NAME = SYNAD ANALYZE AND FORMAT                        * 00227000
*                                                                     * 00272400
*  PROGRAM-NAME = SAM                                                 * 00317800
*                                                                     * 00499400
.*PROPRIETARY V3 STATEMENT                                              00503400
.*LICENSED MATERIALS - PROPERTY OF IBM                                  00507400
.*"RESTRICTED MATERIALS OF IBM"                                         00511400
.*5695-DF1                                                              00515400
.*(C) COPYRIGHT 1992  IBM CORP.                                         00519400
.*END PROPRIETARY V3 STATEMENT                                          00525400
*                                                                     * 00531400
*                                                                     * 00537800
*  STATUS = MVS/XA DFP RELEASE 1                                      * 00544800
*                                                                     * 00590200
*  FUNCTION = INVOKES SVC 68(IGC0006H) WHICH OBTAINS CORE FOR         * 00635600
*             A GENERAL REGISTER SAVE AREA, AND A 136 BYTE            * 00681000
*             MESSAGE BUFFER AREA.                                    * 00726400
*                                                                     * 00771800
*  CHANGE ACTIVITY =                                                  * 00817200
*   $L1=DFP,HDP1102,,STLDHC: MVS/XA CLEANUP                           * 00862600
*   $01=OY46548,HDP3330,910301,SJPLCC: BDAM DATA ABOVE THE LINE   @01A* 00885300
*                                                                     * 00908000
.********************************************************************** 00930700
*********************************************************************** 00953400
         MACRO                                                          01000000
&NAME   SYNADAF &ACSMETH=,&PARM1=,&PARM2=                               02000000
         LCLC  &CB1                                                     03000000
         AIF   (T'&ACSMETH EQ 'O').AMERR                                05000000
         AIF   ('&ACSMETH' EQ '(0)').AMERR                              06000000
&CB1     SETC  '&ACSMETH'(1,1)                                          07000000
         AIF   ('&CB1' EQ '(').AMERR                                    08000000
&CB1     SETC  '(0)'                                                    09000000
         AIF   ('&ACSMETH' EQ 'EXCP').AMCOM                             10000000
&CB1     SETC  '(1)'                                                    11000000
         AIF   ('&ACSMETH' EQ 'BPAM').AMCOM                             12000000
&CB1     SETC  '(2)'                                                    13000000
         AIF   ('&ACSMETH' EQ 'BSAM').AMCOM                             14000000
&CB1     SETC  '(3)'                                                    15000000
         AIF   ('&ACSMETH' EQ 'QSAM').AMCOM                             16000000
&CB1     SETC  '(4)'                                                    17000000
         AIF   ('&ACSMETH' EQ 'BDAM').AMCOM                             18000000
&CB1     SETC  '(5)'                                                    19000000
         AIF   ('&ACSMETH' EQ 'BISAM').AMCOM                            20000000
&CB1     SETC  '(6)'                                                    21000000
         AIF   ('&ACSMETH' EQ 'QISAM').AMCOM                            22000000
&CB1     SETC  '(7)'                                                    23000000
         AIF   ('&ACSMETH' EQ 'BTAM').AMCOM                             24000000
&CB1     SETC  '(8)'                                                    25000000
         AIF   ('&ACSMETH' EQ 'QTAM').AMCOM                             26000000
&CB1     SETC  '(9)'                                                    27000000
         AIF   ('&ACSMETH' EQ 'GAM').AMCOM                              28000000
.AMERR   MNOTE 8,' ERROR ** ACCESS METHOD NOT SPEC. OR ILLEGAL '  15138 28800000
         MEXIT                                                    15138 29600000
.AMCOM   ANOP                                                     15138 30400000
&NAME    BC    15,*+6         BRANCH AROUND LIST                   @01C 30450000
         DC    AL1&CB1        ACCESS METHOD CODE                        35000000
         DC    AL1(0)                                              @01C 35050000
         ICM   15,B'1000',*-2 SET ACCESS METHOD IN REG. 15         @01C 35100000
*  NOTE: ABOVE LINE DESTROYS REG 15 FOR 31-BIT CALLERS             @01A 35150000
.PARMA   AIF   (T'&PARM1 EQ 'O').PARMB                                  37000000
         AIF   ('&PARM1' EQ '(1)').PARMB                                38000000
&CB1     SETC  '&PARM1'(1,1)                                            39000000
         AIF   (NOT ('&CB1' EQ '(')).SYMA                               40000000
         LR    1,&PARM1(1)    GET ADDRESS IN REG. 1                     41000000
         AGO   .PARMB                                                   42000000
.SYMA    LA    1,&PARM1       GET ADDRESS IN REG. 1                     43000000
.PARMB   AIF   (T'&PARM2 EQ 'O').COM                                    44000000
         AIF   ('&PARM2' EQ '(0)').COM                                  45000000
&CB1     SETC  '&PARM2'(1,1)                                            46000000
         AIF   (NOT ('&CB1' EQ '(')).SYMB                               47000000
         LR    0,&PARM2(1)    SET PARAMETER IN REG. 0                   48000000
         AGO   .COM                                                     49000000
.SYMB    LA    0,&PARM2(1)    GET PARAMETER IN REG. 0                   50000000
.COM     SVC   68             ISSUE SVC                                 51000000
         MEND                                                           52000000
