         MACRO                                                          00050000
&LABEL   SYSEVENT  &EVENT,&ASID=,&ASIDL=,&ENTRY=,&TYPE=        @G742PJC 00100000
         ANOP                              ADDED TYPE= KEYWORD @ZA29015 00150000
         LCLA      &EVENTO,&FIPDISP,&SYSER                         @D1C 00200000
         AGO   .AROUND                                         @G50IPSS 00250000
* /*******************************************************************/ 00300000
* /*                                                                 */ 00350000
* /* PROPRIETARY STATEMENT =                                         */ 00400000
* /*                                                                 */ 00450000
* /*    LICENSED MATERIALS - PROPERTY OF IBM                         */ 00500000
* /*    "RESTRICTED MATERIALS OF IBM"                                */ 00550000
* /*    5647-A01 (C) COPYRIGHT IBM CORP. 1977, 2000                  */ 00600000
* /*                                                                 */ 00700000
* /*01* EXTERNAL CLASSIFICATION: GUPI                                */ 00750000
* /*01* END OF EXTERNAL CLASSIFICATION:                              */ 00800000
* /*                                                                 */ 00850000
* /* STATUS - JBB6609                                                */ 00875000
* /*                                                                 */ 00900000
* /* ----------------------------------------------------------------*/ 00925000
* /*                                                             @LRC*/ 00950000
* /* CHANGE ACTIVITY -                                           @H4C*/ 01000000
* /*                                                             @H4A*/ 01050000
* /*   OY08710 -- SUPPORT FOR TCB/SRB TIMER SPE  871008      @YA08710*/ 01100000
* /*                                                                 */ 01150000
* /*   OY08835 -- 11/23/87 - SUPPORT FOR VIO TO EXPANDED STORAGE     */ 01200000
* /*                                                         @YA08835*/ 01250000
* /* $H4=ES       JBB2133 830101 PDF6  : EXTENDED STORE          @H4A*/ 01300000
* /* $D1=DCR39    JBB2133 831109 PDF6  : SRM VSCR                    */ 01350000
* /* $L7=HARP01   JBB2216 831116 PDF6  : HARP RELEASE 1 (FWA)        */ 01400000
* /* $LR=RTMRAS   HBB3310 860807 PD88AB: RTMRAS SUPPORT              */ 01450000
* /* $L1=HIPER    JBB3311 880314 PD88AK: SUPPORT FOR HIPERSPACES @L1A*/ 01500000
* /* $D2=DCG0035  JBB3311 880428 PD88AB: SUPPORT FOR NEW SYSEVENT    */ 01550000
* /*                                     AUXTREQ                 @D2A*/ 01600000
* /* $D3=DCG0064  JBB3311 880802 PD88AK: SUPPORT FOR TYPE= KEYWORD   */ 01650000
* /*                                     FOR STGTEST SYSEVENT    @D3A*/ 01700000
* /* $L2=APPC1    HBB4420 890905 PD88CL: APPC RELEASE 1 SUPPORT FOR  */ 01750000
* /*                                     APPCREQ NEW SYSEVENT    @L2A*/ 01800000
* /* $D4=DH30070  HBB4420 900122 PD88EK: APPC RELEASE 1 SUPPORT FOR  */ 01850000
* /*                                     INITID NEW SYSEVENT     @D4A*/ 01900000
* /* $P1=PH30871  HBB4420 901019 PD88AI: ADD NEW SYSEVENT TO HANDLE  */ 01950000
* /*                                     RETURN FROM ASYNCHRONOUS    */ 02000000
* /*                                     CALL OF ?SPI MACRO      @P1A*/ 02050000
* /* $L4=SYNCS    HBB4430 911202 PD88IK: SMF INTERVAL SYNCH SUPPORT  */ 02100000
* /*                                                             @L4A*/ 02150000
* /* $L5=WLMI     HBB5510 921231 PD88AK: WORKLOAD MANAGER I      @L5A*/ 02200000
* /* $L6=ENCLV    HBB5520 931215 PD88AK: ENCLAVES                @L6A*/ 02250000
* /* $L8=ARM      HBB5520 940310 PD88V1: SYSEVENT 89 - STATEXIT  @L8A*/ 02300000
* /* $L9=ENCLV    HBB5520 940921 PD16  : SYSEVENT 91 - REQASCL   @L9A   02350000
*                                        DB2 MULTI-CEC PARALLELISM      02400000
*                                        ADD DUMMY EVENTS 92-100        02450000
*    $P2=PN72145  HBB5520 941209 PD88BB: SYSEVENT 101 ENCSTATE   @P2A   02500000
*    $LA=OPEN3    JBB5522 940912 PD88D0: OPEN MVS RAW MODE SUPPORT      02550000
*                                                                @LAA   02600000
*    $XVS WLMPBPM HBB6603 950222 PD88RK: SYSEVENT 102 HSPCQRY           02650000
*                                                            @WLMPBPM   02700000
*    $XVS WLMPBPM HBB6603 950605 PD88BB: John Arwe WLMBP    103         02750000
*    $XVS WLMPESM HBB6603 950605 PD88BB: John Arwe xxxxxxxx 104         02800000
*                                                  WLMQUEUE 105         02850000
*                                                  ENCASSOC 106         02900000
*    $WLMPESM1    HBB6603 951101 PDBB:   John Arwe ENQHOLD/ENQRELSE     02950000
*                                        Require TYPE=value, values     03000000
*                                        documented in IRAEVPL          03050000
*                                        Reserve sysevent 104           03100000
*    $PQC0922     HBB6603 960423 PDBZ:   Peter Yocom: CDPI fix          03150000
*    $DQC0023     HBB6603 960410 PDBB:   John Arwe  ENCCREAT            03200000
*                                        Require TYPE=value, values     03250000
*                                        documented in IRAWLMPL         03300000
*    $WLMPBAT     JBB6604 961215 PDBZ:   Peter Yocom: Define            03350000
*                                        sysevent SCTCNV                03400000
*    $OW34477     HBB6606 980721 PDCO:   Hiren Shah : Define            03450000
*                                        sysevent FREEAUX               03500000
*                                                                    */ 03550000
**********************************************************************/ 03600000
.AROUND  ANOP                                                  @G50IPSS 03650000
&FIPDISP SETA  99                                                       03700000
&SYSER   SETA  14                                                  @D1A 03750000
&EVENTO  SETA  1                                                        03800000
         AIF   ('&EVENT'EQ'TIMEREXP').EOK                               03850000
&EVENTO  SETA      2                                                    03900000
         AIF   ('&EVENT'EQ'TERMWAIT').EOK                               03950000
&EVENTO  SETA      3                                                    04000000
         AIF   ('&EVENT'EQ'NIOWAIT').EOK                                04050000
&EVENTO  SETA      4                                                    04100000
         AIF   ('&EVENT'EQ'USERRDY').EOK                                04150000
         AIF   ('&EVENT'NE'TIME').NEXT                        @G50IPSS  04200000
&EVENTO  SETA      5                                          @G50IPSS  04250000
&FIPDISP SETA      0                                          @G50IPSS  04300000
         AGO       .EOK                                       @G50IPSS  04350000
.NEXT    ANOP                                                 @G50IPSS  04400000
&EVENTO  SETA      6                                                    04450000
         AIF   ('&EVENT'EQ'MEMCREAT').EOK                               04500000
&EVENTO  SETA      7                                                    04550000
         AIF   ('&EVENT'EQ'MEMDEL').EOK                                 04600000
&EVENTO  SETA      8                                                    04650000
         AIF   ('&EVENT'EQ'JOBSELCT').EOK                               04700000
&EVENTO  SETA      9                                                    04750000
         AIF   ('&EVENT'EQ'JOBTERM').EOK                                04800000
&EVENTO  SETA      10                                                   04850000
         AIF   ('&EVENT'EQ'INITATT').EOK                                04900000
&EVENTO  SETA      11                                                   04950000
         AIF   ('&EVENT'EQ'INITDET').EOK                                05000000
&EVENTO  SETA      12                                                   05050000
         AIF   ('&EVENT'EQ'QSCEST').EOK                                 05100000
&EVENTO  SETA      13                                                   05150000
         AIF   ('&EVENT'EQ'QSCECMP').EOK                                05200000
&EVENTO  SETA      14                                                   05250000
         AIF   ('&EVENT'EQ'TRANSWAP').EOK                     @ZA16887  05300000
&EVENTO  SETA      15                                                   05350000
         AIF   ('&EVENT'EQ'SWOUTCMP').EOK                               05400000
&EVENTO  SETA      16                                                   05450000
         AIF   ('&EVENT'EQ'SWINSTAT').EOK                     @Z40BPCH  05500000
&EVENTO  SETA      17                                                   05550000
         AIF   ('&EVENT'EQ'SWINFL').EOK                                 05600000
&EVENTO  SETA      18                                                   05650000
         AIF   ('&EVENT'EQ'QSCEFL').EOK                                 05700000
&EVENTO  SETA      19                                                   05750000
         AIF   ('&EVENT'EQ'RSTORCMP').EOK                               05800000
&EVENTO  SETA      20                                                   05850000
         AIF   ('&EVENT'EQ'ENQHOLD').EOK                                05900000
&EVENTO  SETA      21                                                   05950000
         AIF   ('&EVENT'EQ'ENQRLSE').EOK                                06000000
&EVENTO  SETA      22                                                   06050000
         AIF   ('&EVENT'EQ'RSMCNSTS').EOK                         @H4A  06100000
&EVENTO  SETA      23                                                   06150000
         AIF   ('&EVENT'EQ'AVQLOW').EOK                                 06200000
&EVENTO  SETA      24                                                   06250000
         AIF   ('&EVENT'EQ'AVQOK').EOK                                  06300000
&EVENTO  SETA      25                                                   06350000
         AIF   ('&EVENT'EQ'SQALOW').EOK                                 06400000
&EVENTO  SETA      26                                                   06450000
         AIF   ('&EVENT'EQ'SQAOK').EOK                                  06500000
&EVENTO  SETA      27                                                   06550000
         AIF   ('&EVENT'EQ'EASINIT').EOK                      @G382PGS  06600000
&EVENTO  SETA      28                                                   06650000
         AIF   ('&EVENT'EQ'DEVALLOC').EOK                               06700000
&EVENTO  SETA      29                                                   06750000
         AIF   ('&EVENT'EQ'CONFIGCH').EOK                               06800000
&EVENTO  SETA      30                                                   06850000
         AIF   ('&EVENT'EQ'VERIFYPG').EOK                               06900000
&EVENTO  SETA      31                                                   06950000
         AIF   ('&EVENT'EQ'RESETPG').EOK                                07000000
&EVENTO  SETA      32                                                   07050000
         AIF   ('&EVENT'EQ'NEWIPS').EOK                                 07100000
&EVENTO  SETA      33                                                   07150000
         AIF   ('&EVENT'EQ'ALTCPREC').EOK                               07200000
&EVENTO  SETA      34                                                   07250000
         AIF   ('&EVENT'EQ'TGETTPUT').EOK                               07300000
&EVENTO  SETA      35                                                   07350000
         AIF   ('&EVENT'EQ'SYQSCST').EOK                                07400000
&EVENTO  SETA      36                                                   07450000
         AIF   ('&EVENT'EQ'SYQSCCMP').EOK                               07500000
&EVENTO  SETA      37                                                   07550000
         AIF   ('&EVENT'EQ'SETDMN').EOK                   @Z40BPCH      07600000
&EVENTO  SETA      38                                                   07650000
         AIF   ('&EVENT'EQ'REQSERVC').EOK                               07700000
&EVENTO  SETA      39                                                   07750000
         AIF   ('&EVENT'EQ'REQPGDAT').EOK                               07800000
&EVENTO  SETA      40                                                   07850000
         AIF   ('&EVENT'EQ'COPYDMDT').EOK                               07900000
&EVENTO  SETA      41                                                   07950000
         AIF   ('&EVENT'EQ'DONTSWAP').EOK                               08000000
&EVENTO  SETA      42                                                   08050000
         AIF   ('&EVENT'EQ'OKSWAP').EOK                                 08100000
&EVENTO  SETA      43                                                   08150000
         AIF   ('&EVENT'EQ'REQSWAP').EOK                                08200000
&EVENTO  SETA      44                                                   08250000
         AIF   ('&EVENT'EQ'BRINGIN').EOK                                08300000
&EVENTO  SETA      45                                                   08350000
         AIF   ('&EVENT'EQ'WKLDINIT').EOK                               08400000
&EVENTO  SETA      46                                                   08450000
         AIF   ('&EVENT'EQ'WKLDCOLL').EOK                               08500000
&EVENTO  SETA      47                                                   08550000
         AIF   ('&EVENT'EQ'WKLDTERM').EOK                               08600000
&EVENTO  SETA      48                                                   08650000
.*                                                                      08700000
&EVENTO  SETA      49                                                   08750000
         AIF   ('&EVENT'EQ'REQSVDAT').EOK                               08800000
         AIF   ('&EVENT'NE'HOLD').NEXT51                      @G50IPSS  08850000
&EVENTO  SETA      50                                         @G50IPSS  08900000
&FIPDISP SETA      4                                          @G50IPSS  08950000
         AGO       .EOK                                       @G50IPSS  09000000
.NEXT51  ANOP                                                 @G50IPSS  09050000
         AIF   ('&EVENT'NE'NOHOLD').NEXT52                    @G50IPSS  09100000
&EVENTO  SETA      51                                         @G50IPSS  09150000
&FIPDISP SETA      8                                          @G50IPSS  09200000
         AGO       .EOK                                       @G50IPSS  09250000
.NEXT52  ANOP                                                 @G50IPSS  09300000
&EVENTO  SETA      52                                                   09350000
         AIF   ('&EVENT'EQ'NEWOPT').EOK                       @G741PGM  09400000
         AIF ('&EVENT'EQ'TRAXERPT').EVT53                    @G742PJC   09450000
         AIF ('&EVENT'NE'EVENT53').NEXT54                    @ZA31158   09500000
.EVT53   ANOP                                                @G742PJC   09550000
&EVENTO  SETA      53                                        @ZA31158   09600000
&FIPDISP SETA      12                                        @ZA31158   09650000
         AGO       .EOK                                      @ZA31158   09700000
.NEXT54  AIF ('&EVENT'EQ'TRAXFRPT').EVT54                    @G742PJC   09750000
         AIF ('&EVENT'NE'EVENT54').NEXT55                    @G742PJC   09800000
.EVT54   ANOP                                                @G742PJC   09850000
&EVENTO  SETA      54                                        @ZA31158   09900000
&FIPDISP SETA      16                                        @ZA31158   09950000
         AGO       .EOK                                      @ZA31158   10000000
.NEXT55  AIF ('&EVENT'EQ'TRAXRPT').EVT55                     @G742PJC   10050000
         AIF ('&EVENT'NE'EVENT55').NEXT56                    @G742PJC   10100000
.EVT55   ANOP                                                @G742PJC   10150000
&EVENTO  SETA      55                                        @ZA31158   10200000
&FIPDISP SETA      20                                        @ZA31158   10250000
         AGO       .EOK                                      @ZA31158   10300000
.NEXT56  AIF ('&EVENT'NE'DIRECTPO').NEXT57                       @H4C   10350000
&EVENTO  SETA      56                                        @ZA31158   10400000
&FIPDISP SETA      24                                        @ZA31158   10450000
&SYSER   SETA  15                                                  @D1A 10500000
         AGO       .EOK                                      @ZA31158   10550000
.NEXT57  AIF ('&EVENT'NE'VIOVSAV').NEXT58                    @YA08835   10600000
&EVENTO  SETA      57                                        @YA08835   10650000
&FIPDISP SETA      28                                        @YA08835   10700000
&SYSER   SETA  15                                            @YA08835   10750000
         AGO       .EOK                                      @ZA31158   10800000
.NEXT58  AIF ('&EVENT'NE'MSCHECK').NEXT59                          @L5C 10850000
&EVENTO  SETA      58                                        @ZA31158   10900000
&FIPDISP SETA      32                                        @ZA31158   10950000
&SYSER   SETA  15                                                  @L5A 11000000
         AGO       .EOK                                      @ZA31158   11050000
.NEXT59  AIF ('&EVENT'NE'OMVSWAIT').NEXT60                         @LAC 11100000
&EVENTO  SETA      59                                        @ZA31158   11150000
&FIPDISP SETA      36                                        @ZA31158   11200000
&SYSER   SETA  15                                                  @LAA 11250000
         AGO       .EOK                                      @ZA31158   11300000
.NEXT60  AIF ('&EVENT'NE'ICSCHK').NEXT61                     @G742PJC   11350000
&EVENTO  SETA      60                                        @G742PJC   11400000
&FIPDISP SETA      40                                        @G742PJC   11450000
         AGO       .EOK                                      @G742PJC   11500000
.NEXT61  AIF ('&EVENT'NE'NEWICS').NEXT62                     @G742PJC   11550000
&EVENTO  SETA      61                                        @G742PJC   11600000
         AGO       .EOK                                      @G742PJC   11650000
.NEXT62  AIF ('&EVENT'NE'STGIFAIL').NEXT63                   @YA08835   11700000
&EVENTO  SETA      62                                        @YA08835   11750000
         AGO       .EOK                                      @YA08835   11800000
.NEXT63  AIF ('&EVENT'NE'CMDSTART').NEXT64                   @G744PGS   11850000
&EVENTO  SETA      63                                        @G744PGS   11900000
         AGO       .EOK                                      @G744PGS   11950000
.NEXT64  AIF ('&EVENT'NE'CMDEND').NEXT65                         @L7C   12000000
&EVENTO  SETA      64                                        @G744PGS   12050000
&FIPDISP SETA      44                                        @G744PJC   12100000
         AGO       .EOK                                      @G744PGS   12150000
.NEXT65  AIF ('&EVENT'NE'WKLDCHG').NEXT66                        @L7A   12200000
&EVENTO  SETA      65                                            @L7A   12250000
         AGO       .EOK                                          @L7A   12300000
.NEXT66  AIF ('&EVENT'NE'MIGCNSTR').NEXT67                       @H4A   12350000
&EVENTO  SETA      66                                            @H4A   12400000
         AGO       .EOK                                          @H4A   12450000
.NEXT67  AIF ('&EVENT'NE'MIGPURGE').NEXT68                       @H4A   12500000
&EVENTO  SETA      67                                            @H4A   12550000
         AGO       .EOK                                          @H4A   12600000
.NEXT68  AIF ('&EVENT'NE'MIGSWAP').NEXT69                        @H4A   12650000
&EVENTO  SETA      68                                            @H4A   12700000
         AGO       .EOK                                          @H4A   12750000
.NEXT69  AIF ('&EVENT'NE'SOUTSUSP').NEXT70                       @H4A   12800000
&EVENTO  SETA      69                                            @H4A   12850000
         AGO       .EOK                                          @H4A   12900000
.NEXT70  AIF ('&EVENT'NE'UCBCHG').NEXT71                     @G860P26   12950000
&EVENTO  SETA      70                                        @G860P26   13000000
         AGO       .EOK                                      @G860P26   13050000
.NEXT71  AIF ('&EVENT'NE'DDR').NEXT72                        @G860P26   13100000
&EVENTO  SETA      71                                        @G860P26   13150000
         AGO       .EOK                                      @G860P26   13200000
.NEXT72  AIF ('&EVENT'NE'CHANNEL').NEXT73                    @G860P26   13250000
&EVENTO  SETA      72                                        @G860P26   13300000
         AGO       .EOK                                      @G860P26   13350000
.NEXT73  AIF ('&EVENT'NE'AVAILPUP').NEXT74                         @LRA 13400000
&EVENTO  SETA      73                                              @LRA 13450000
         AGO       .EOK                                            @LRA 13500000
.NEXT74  AIF ('&EVENT'NE'CPUTCONV').NEXT75                   @YA08710   13550000
&EVENTO  SETA      74                                        @YA08710   13600000
&LABEL   L     1,16             LOAD THE CVT ADDRESS                    13650000
         L     1,604(,1)        LOAD THE RMCT ADDRESS                   13700000
         L     15,28(,1)        LOAD THE VCON ADDRESS IN IRARMCT        13750000
         BALR  14,15                                                    13800000
         MEXIT                                                          13850000
.NEXT75  AIF ('&EVENT'NE'STGTEST').NEXT76                          @L1A 13900000
&EVENTO  SETA      75                                              @L1A 13950000
         AGO       .EOK                                            @L1A 14000000
.NEXT76  AIF ('&EVENT'NE'AUXTREQ').NEXT77                          @D2A 14050000
&EVENTO  SETA      76                                              @D2A 14100000
         AGO       .EOK                                            @D2A 14150000
.NEXT77  AIF ('&EVENT'NE'APPCREQ').NEXT78                          @L2C 14200000
&EVENTO  SETA      77                                              @L2C 14250000
         AGO       .EOK                                            @L2A 14300000
.NEXT78  AIF ('&EVENT'NE'INITID').NEXT79                           @D4A 14350000
&EVENTO  SETA      78                                              @D4A 14400000
         AGO       .EOK                                            @D4P 14450000
.NEXT79  AIF ('&EVENT'NE'SADBRSTR').NEXT80                         @P1A 14500000
&EVENTO  SETA      79                                              @P1A 14550000
         AGO       .EOK                                            @P1A 14600000
.NEXT80  AIF ('&EVENT'NE'CHKSWIN').NEXT81                          @L4A 14650000
&EVENTO  SETA      80                                              @L4A 14700000
&FIPDISP SETA      48                                              @L4A 14750000
         AGO       .EOK                                            @L4A 14800000
.NEXT81  AIF ('&EVENT'NE'REQFASD').NEXT82                          @L5A 14850000
&EVENTO  SETA      81                                              @L5A 14900000
&FIPDISP SETA      52                                              @L5A 14950000
&SYSER   SETA      15                                              @L5A 15000000
         AGO       .EOK                                            @L5A 15050000
.NEXT82  AIF ('&EVENT'NE'REQASD').NEXT83                           @L5A 15100000
&EVENTO  SETA      82                                              @L5A 15150000
         AGO       .EOK                                            @L5A 15200000
.NEXT83  AIF ('&EVENT'NE'WLMSTCHG').NEXT84                         @L5A 15250000
&EVENTO  SETA      83                                              @L5A 15300000
         AGO       .EOK                                            @L5A 15350000
.NEXT84  AIF ('&EVENT'NE'WLMCOLL').NEXT85                          @L5A 15400000
&EVENTO  SETA      84                                              @L5A 15450000
         AGO       .EOK                                            @L5A 15500000
.NEXT85  AIF ('&EVENT'NE'REQSRMST').NEXT86                         @L5A 15550000
&EVENTO  SETA      85                                              @L5A 15600000
         AGO       .EOK                                            @L5A 15650000
.NEXT86  AIF ('&EVENT'NE'RCVPADAT').NEXT87                         @L5A 15700000
&EVENTO  SETA      86                                              @L5A 15750000
         AGO       .EOK                                            @L5A 15800000
.NEXT87  AIF ('&EVENT'NE'ENCCREAT').NEXT88                         @L6A 15850000
&EVENTO  SETA      87                                              @L6A 15900000
         AGO       .EOK                                            @L6A 15950000
.NEXT88  AIF ('&EVENT'NE'ENCDELET').NEXT89                         @L6A 16000000
&EVENTO  SETA      88                                              @L6A 16050000
         AGO       .EOK                                            @L6A 16100000
.NEXT89  AIF ('&EVENT'NE'STATEXIT').NEXT90                         @L8A 16150000
&EVENTO  SETA      89                                              @L8A 16200000
         AGO       .EOK                                            @L8A 16250000
.NEXT90  AIF ('&EVENT'NE'CLSFYENC').NEXT91                         @L6A 16300000
&EVENTO  SETA      90                                              @L6C 16350000
         AGO       .EOK                                            @L6A 16400000
.NEXT91  AIF ('&EVENT'NE'REQASCL').NEXT92                          @L9A 16450000
&EVENTO  SETA      91                                              @L9A 16500000
         AGO       .EOK                                            @L9A 16550000
.NEXT92  AIF ('&EVENT'NE'EVENT92').NEXT93                          @P2A 16600000
&EVENTO  SETA      92                                              @P2A 16650000
         AGO       .EOK                                            @P2A 16700000
.NEXT93  AIF ('&EVENT'NE'EVENT93').NEXT94                          @P2A 16750000
&EVENTO  SETA      93                                              @P2A 16800000
         AGO       .EOK                                            @P2A 16850000
.NEXT94  AIF ('&EVENT'NE'EVENT94').NEXT95                          @P2A 16900000
&EVENTO  SETA      94                                              @P2A 16950000
         AGO       .EOK                                            @P2A 17000000
.NEXT95  AIF ('&EVENT'NE'EVENT95').NEXT96                          @P2A 17050000
&EVENTO  SETA      95                                              @P2A 17100000
         AGO       .EOK                                            @P2A 17150000
.NEXT96  AIF ('&EVENT'NE'EVENT96').NEXT97                          @P2A 17200000
&EVENTO  SETA      96                                              @P2A 17250000
         AGO       .EOK                                            @P2A 17300000
.NEXT97  AIF ('&EVENT'NE'EVENT97').NEXT98                          @P2A 17350000
&EVENTO  SETA      97                                              @P2A 17400000
         AGO       .EOK                                            @P2A 17450000
.NEXT98  AIF ('&EVENT'NE'EVENT98').NEXT99                          @P2A 17500000
&EVENTO  SETA      98                                              @P2A 17550000
         AGO       .EOK                                            @P2A 17600000
.NEXT99  AIF ('&EVENT'NE'EVENT99').NEXT100                         @P2A 17650000
&EVENTO  SETA      99                                              @P2A 17700000
         AGO       .EOK                                            @P2A 17750000
.NEXT100 AIF ('&EVENT'NE'EVENT100').NEXT101                        @P2A 17800000
&EVENTO  SETA      100                                             @P2A 17850000
         AGO       .EOK                                            @P2A 17900000
.NEXT101 AIF ('&EVENT'NE'ENCSTATE').NEXT102                    @WLMPBPM 17950000
&EVENTO  SETA      101                                             @P2A 18000000
         AGO       .EOK                                            @P2A 18050000
.*                                                                      18100000
.NEXT102 AIF ('&EVENT'NE'HSPCQRY').AFTR102                     @WLMPBPM 18150000
&EVENTO  SETA      102                                         @WLMPBPM 18200000
&FIPDISP SETA      56                                          @WLMPBPM 18250000
&SYSER   SETA      15                                          @WLMPBPM 18300000
         AGO       .EOK                                        @WLMPBPM 18350000
.AFTR102 ANOP                                                  @WLMPBPM 18400000
.*                                                                      18450000
         AIF ('&EVENT'NE'WLMBP').AFTR103                       @WLMPBPM 18500000
&EVENTO  SETA      103                                         @WLMPBPM 18550000
         AGO       .EOK                                        @WLMPBPM 18600000
.AFTR103 ANOP                                                  @WLMPBPM 18650000
.*------------------------------------------------------------          18700000
         AIF ('&EVENT'NE'EVENT104').AFTR104                    @WLMPESM 18750000
&EVENTO  SETA      104                                         @WLMPESM 18800000
         AGO       .EOK                                        @WLMPESM 18850000
.AFTR104 ANOP                                                  @WLMPESM 18900000
.*------------------------------------------------------------          18950000
         AIF ('&EVENT'NE'WLMQUEUE').AFTR105                    @WLMPESM 19000000
&EVENTO  SETA      105                                         @WLMPESM 19050000
         AGO       .EOK                                        @WLMPESM 19100000
.AFTR105 ANOP                                                  @WLMPESM 19150000
.*------------------------------------------------------------          19200000
         AIF ('&EVENT'NE'ENCASSOC').AFTR106                    @WLMPESM 19250000
&EVENTO  SETA      106                                         @WLMPESM 19300000
         AGO       .EOK                                        @WLMPESM 19350000
.AFTR106 ANOP                                                  @WLMPESM 19400000
.*------------------------------------------------------------          19450000
         AIF ('&EVENT'NE'SCTCNV').AFTR108                      @WLMPBAT 19500000
&EVENTO  SETA      108                                         @WLMPBAT 19550000
&FIPDISP SETA      60                                          @WLMPBAT 19600000
&SYSER   SETA      15                                          @WLMPBAT 19650000
         AGO       .EOK                                        @WLMPBAT 19700000
.AFTR108 ANOP                                                  @WLMPBAT 19750000
.*------------------------------------------------------------          19800000
         AIF ('&EVENT'NE'FREEAUX').AFTR110                     @OW34477 19850000
&EVENTO  SETA      110                                         @OW34477 19900000
&FIPDISP SETA      64                                          @OW34477 19950000
&SYSER   SETA      15                                          @OW34477 20000000
         AGO       .EOK                                        @OW34477 20050000
.AFTR110 ANOP                                                  @OW34477 20100000
.*------------------------------------------------------------          20150000
.* If execution gets to here, invalid EVENT value              @WLMPESM 20200000
&EVENTO  SETA      999                                             @P2C 20250000
.*                                                                      20300000
         AGO       .ERROR1                                              20350000
.*------------------------------------------------------------          20400000
.EOK     AIF       ('&ASID'NE''AND'&ASIDL'NE'').ERROR4                  20450000
         AIF       ('&ASID'EQ'').NULREG                                 20500000
         AIF       ('&ASID'(1,1)NE'(').ERROR2                           20550000
         AIF       ('&ASID'EQ'(0)').SKPREG                              20600000
&LABEL   LR    0,&ASID(1)              PUT ASID INTO REGISTER 0         20650000
         AGO       .SHFTID                                              20700000
.NULREG  AIF       ('&ASIDL'EQ'').OKLAB                                 20750000
         AIF       ('&ASIDL'(1,1)EQ'(').ERROR3                          20800000
         AIF       ('&ASIDL'(K'&ASIDL,1)NE')').OKLAB                    20850000
&LABEL   LH    0,&ASIDL                PUT ASID INTO REGISTER 0         20900000
         AGO       .SHFTID                                              20950000
.OKLAB   ANOP                                                           21000000
&LABEL   LA    0,&EVENTO.(0,0)         SYSEVENT CODE                    21050000
         AIF       ('&ASIDL'EQ'').IC2                          @ZA29015 21100000
         ICM   0,12,&ASIDL             PUT ASID INTO REGISTER 0         21150000
         AGO       .IC2                                        @ZA29015 21200000
.SKPREG  AIF       ('&LABEL'EQ'').SHFTID                                21250000
&LABEL   DS    0H                                                       21300000
.SHFTID  SLL   0,16(0)                 SHIFT INTO PROPER POSITION       21350000
         AIF       ('&ENTRY'NE'BRANCH').IC                              21400000
         LA    14,&EVENTO.(0,0)        SYSEVENT CODE                    21450000
         OR    0,14                    PUT CODE INTO REGISTER 0         21500000
         AGO       .IC2                                        @ZA29015 21550000
.IC      AIF   ('&TYPE'EQ'NOSWIN'AND'&EVENT'EQ'MEMDEL').TYPE01 @ZA29015 21600000
         AIF   ('&TYPE'EQ'INTERVAL'AND'&EVENT'EQ'REQPGDAT').TYPE01      21650000
         ANOP                          ADDED REQPGDAT OPTION   @ZM49916 21700000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'STGTEST').VALID1          @D3A 21750000
         AIF   ('&TYPE'EQ'BYTE'AND'&EVENT'EQ'STGTEST').TYPE01      @D3A 21800000
         AIF   ('&TYPE'NE'BLOCK'AND'&EVENT'EQ'STGTEST').ERROR7     @D3A 21850000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'RESETPG').DFAULT1         @L5A 21900000
         AIF   ('&TYPE'EQ'SRVCLASS'AND'&EVENT'EQ'RESETPG').TYPE80  @L5A 21950000
         AIF   ('&TYPE'EQ'QUIESCE'AND'&EVENT'EQ'RESETPG').TYPE40   @L5A 22000000
         AIF   ('&TYPE'EQ'RESUME'AND'&EVENT'EQ'RESETPG').TYPE20    @L5A 22050000
         AIF   ('&TYPE'NE'PGN'AND'&EVENT'EQ'RESETPG').ERROR8       @L5A 22100000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'WLMBP').TYPEREQUIRED           22150000
.*                                                            @WLMPBPM  22200000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'WLMBP').TYPEGENERATED1         22250000
.*                                                            @WLMPBPM  22300000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'EVENT104').TYPEREQUIRED        22350000
.*                                                           @WLMPESM1  22400000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'EVENT104').TYPEGENERATED1      22450000
.*                                                           @WLMPESM1  22500000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'WLMQUEUE').TYPEREQUIRED        22550000
.*                                                            @WLMPESM  22600000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'WLMQUEUE').TYPEGENERATED1      22650000
.*                                                            @WLMPESM  22700000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'ENCASSOC').TYPEREQUIRED        22750000
.*                                                            @WLMPESM  22800000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'ENCASSOC').TYPEGENERATED1      22850000
.*                                                            @WLMPESM  22900000
.*       Default ENQHOLD and ENQRELSE to TYPE=NoWorkUnitInfo  @WLMPESM1 22950000
.*       for compatibility with earlier releases              @WLMPESM1 23000000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'ENQHOLD').DFAULT1    @WLMPESM1 23050000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'ENQHOLD').TYPEGENERATED1       23100000
.*                                                            @WLMPESM1 23150000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'ENQRLSE').DFAULT1    @WLMPESM1 23200000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'ENQRLSE').TYPEGENERATED1       23250000
.*                                                            @WLMPESM1 23300000
.*       Default ENCCREAT to TYPE=Independent                 @DQC0023  23350000
.*       for compatibility with earlier releases              @DQC0023  23400000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'ENCCREAT').DFAULT1   @DQC0023  23450000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'ENCCREAT').TYPEGENERATED1      23500000
.*                                                            @DQC0023  23550000
.DFAULT1 ANOP                          DEFAULT TO PERFORM= KEYWORD @L5A 23600000
.VALID1  ANOP                          DEFAULT TO TYPE=BLOCK       @D3A 23650000
         IC    0,IRAC&SYSNDX+1         PUT CODE INTO REGISTER 0         23700000
         B     IRAB&SYSNDX             BRANCH AROUND CONSTANT           23750000
IRAC&SYSNDX DC AL2(&EVENTO)            SYSEVENT CODE                    23800000
         AGO   .OKID1                                          @ZA29015 23850000
.TYPE80  ANOP                          INDICATE SRVCLASS TYPE      @L5A 23900000
.TYPE01  ANOP                          INPUT BIT FOR TYPE=     @ZM49916 23950000
         ICM   0,3,IRAC&SYSNDX         INDICATE SYSEVENT TYPE  @G742PJC 24000000
         B     IRAB&SYSNDX             BRANCH AROUND CONSTANTS @ZA29015 24050000
IRAC&SYSNDX DC BL1'10000000'           MASK FOR TYPE= KEYWORD  @ZM49916 24100000
         DC    AL1(&EVENTO)            SYSEVENT CODE           @ZA29015 24150000
         AGO   .OKID1                                          @ZA29015 24200000
.TYPE40  ANOP                          INDICATE QUIESCE TYPE       @L5A 24250000
         ICM   0,3,IRAC&SYSNDX         INDICATE SYSEVENT TYPE      @L5A 24300000
         B     IRAB&SYSNDX             BRANCH AROUND CONSTANTS     @L5A 24350000
IRAC&SYSNDX DC BL1'01000000'           MASK FOR TYPE= KEYWORD      @L5A 24400000
         DC    AL1(&EVENTO)            SYSEVENT CODE               @L5A 24450000
         AGO   .OKID1                                              @L5A 24500000
.TYPE20  ANOP                          INDICATE RESUME TYPE        @L5A 24550000
         ICM   0,3,IRAC&SYSNDX         INDICATE SYSEVENT TYPE      @L5A 24600000
         B     IRAB&SYSNDX             BRANCH AROUND CONSTANTS     @L5A 24650000
IRAC&SYSNDX DC BL1'00100000'           MASK FOR TYPE= KEYWORD      @L5A 24700000
         DC    AL1(&EVENTO)            SYSEVENT CODE               @L5A 24750000
         AGO   .OKID1                                              @L5A 24800000
.TYPEGENERATED1 ANOP     Type constant generated elsewhere     @WLMPESM 24850000
         ICM   0,3,IRAC&SYSNDX         INDICATE SYSEVENT TYPE  @WLMPESM 24900000
         B     IRAB&SYSNDX             BRANCH AROUND CONSTANTS @WLMPESM 24950000
IRAC&SYSNDX DC AL1(&TYPE)              Value of TYPE= KEYWORD  @WLMPESM 25000000
         DC    AL1(&EVENTO)            SYSEVENT CODE           @WLMPESM 25050000
         AGO   .OKID1                                          @WLMPESM 25100000
.* ---------------------------------------------------------            25150000
.IC2     AIF   ('&TYPE'EQ'NOSWIN'AND'&EVENT'EQ'MEMDEL').TYPE02 @ZA29015 25200000
         AIF   ('&TYPE'EQ'INTERVAL'AND'&EVENT'EQ'REQPGDAT').TYPE02      25250000
         ANOP                          ADDED REQPGDAT OPTION   @ZM49916 25300000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'STGTEST').VALID2          @D3A 25350000
         AIF   ('&TYPE'EQ'BYTE'AND'&EVENT'EQ'STGTEST').TYPE02      @D3A 25400000
         AIF   ('&TYPE'NE'BLOCK'AND'&EVENT'EQ'STGTEST').ERROR7     @D3A 25450000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'RESETPG').DFAULT2         @L5A 25500000
         AIF   ('&TYPE'EQ'SRVCLASS'AND'&EVENT'EQ'RESETPG').TYPE82  @L5A 25550000
         AIF   ('&TYPE'EQ'QUIESCE'AND'&EVENT'EQ'RESETPG').TYPE42   @L5A 25600000
         AIF   ('&TYPE'EQ'RESUME'AND'&EVENT'EQ'RESETPG').TYPE22    @L5A 25650000
         AIF   ('&TYPE'NE'PGN'AND'&EVENT'EQ'RESETPG').ERROR8       @L5A 25700000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'WLMBP').TYPEREQUIRED           25750000
.*                                                            @WLMPBPM  25800000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'WLMBP').TYPEGENERATED2         25850000
.*                                                            @WLMPBPM  25900000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'EVENT104').TYPEREQUIRED        25950000
.*                                                            @WLMPESM  26000000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'EVENT104').TYPEGENERATED2      26050000
.*                                                            @WLMPESM  26100000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'WLMQUEUE').TYPEREQUIRED        26150000
.*                                                            @WLMPESM  26200000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'WLMQUEUE').TYPEGENERATED2      26250000
.*                                                            @WLMPESM  26300000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'ENCASSOC').TYPEREQUIRED        26350000
.*                                                            @WLMPESM  26400000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'ENCASSOC').TYPEGENERATED2      26450000
.*                                                            @WLMPESM  26500000
.*       Default ENQHOLD and ENQRELSE to TYPE=NoWorkUnitInfo  @WLMPESM1 26550000
.*       for compatibility with earlier releases              @WLMPESM1 26600000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'ENQHOLD').DFAULT2    @WLMPESM1 26650000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'ENQHOLD').TYPEGENERATED2       26700000
.*                                                            @WLMPESM1 26750000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'ENQRLSE').DFAULT2    @WLMPESM1 26800000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'ENQRLSE').TYPEGENERATED2       26850000
.*                                                            @WLMPESM1 26900000
.*       Default ENCCREAT to TYPE=Independent                 @DQC0023  26950000
.*       for compatibility with earlier releases              @DQC0023  27000000
         AIF   ('&TYPE'EQ''AND'&EVENT'EQ'ENCCREAT').DFAULT2   @DQC0023  27050000
         AIF   ('&TYPE'NE''AND'&EVENT'EQ'ENCCREAT').TYPEGENERATED2      27100000
.*                                                            @DQC0023  27150000
.DFAULT2 ANOP                          DEFAULT TO PERFORM= KEYWORD @L5A 27200000
.VALID2  ANOP                          DEFAULT TO TYPE=BLOCK       @D3A 27250000
         AGO   .OKID3                                          @G742PJC 27300000
.TYPE82  ANOP                          INDICATE SRVCLASS TYPE      @L5A 27350000
.TYPE02  ANOP                                                  @ZA29015 27400000
         ICM   0,2,IRAC&SYSNDX         INDICATE SYSEVENT TYPE  @ZA29015 27450000
         B     IRAB&SYSNDX             BRANCH AROUND CONSTANTS @ZA29015 27500000
IRAC&SYSNDX DC BL1'10000000'           MASK FOR TYPE= KEYWORD  @ZA29015 27550000
         ANOP                          ADDED REQPGDAT OPTION   @ZM49916 27600000
            DC BL1'00000000'           RESERVED                @ZA29015 27650000
         AGO   .OKID1                                              @L5A 27700000
.TYPE42  ANOP                          INDICATE QUIESCE TYPE       @L5A 27750000
         ICM   0,2,IRAC&SYSNDX         INDICATE SYSEVENT TYPE      @L5A 27800000
         B     IRAB&SYSNDX             BRANCH AROUND CONSTANTS     @L5A 27850000
IRAC&SYSNDX DC BL1'01000000'           MASK FOR TYPE= KEYWORD      @L5A 27900000
            DC BL1'00000000'           RESERVED                    @L5A 27950000
         AGO   .OKID1                                              @L5A 28000000
.TYPE22  ANOP                          INDICATE RESUME TYPE        @L5A 28050000
         ICM   0,2,IRAC&SYSNDX         INDICATE SYSEVENT TYPE      @L5A 28100000
         B     IRAB&SYSNDX             BRANCH AROUND CONSTANTS     @L5A 28150000
IRAC&SYSNDX DC BL1'00100000'           MASK FOR TYPE= KEYWORD      @L5A 28200000
            DC BL1'00000000'           RESERVED                    @L5A 28250000
         AGO   .OKID1                                          @WLMPESM 28300000
.TYPEGENERATED2 ANOP   Type constant generated elsewhere       @WLMPESM 28350000
         ICM   0,2,IRAC&SYSNDX         INDICATE SYSEVENT TYPE  @WLMPESM 28400000
         B     IRAB&SYSNDX             BRANCH AROUND CONSTANTS @WLMPESM 28450000
IRAC&SYSNDX DC AL1(&TYPE)              Value of TYPE= KEYWORD  @WLMPESM 28500000
            DC BL1'00000000'           RESERVED                @WLMPESM 28550000
         AGO   .OKID1                                          @WLMPESM 28600000
.OKID1   ANOP                                                           28650000
IRAB&SYSNDX EQU *                                                       28700000
.OKID3   AIF       ('&ENTRY'EQ'BRANCH').BR                     @ZA29015 28750000
         AIF       ('&EVENTO'EQ'5').DEFBR                      @G860P26 28800000
         AIF       ('&EVENTO'EQ'50'OR'&EVENTO'EQ'51').DEFBR    @G860P26 28850000
         AIF       ('&EVENTO'EQ'53'OR'&EVENTO'EQ'54').DEFBR    @G742PJC 28900000
         AIF       ('&EVENTO'EQ'56'OR'&EVENTO'EQ'57').DEFBR    @YA08835 28950000
         AIF       ('&EVENTO'EQ'58').DEFBR                         @L5A 29000000
         AIF       ('&EVENTO'EQ'60'OR'&EVENTO'EQ'55').DEFBR    @G744PJC 29050000
         AIF       ('&EVENTO'EQ'62').DEFBR                     @YA08835 29100000
         AIF       ('&EVENTO'EQ'64').DEFBR                         @L7C 29150000
         AIF       ('&EVENTO'EQ'66'OR'&EVENTO'EQ'67').DEFBR        @H4A 29200000
         AIF       ('&EVENTO'EQ'68'OR'&EVENTO'EQ'69').DEFBR        @H4A 29250000
         AIF       ('&EVENTO'EQ'73'OR'&EVENTO'EQ'76').DEFBR        @D2C 29300000
         AIF       ('&EVENTO'EQ'77').DEFBR                         @L2A 29350000
         AIF       ('&EVENTO'EQ'80').DEFBR                         @L4A 29400000
         AIF       ('&EVENTO'EQ'81').DEFBR                         @L5A 29450000
         AIF       ('&EVENTO'EQ'83'OR'&EVENTO'EQ'84').DEFBR        @L5A 29500000
         AIF       ('&EVENTO'EQ'86').DEFBR                         @L5A 29550000
         AIF       ('&EVENTO'EQ'87'OR'&EVENTO'EQ'88').DEFBR        @L6A 29600000
         AIF       ('&EVENTO'EQ'89').DEFBR                         @L8A 29650000
         AIF       ('&EVENTO'EQ'101').DEFBR                        @P2A 29700000
         AIF       ('&EVENTO'EQ'102').DEFBR                    @WLMPBPM 29750000
         AIF       ('&EVENT'EQ'WLMBP').DEFBR                   @WLMPBPM 29800000
         AIF       ('&EVENT'EQ'WLMQUEUE').DEFBR                @WLMPESM 29850000
         AIF       ('&EVENT'EQ'ENCASSOC').DEFBR                @WLMPESM 29900000
         AIF       ('&EVENT'EQ'SCTCNV').DEFBR                  @WLMPBAT 29950000
         AIF       ('&EVENT'EQ'FREEAUX').DEFBR                 @OW34477 30000000
         AIF       ('&ENTRY'EQ'SVC').SVC                       @G742PJC 30050000
         AIF       ('&ENTRY'NE'').ERROR5                       @G742PJC 30100000
.SVC     SVC   95                      SYSTEM RESOURCES MANAGER SVC     30150000
         MEXIT                                                          30200000
.BR      ANOP                                                           30250000
         AIF   ('&FIPDISP'NE'99').FASTBR                       @G50IPSS 30300000
         L     15,CVTPTR(,0)           SYSTEM CVT ADDRESS               30350000
         L     15,CVTOPTE-CVT(,15)     SYSTEM RESOURCES MANAGER ENTRY   30400000
         BALR  14,15                   INVOKE SYSTEM RESOURCES MANAGER  30450000
         MEXIT                                                          30500000
.FASTBR  ANOP                                                  @G50IPSS 30550000
         L     15,CVTPTR(,0)          SYSTEM CVT ADDRESS       @G50IPSS 30600000
         L     15,CVTSRM-CVT(,15)     SRM ENTRY TABLE          @G50IPSS 30650000
         L     &SYSER.,&FIPDISP.(,15) SYSEVENT ENTRY ADDRESS       @D1C 30700000
         AIF   ('&SYSER'NE'14').FBRNEW                             @D1A 30750000
         L     15,0(,15)              MAIN ENTRY POINT         @G50IPSS 30800000
         BALR  14,14                  INVOKE SRM               @G50IPSS 30850000
         MEXIT                                                 @G50IPSS 30900000
.FBRNEW  BASSM 14,15                  INVOKE SRM                   @D1A 30950000
         MEXIT                                                     @D1A 31000000
.DEFBR   AIF   ('&ENTRY'NE'').ERROR6                           @G742PJC 31050000
         AGO          .BR                                      @G742PJC 31100000
.ERROR1  MNOTE     4,'***  IRA001  INVALID SYSEVENT MNEMONIC NAME OPERAX31150000
               ND -                &EVENT  ***'                         31200000
         MEXIT                                                          31250000
.ERROR2  MNOTE     8,'***  IRA002  INVALID ASID OPERAND SPECIFICATION -X31300000
                                   &ASID  ***'                          31350000
         MNOTE     *,'             USE ASIDL KEYWORD WHEN THE ASID VALUX31400000
               E                   IS NOT CONTAINED IN A REGISTER'      31450000
         MEXIT                                                          31500000
.ERROR3  MNOTE     8,'***  IRA003  INVALID ASIDL OPERAND SPECIFICATION X31550000
               -                   &ASIDL  ***'                         31600000
         MNOTE     *,'             USE ASID KEYWORD IF THE ASID VALUE IX31650000
               S                   PROVIDED IN A REGISTER'              31700000
         MEXIT                                                          31750000
.ERROR4  MNOTE     8,'***  IRA004  ASID AND ASIDL PARAMETERS ARE       X31800000
                                   MUTUALLY EXCLUSIVE  ***'             31850000
         MEXIT                                                          31900000
.ERROR5  MNOTE     4,'***  IRA005  INVALID ENTRY TYPE - SVC ASSUMED  **X31950000
               *'                                                       32000000
         AGO       .SVC                                                 32050000
.ERROR6  MNOTE     4,'***  IRA006  INVALID ENTRY TYPE - BRANCH ASSUMED X32100000
               ***'                                            @G742PJC 32150000
         AGO   .BR                                             @G742PJC 32200000
.ERROR7  MNOTE     8,'***  IRA007  INVALID TYPE SPECIFICATION FOR STGTEX32250000
               ST SYSEVENT    ***'                                 @D3A 32300000
         MEXIT                                                          32350000
.ERROR8  MNOTE     8,'***  IRA008  INVALID TYPE SPECIFICATION FOR RESETX32400000
               PG SYSEVENT    ***'                                 @L5A 32450000
         MEXIT                                                          32500000
.TYPEREQUIRED ANOP                                             @WLMPESM 32550000
.ERROR9  MNOTE     8,'***  IRA009  TYPE REQUIRED FOR THIS SYSEVENT     X32600000
                              ***'                             @WLMPESM 32650000
         MEXIT                                                 @WLMPESM 32700000
         MEND                                                           32750000
