*    %GOTO MTABPRO  ; /* BEGIN COMMENT UNTIL LABLE MTABPRO                      
         MACRO                                                                  
         TCOMTAB                                                                
.*/ %MTABPRO: ;                                                                 
*        %GOTO MTABLBL  ;                                                       
TCOM     DSECT                DSECT FOR TCOMTAB PREFIX AREA    @E2115B8         
TCOMPREF DS    0F  -          TCOMTAB PREFIX                   @E2115B8         
TCOMID   DS    CL8 -          TCOMTAB IDENTIFIER: 'TCOMTAB'    @E2115B8         
TCOMPREL EQU   *-TCOMPREF     LENGTH OF TCOMTAB PREFIX         @E2115B8         
         SPACE 1                                               @E2115B8         
TCOMTAB  DSECT                                                                  
         SPACE 1                                                                
***********************************************************************         
* Start of specifications                                             *         
*                                                                     *         
*  PROPRIETARY STATEMENT=                                             *         
*  **PROPRIETARY_STATEMENT*********************************************         
*                                                                     *         
*                                                                     *         
*   LICENSED MATERIALS - PROPERTY OF IBM                              *         
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                       *         
*   5685-025 (C) COPYRIGHT IBM CORP. 1982, 1992                       *         
*   SEE COPYRIGHT INSTRUCTIONS                                        *         
*                                                                     *         
*   STATUS= HTE24D2                                                   *         
*                                                                     *         
*  **END_OF_PROPRIETARY_STATEMENT**************************************         
*                                                                     *         
* Descriptive name: Test Command Processor Communication Table        *         
* Macro name: TCOMTAB                                                 *         
* Acronym: TCOMTAB                                                    *         
* Dsect name: TCOMTAB                                                 *         
* Component: TSO/E TEST (28503)                                       *         
* Eye catcher: TCOMTAB                                                *         
*         offset: 00                                                  *         
*         length: 08                                                  *         
* Storage attributes:                                                 *         
*    main storage:     N/A                                            *         
*    virtual storage:      N/A                                        *         
*    auxiliary storage:        N/A                                    *         
*    subpool: 78                                                      *         
*    key    : 08                                                      *         
*    data space: none                                                 *         
*    residency: above 16mB                                            *         
* Size: approx 200 bytes                                              *         
* Created by: IGC0009G on request by IKJEGINT                         *         
* Method of access:                                                   *         
*                   ASM = by macro invocation                         *         
*                   PLS = by percent include                          *         
* Pointed to by: GPR 09                                               *         
* Serialization: None                                                 *         
*                                                                     *         
*01* External Classification:                                                   
*02* DMTI: BASE                                                                 
*02* GUPI: FIELDS                                                               
*          INBUF TPLPTR TSTECT TSTUPT                                           
*01* End of External Classification:                                            
*                                                                               
*                                                                     *         
* Function:                                                           *         
*        This macro maps the TEST command processor communication     *         
*        table (TCOMTAB) used by all subcommand processors and        *         
*        service routines which make up the TSO/TEST command.         *         
*                                                                     *         
*                                                                     *         
*   CHANGE ACTIVITY:                                          @E2115B8*         
*                   E2115B8 - JBB2115 TSO/E FOR MVS/XA        @E2115B8*         
*OZ92954 ADD BIT TELLING IKJEGATN TO BYPASS ATTENTION PROCESSING      *         
*                                                             @ZA92954*         
*                   E1402C4 - HTE1402 TSO/E RELEASE 4 VECTOR  @E1402C4*         
*                             ARCHITECTURE ENHANCEMENTS.      @E1402C4*         
*    E21D2MP - HTE21D2 TSO/E Version 2 Release 1 PARMLIB              *         
*              Support.                                       @E21D2MP*         
*    E21D2XX - HTE21D2 TSO/E Version 2 Release 1 for                  *         
*              MVS SP 3 Architecture Enhancements.            @E21D2XX*         
*    PEI0136 - Loss of Exit Command and SubCommand User Word          *         
*              Key and Length data.                           @PEI0136*         
*    PEI0170 - Add pointer to E-type opcode table ("01")      @PEI0170*         
*    PEI0220 - Footprinting                                   @PEI0220*         
*    PEI0431 - Area for original INBUF to be saved in         @PEI0431*         
*    PEI0661 - RUN processing completed flag added            @PEI0661*         
*    PEI0810 - Add a flag to signify that the condition       @PEI0810*         
*              code must be saved.                            @PEI0810*         
*  OY13125 - ADD FIELD TO SAVE THE PSW CC FOR IKJEGLDF AND            *         
*            ADD BIT TO INDICATE TO SVC97 TO RESTORE PSWCC.           *         
*            See PEI0810 line flags.                          @YA13125*         
*  PHN0013 - Add pointer to E5 opcode table                   @PHN0013*         
*  OY16440 - ADD BIT FOR LIST PROCESSING THAT WILL INDICATE THAT      *         
*            IGC0009G ROUTINE VALIDCHK WILL BE INVOKED TO CHECK THE   *         
*            BEGINNING AND END ADDRESS OF THE RANGE USED BY           *         
*            IKJEGLST'S LSTBPT ROUTINE.  ALSO ADD TWO WORDS FOR USE   *         
*            BY IKJEGLST FOR WORKAREAS.                       @YA16440*         
*  PHN0041 - Remove unwanted (extra) lines                    @PHN0041*         
*  PHN0042 - Remove extra field                               @PHN0042*         
*  E23D2D9 - ENHANCEMENT FOR APPC TEST                        @E23D2D9*         
*              1. ADD TREQACTV (TEST REQUEST ACTIVE) BIT      @E23D2D9*         
*              2. ADD TKEEPTP  (WHETHER TO KEEP TP) BIT       @E23D2D9*         
*              3. ADD TSTMNLW2 (POINTER TO IKJEGMNL WORKAREA) @E23D2D9*         
*  E24D2B1 - 2.4.0 PDSE load module support                   @E24D2B1*         
*  PMH0149 - Add a flag for Initialization exit invoked       @PMH0149*         
*  PMH0160 - Added CDPI information to prolog                 @PMH0160*         
*                                                                     *         
* End of specifications                                               *         
***********************************************************************         
         SPACE 1                                                                
ECBPP    DS    A -            PP DISPATCHABILITY ECB.                           
         SPACE 1                                                                
ECBLIST  EQU   * -            BEGINNING OF ECBLIST FOR WAIT.                    
ECBTST   DS    A -            PTR TO TEST DISPATCHABILITY ECB.                  
ECBTERM  DS    A -            PTR TO PP TERMINATION ECB.                        
ECBTMPS  DS    A -            PTR TO STAI ECB.                                  
ECBTMPA  DS    A -            PTR TO ATTENTION ECB.                             
         SPACE 1                                                                
ECBLOG   DS    A -            PTR TO STOP/MODIFY ECB.                           
         SPACE 1                                                                
TSTTCB   DS    A -            PTR TO THE TEST TCB.             @E2115B8         
         SPACE 1                                                                
PPTCB    DS    A -            PTR TO THE PROBLEM PROGRAM TCB.  @E2115B8         
IBMCTAB  DS    A -            PTR to the IBM command table.    @E21D2C6         
USRCTAB  DS    A -            PTR to the User command table.   @E21D2C6         
         SPACE 1                                                                
OUTBUF   DS    A -            PTR TO GENERAL OUTPUT BUFFER.                     
OUTBUFRL EQU   256 -          LENGTH OF OUTPUT BUFFER.                          
BLDLAREA DS    0A -           ADDRESS OF BLDL ENTRY USED BY                     
*                             IKJEGINT AND IKJEGLDR.                            
CONAREA  DS    A -            PTR TO OUTPUT AREA USED BY CONVERT RTN.           
CONAREAL EQU   72 -           LENGTH OF CONVERT WORK AREA.                      
WORKAREA DS    A -            PTR TO GENERAL WORK AREA.                         
REGSAVEL EQU   72*6 -         LENGTH OF 6 REGISTER SAVE AREAS.                  
REGSAVE1 DS    A -            PTR TO SAVE AREA FOR MAINLINE.                    
REGSAVE2 DS    A -            PTR TO SAVE AREA FOR COMMANDS.                    
REGSAVE3 DS    A -            PTR TO SAVE AREA FOR VALIDITY CHECKERS.           
REGSAVE4 DS    A -            PTR TO SAVE AREA FOR IKJEGCVT.                    
REGSAVE5 DS    A -            PTR TO SAVE AREA FOR IKJEGIO.                     
REGSAVE6 DS    A -            PTR TO SAVE AREA FOR IKJEGSRH.                    
TSTIODSL DS    H -            LTH OF IKJEGIO DSNAM QUE ELEMENT @E2115B8         
TSTDCBL  DS    H -            LTH OF DCB USED BY IKJEGIO       @E2115B8         
         SPACE 1                                                                
TPLPTR   DS    A -            PTR TO TPL                                        
TMPLL    DS    H -            LINE LENGTH                                       
         DS    X -            *** RESERVED SPACE ***           @E2115B8         
TSTESTRC DS    X -            ESATE ERROR RETURN CODE                           
TSTWHR   DS    A -            PTR TO COMMAND LIB DCB.                           
         SPACE 1                                                                
PARMLIST DS    0F -           PARM LIST FOR CALLING SERVICE ROUTINES            
TSTUPT   DS    A -            PTR TO UPT                                        
TSTECT   DS    A -            PTR TO ECT                                        
TSTCPECB DS    A -            PTR TO CP ECB                                     
         SPACE 1                                                                
TSTANSPL DS    A -            ANSWER PLACE FOR PARSE SERVICE ROUTINE.           
         SPACE 1                                                                
TSTVSMAD DS    A -            ADDRESS OF AREA REQUIRED FOR     @E2115B8         
*                              VSMLIST INVOCATIONS             @E2115B8         
TSTVSML  DS    A -            LENGTH OF AREA PASSED TO VSMLIST @E2115B8         
TSTRTYCD DS    X -            SUBCOMMAND ID.                                    
TSTPSWCC DS    X              Problem programs condition code  @PEI0810         
         DS    CL2            *** Reserved space ***           @PEI0810         
         SPACE 1                                                                
INBUF    DS    A -            PTR TO BUFFER CONTAINING SUBCMD                   
TSTIODSN DS    A -            HEAD OF DSNAME CHAIN FOR IKJEGIO 'PRINT'.         
TSTIO    DS    A -            ENTRY POINT OF GET ROUTINE IKJEGIO.               
TSTFLGSX DS    0X -           ADDITIONAL WORD FOR TEST FLAGS.  @E2115B8         
TSTAMODE DS    X -            IF HIGH OEDER BIT IS ON THEN     @E2115B8         
*                                TESTED PROGRAM IS IN 31-BIT   @E2115B8         
*                                ADDRESSING MODE.              @E2115B8         
TSTFLGSA DS    X -            RESERVED FOR TEST FLAGS          @E2115B8         
RUNSW2   EQU   B'10000000'    RUN processing complete          @PEI0661         
TSTLOOP  EQU   B'01000000'    BIT TO INDICATE THAT IKJEGLST IS                  
*                          VALIDITY CHECKING AN ADDRESS RANGE  @YA16440         
TREQACTV EQU   B'00100000'    REGISTER_TP call made and inbound                 
*                             attach request has not been     @E23D2D9          
*                             intercepted                     @E23D2D9          
TREQAOFF EQU   B'11011111'    used to turn off TREQACTV       @E23D2D9          
TKEEPTP  EQU   B'00010000'    should keep the TP when end or abend              
*                                                             @E23D2D9          
TSTFLGSB DS    X -            RESERVED FOR TEST FLAGS          @E2115B8         
TSTFLGSC DS    X -            RESERVED FOR TEST FLAGS          @E2115B8         
         SPACE 2                                               @E2115B8         
         DS    A -            RESERVED                                          
TSTCONVT DS    A -            ENTRY POINT OF IKJEGCVT.                          
TSTADDR  DS    A -            ENTRY POINT OF ADDRESS BUILD SUBROUTINE.          
TSTSTAE  DS    A -            ENTRY POINT OF STAE EXIT RTN. (IKJEGSTA).         
         SPACE 2                                                                
TSTFLGS  DS    0X -           NAME FOR 4 BYTES OF FLAGS        @E2115B8         
TSTFLGS1 DS    X -            TEST FLAGS, BYTE 1.                               
         SPACE 1                                                                
PCHLSTVL EQU   B'10000000' -  PATCH LIST SWITCH.                                
FORGOUSE EQU   B'01000000' -  USED BY IKJEGGO ONLY             @E211533         
TSTPRINT EQU   B'00100000' -  PRINT SWITCH.                                     
TSTFIRST EQU   B'00010000' -  FIRST TIME SWITCH.                                
RANGESW  EQU   B'00001000' -  INDICATES PDE IS FOR ADDRESS RANGE.               
TSTBUILD EQU   B'00000100' -  'AT' SWITCH FOR DEFER CHECK.                      
ENDSW    EQU   B'00000010' -  INDICATES 'END' TO MAINLINE.                      
RUNSW    EQU   B'00000001' -  INDICATES 'RUN' TO MAINLINE.                      
         SPACE 2                                                                
TSTFLGS2 DS    X -            TEST FLAGS, BYTE 2.                               
         SPACE 1                                                                
TSTLDF   EQU   B'10000000' -  IKJEGLDF TASK-SWITCH INDICATOR.                   
TSTXCTL  EQU   B'01000000' -  STAE XCTL INDICATOR.                              
TOFFDEF  EQU   B'00100000' -  NO ACTIVE BREAKPOINTS.                            
TSTLDFX  EQU   B'00010000' -  ALET Addr checking or operation  @E21D2C6         
TADDROUT EQU   B'00001000' -  LOAD MODULE FOUND UNDER TCB.                      
TWHRLOAD EQU   B'00000100' -  VALID LOAD MODULE CHECK.                          
TSTQUAL  EQU   B'00000010' -  QUALIFICATION IS IN PROCESS                       
TMYIOMSG EQU   B'00000001' -  IKJEGIO MESSAGE SWITCH.                           
         SPACE 2                                                                
TSTFLGS3 DS    X -            TEST FLAGS, BYTE 3.                               
         SPACE 1                                                                
TSTGOSW  EQU   B'10000000' -  SPECIAL BREAKPOINT TYPE SWITCH.                   
TSTSTAI  EQU   B'01000000' -  PROBLEM PROGRAM ABEND INDICATOR.                  
SYMMESG  EQU   B'00100000' -  SYM 'NO DIAGNOSTIC' SWITCH.                       
TCSECTCK EQU   B'00010000' -  CSECT ONLY DEFER QUEUE CLEAR.                     
TDUPNAME EQU   B'00001000' -  DEFER QUEUE DUPLICATE NAME BIT.                   
TSTLINK  EQU   B'00000100' -  SUB-CMD 'LINK FAILED' INDICATOR.                  
TSTHELP  EQU   B'00000010' -  INDICATES THAT TSO COMMAND IS    @E2115B8         
*                             ATTACHED BY TEST.                @E2115B8         
TSTTSOC  EQU   B'00000010' -  INDICATES THAT TSO COMMAND IS    @E2115B8         
*                             ATTACHED BY TEST.                @E2115B8         
NOPARMS  EQU   B'00000001' -  INDICATES NO PARAMETERS WITH COMMAND.             
         SPACE 2                                                                
TSTFLGS4 DS    X              TEST FLAGS, BYTE 4.                               
         SPACE 1                                                                
TSTA     EQU   B'10000000' -  TEST'S INPUT IS NOT FROM A STACK.                 
TSTB     EQU   B'01000000' -  A STACKED TERMINAL ELEM. IS PRESENT.              
TSTFLUSH EQU   B'00100000' -  FORCE TCLEARQ AND POSSIBLE STACK FLUSH.           
TSTRERTN EQU   B'00010000' -  A RETRY IS IN PROCESS                             
TSTESTAE EQU   B'00001000' -  ESTAE IS INVOKING I/O FOR MESSAGE                 
TSTSVCAB EQU   B'00000100' -  SVC ABEND IS IN PROCESS                           
TSTPERC  EQU   B'00000010' -  THIS RETRY ROUTINE WAS PERCOLLATED TO             
TSTVALCK EQU   B'00000001' -  INDICATES PARSE VALIDITY CHECK IN PROCESS         
         SPACE 2                                                                
BREAKTAB DS    A -            PTR TO FIRST BREAK ELEMENT.                       
DEFERTAB DS    A -            PTR TO DEFER'ED CMD LIST                          
PPLOAD   DS    A -            PTR TO CURRENT BASE FOR RELATIVES.                
PPTEMP   DS    A -            TEMPORARY BASE FOR RELATIVES.                     
SUBCHAIN DS    A -            PTR TO BREAKPOINT SUBCOMMAND CHAIN.               
         SPACE 1                                                                
TSTGO    DS    0X -           RESUME ADDRESS AFTER BREAKPOINT.                  
TSTGOPSW DS    F -            SECOND WORD OF RBOPSW FIELD.                      
TSTGOWCF DS    X -            WAIT COUNT FROM RBWCF FIELD.                      
TSTFLGS5 DS    X -            TEST FLAGS, BYTE 5.             @ZA92954          
SKIPATTN EQU   B'10000000' -  BYPASS ATTENTION PROCESSING     @ZA92954          
TSTNOALT EQU   B'01000000' -  Suppress ALET on an address     @E21D2C6          
TSTALETY EQU   B'00100000' -  ALET associated with address    @E21D2C6          
TSTMSGL2 EQU   B'00010000' -  Bypass message for next occurrence of             
*                             conversion of an address in CVT @E21D2C6          
TSTSYMAL EQU   B'00001000' -  ALET Associated with symbol     @E21D2C6          
TSTRESCC EQU   B'00000100' -  Restore the problem programs CC @PEI0810          
TSTFOUND EQU   B'00000010' -  Command found flag              @E21D2C6          
TSTPARM  EQU   B'00000001' -  Parmlib support is enabled      @E21D2C6          
TSTSVC   DS    H -            AN SVC 97 INSTRUCTION (0A61).                     
PPRB     DS    A -            CURRENT PROBLEM PROGRAM RB ADDRESS.               
         SPACE 1                                                                
TSTIODCB DS    A -            PTR TO OPEN PRINT DCB.                            
CALLPARM DS    A -            HEAD OF CHAIN FOR PARMS BUILT BY 'CALL'.          
         DS    A -            *** RESERVED SPACE ***                            
INTSTDDN DS    0CL8           DDNAME FOR DATA SET SPECIFIED ON THE TEST         
*                             COMMAND - USED BY IKJEGINT AND IKJEGLDR.          
TSTCURLD DS    CL8 -          CURRENTLY QUALIFIED LOAD NAME.                    
TERMDD   DS    0CL8 -         DDNAME FOR TERMINAL USED BY OS LOADER.            
TSTCURCT DS    CL8 -          CURRENTLY QUALIFIED CSECT NAME.                   
TSTSYMBA DS    A -            CURRENTLY QUALIFIED SYMBOLIC ADDR BASE.           
TSTTRN   DS    A -            HEAD OF SAVE INFORMATION CHAIN                    
SICHAIN  DS    A -            HEAD OF SYMBOL INFORMATION CHAIN                  
TSTSYMWK DS    A -            PTR TO SYMBOL PROCESSING WORK AREA.               
SYMTABLE DS    A -            PTR TO IN-CORE SYMBOL TABLE.                      
         SPACE 1                                                                
PPEXIT   DS    0A -           BREAKPOINT & EXIT SVC'S FOR PP TERM.              
PPEXIT1  DS    H -            AN SVC 97 INSTRUCTION (0A61).                     
PPEXIT2  DS    H -            AN SVC 3 INSTRUCTION (0A03).                      
TSTDCB   DS    A -            HEAD OF OVLY DCB CHAIN.                           
OPCODTAB DS    A -            PTR TO TABLE OF VALID OPERATION CODES.            
TSTOPCD2 DS    F -            PTR TO TABLE FOR TWO BYTE S/370                   
*                             OPERATION CODES.                                  
TSTCADDR DS    A -            CURRENT ADDRESS BEING VALIDITY   @YA16440         
*                         CHECKED BY IKJEGLST 'LSTBPT' ROUTINE @YA16440         
TSTOPCD3 DS    A -            Address of E5 Opcode table       @PHN0013         
TSTHTCB  DS    0A -           POINTER TO THE TCB FOR ATTACHED  @E2115B8         
*                             TSO COMMAND.                     @E2115B8         
TSTOTCB  DS    A -            POINTER TO THE TCB FOR ATTACHED  @E2115B8         
*                             TSO COMMAND.                     @E2115B8         
TSTAQUAL DS    CL8 -          AUTOMATIC QUALIFICATION          @E2115B8         
*                             CONTROL                          @E2115B8         
TSTAQEP  DS    A -            ENTRY POINT OF LOAD MODULE.                       
TSTRSTRT DS    A -            RESTART ADDRESS FOR STAE PROCESSING               
TSTSRHRT DS    A -            ADDRESS OF RESIDENT ADDRESS VALIDITY              
*                             CHECK ROUTINE.                                    
         SPACE 1                                                                
TSTSTAX  DS    5F -           STAX PARAMETER LIST.                              
TSTDSECB DS    F -            TEST DISPATCHABILITY ECB.                         
TSTMNLWK DS    14F -          WORK AREA FOR EXCULSIVE USE    @E2115B8           
*                             OF MNL                         @E2115B8           
TSTIOPRM DS    CL84           IO PARAMETER BLOCK USE BY SIO                     
TSTSVCM1 DS    F              SVC FIRST LEVEL MESSAGE NO.                       
TSTSVCM2 DS    F              SVC SECOND LEVEL MESSAGE NO.                      
TSTOPCD4 DS    A              ADDRESS OF A4 OPCODE TABLE     @E1402C4           
TSTOPCD5 DS    A              ADDRESS OF A5 OPCODE TABLE     @E1402C4           
TSTOPCD6 DS    A              ADDRESS OF A6 OPCODE TABLE     @E1402C4           
ABNDTCB  DS    F              ABENDING TCB ADDR              @E2115B8           
TSTECTSV DS    14F            ECT SAVE AREA.                 @E2115B6           
TSTOPCD7 DS    A              ADDRESS OF E4 OPCODE TABLE     @E1402C4           
TSTVPARM DS    0F             VECTOR FACILITY PARAMETERS     @E1402C4           
TSTVSS   DS    H              VECTOR SECTION SIZE            @E1402C4           
TSTVPS   DS    H              VECTOR PARTIAL SUM NUMBER      @E1402C4           
TSTALET1 DS    F              ALET value for address         @E21D2C6           
TSTALET2 DS    F              ALET value for second address of a range          
*                                                            @E21D2S6           
TSTMSGCD DS    0D             Message code fields            @E21D2S6           
TSTMSG1N DS    F              First Level message number     @E21D2S6           
TSTMSG2N DS    F              Second Level message number    @E21D2S6           
TSTEGARM DS    A              Address of IKJEGARM            @E21D2S6           
TSTEGCOM DS    A              Address of IKJEGCOM            @E21D2S6           
TSTEGAR1 DS    A              Address of IKJEGAR1            @E21D2B1           
TSTEGAR2 DS    A              Address of IKJEGAR2            @E21D2B1           
TSTEGAR3 DS    A              Address of IKJEGAR3            @E21D2B1           
TSTGEN   DS    F              Current Parmlib Generation #   @E21D2MP           
TSTCBLK  EQU   *              Address of pseudo-command block@E21D2MP           
TSTCBCL  DS    X              Length of command name = 8     @E21D2MP           
TSTCBCN  DS    CL8            Command name storage           @E21D2MP           
TSTCBAL  DS    X              Length of alias = 0            @E21D2MP           
TSTCBLN  DS    CL8            Load module name storage       @E21D2MP           
TSTCBCI  DS    X              Command ID storage             @E21D2MP           
         DS    X              *** Reserved space ***         @E21D2MP           
TSTTSOCD DS    A              Pointer to local copy of IKJEGTCT                 
*                                                            @E21D2C6           
TSTSUBCD DS    A              Pointer to local copy of IKJEGSCT                 
*                                                            @E21D2C6           
TSTTSOLN DS    H              Length of local copy of IKJEGTCT                  
*                                                            @E21D2C6           
TSTSUBLN DS    H              Length of local copy of IKJEGSCT                  
*                                                            @E21D2MP           
TSTPDECM DS    A              PDE ptr returned from prompt   @E21D2S6           
TSTALERC DS    F              ALET addr check RC             @E21D2S6           
TSTS9G01 DS    CL20           S9G macro workarea             @E21D2S6           
REGSAVE7 DS    A              Save area ptr                  @E21D2S6           
REGSAVE8 DS    A              Save area ptr                  @E21D2S6           
REGSAVE9 DS    A              Save area ptr                  @E21D2S6           
TSTFTPRT DS    CL48           TEST Footprint Area            @E21D2S6           
         ORG   TSTFTPRT                                      @E21D2S6           
TSTFTCUR DS    CL24           Current module                 @E21D2S6           
TSTFTOLD DS    CL24           Previous module                @E21D2S6           
TSTOPCD8 DS    A              Address of 01 OPcode table     @PEI0170           
TSTFTTMP DS    CL24           Footprint Temporary Save       @PEI0220           
TSTECOMB DS    F              Exit Command buffer pointer    @PEI0136           
TSTESUBB DS    F              Exit Sub Commnand buff pointer @PEI0136           
TSTUWENT DS   0F              Exit User Word Entry           @PEI0136           
TSTUWKEY DS    F              Exit Communication Word Key    @PEI0136           
TSTUWLEN DS    F              Exit Communication Word Length @PEI0136           
TSTUWORD DS    F              Exit Communication Word Data   @PEI0136           
TSTSWENT DS   0F              Exit SubCommand UserWord Entry @PEI0136           
TSTSWKEY DS    F              Exit SubCommand UserWord Key   @PEI0136           
TSTSWLEN DS    F              Exit SubCommand UserWord Len   @PEI0136           
TSTSWORD DS    F              Exit SubCommand UserWord Data  @PEI0136           
TSTORIGI DS    F              Original INBUF save area       @PEI0431           
TSTCPAGE DS    A -            CURRENT PAGE ADDRESS USED BY     @YA16440         
*                             IKJEGLST 'LSTBPT' ROUTINE        @YA16440         
TCOMTPID DS    CL8            TPID for the TPI being tested   @E23D2D9          
TSTMNLW2 DS    A              ADDR OF SECOND PART MNL WORK AREA                 
*                                                             @E23D2D9          
SMSPDSE  DS    CL8            PDSE STARTD/ENDD Token          @E24D2B1          
TSTFLGS6 DS    X -            TEST FLAGS, BYTE 6.             @PMH0149          
INITEINV EQU   B'10000000'    Init exit has been invoked      @PMH0149          
         DS    CL3            Reserved                        @PMH0149          
         DS    5F             *** Reserved space ***         @E21D2C6           
TCOMLTH  EQU   (*-TCOMTAB)+TCOMPREL       LENGTH OF TCOMTAB  @E2115B8           
*                                         INCLUDING PREFIX   @E2115B8           
         MEND                                                                   
**/                                                                             
* %MTABLBL :  ;                                                                 
* DECLARE                                                                       
*   1 TCOMTAB BASED BDY(WORD),                                                  
*/********************************************************************/         
*/*                                                                  */         
*/*      THIS MACRO MAPS THE TEST COMMAND PROCESSOR COMMUNICATION    */         
*/*      TABLE (TCOMTAB) USED BY ALL SUBCOMMAND PROCESSORS AND       */         
*/*      SERVICE ROUTINES WHICH MAKE UP THE TSO/TEST COMMAND.        */         
*/*                                                                  */         
*/*                                                                  */         
*/* CHANGE ACTIVITY --                                       @E2115B8*/         
*/*                 E2115B8 - JBB2115 TSO/E FOR MVS/XA       @E2115B8*/         
*/*OZ92954    ADD BIT TO TELL IKJEGATN TO BYPASS ATTENTION PROCESSING*/         
*/*                                                          @ZA92954*/         
*/*                 E1402C4 - HTE1402 TSO/E RELEASE 4 VECTOR @E1402C4*/         
*/*                           ARCHITECTURE ENHANCEMENTS.     @E1402C4*/         
*/*  E21D2MP - HTE21D2 TSO/E Version 2 Release 1 PARMLIB             */         
*/*            Support.                                      @E21D2MP*/         
*/*  E21D2XX - HTE21D2 TSO/E Version 2 Release 1 for                 */         
*/*            MVS SP 3 Architecture Enhancements.           @E21D2XX*/         
*/*  PEI0136 - Loss of Exit Command and SubCommand User Word         */         
*/*            Key and Length data.                          @PEI0136*/         
*/*  PEI0170 - Add pointer to E-type opcode table ("01")     @PEI0170*/         
*/*  PEI0220 - Footprinting                                  @PEI0220*/         
*/*  PEI0431 - Area for original INBUF to be saved in        @PEI0431*/         
*/*  PEI0661 - RUN processing completed flag added           @PEI0661*/         
*/*  PEI0810 - Add a flag to signify that the condition      @PEI0810*/         
*/*            code must be saved.                           @PEI0810*/         
*/*OY13125 - ADD FIELD TO SAVE THE PSW CC FOR IKJEGLDF AND           */         
*/*          ADD BIT TO INDICATE TO SVC97 TO RESTORE PSWCC.          */         
*/*          See PEI0810 line flags.                         @YA13125*/         
*/*PHN0013 - Add pointer to E5 opcode table                  @PHN0013*/         
*/*OY16440 - ADD BIT FOR LIST PROCESSING THAT WILL INDICATE THAT     */         
*/*          IGC0009G ROUTINE VALIDCHK WILL BE INVOKED TO CHECK THE  */         
*/*          BEGINNING AND END ADDRESS OF THE RANGE USED BY          */         
*/*          IKJEGLST'S LSTBPT ROUTINE.  ALSO ADD TWO WORDS FOR USE  */         
*/*          BY IKJEGLST FOR WORKAREAS.                      @YA16440*/         
*/*PHN0041 - Remove unwanted (extra) lines                   @PHN0041*/         
*/*E23D2D9 - TSO/E 2.3.0 APPC TEST ENABLEMENT SUPPORT        @D23D2D9*/         
*/*E24D2B1 - 2.4.0 PDSE load module support                   @E24D2B1*/        
*/*                                                                  */         
*/********************************************************************/         
*/*A-000000-999999                                           @ZA25414*/         
*     2 ECBPP       PTR(31),   /* PP DISPATCHABILITY ECB.            */         
*     2 ECBLIST,               /* BEGINNING OF ECBLIST FOR WAIT.     */         
*       3 ECBTST    PTR(31),   /* PTR TO TEST DISPATCHABILITY ECB.   */         
*       3 ECBTERM   PTR(31),   /* PTR TO PP TERMINATION ECB.         */         
*       3 ECBTMPS   PTR(31),   /* PTR TO STAE ECB.                   */         
*       3 ECBTMPA   PTR(31),   /* PTR TO ATTENTION ECB.              */         
*     2 ECBLOG      PTR(31),   /* PTR TO STOP/MODIFY ECB.            */         
*     2 TSTTCB      PTR(31),   /* PTR TO THE TEST TCB.               */         
*     2 PPTCB       PTR(31),   /* PTR TO THE PROBLEM PROGRAM TCB.    */         
*     2 IBMCTAB     PTR(31),   /* PTR to the IBM cmd table   @E21D2C7*/         
*     2 USRCTAB     PTR(31),   /* PTR to the User cmd table  @E21D2C7*/         
*     2 OUTBUF      PTR(31),   /* PTR TO GENERAL OUTPUT BUFFER.      */         
*     2 BLDLAREA    PTR(31),   /* ADDRESS OF BLDL ENTRY USED BY                 
*                                 IKJEGINT AND IKJEGLDR.             */         
*       3 CONAREA   PTR(31),   /* PTR TO OUTPUT AREA USED BY                    
*                                 CONVERT RTN.                       */         
*     2 WORKAREA    PTR(31),   /* PTR TO GENERAL WORK AREA.          */         
*     2 REGSAVE1    PTR(31),   /* PTR TO SAVE AREA FOR MAINLINE.     */         
*     2 REGSAVE2    PTR(31),   /* PTR TO SAVE AREA FOR COMMANDS.     */         
*     2 REGSAVE3    PTR(31),   /* PTR TO SAVE AREA FOR VALIDITY                 
*                                 CHECKERS.                          */         
*     2 REGSAVE4    PTR(31),   /* PTR TO SAVE AREA FOR IKJEGCVT.     */         
*     2 REGSAVE5    PTR(31),   /* PTR TO SAVE AREA FOR IKJEGIO.      */         
*     2 REGSAVE6    PTR(31),   /* PTR TO SAVE AREA FOR IKJEGSRH.     */         
*     2 TSTIODSL    FIXED(15), /* LENGTH OF IKJEGIO DSNAME QUEUE                
*                                                    ELEMENT @E2115B8*/         
*     2 TSTDCBL     FIXED(15), /* LENTH OF DCB USED BY IKJEGIO                  
*                                                            @E2115B8*/         
*     2 TPLPTR      PTR(31),   /* PTR TO TPL                         */         
*     2 TMPLL       FIXED(15), /* LINE LENGTH                        */         
*     2 *           FIXED(8),  /* *** RESERVED SPACE ***     @E2115B8*/         
*     2 TSTESTRC    FIXED(8),  /* ESTAE ERROR RETURN CODE            */         
*     2 TSTWHR      PTR(31),   /* PTR TO COMMAND LIB DCB.            */         
*     2 PARMLIST,              /* PARM LIST FOR CALLING SERVICE                 
*                                 ROUTINES.                          */         
*       3 TSTUPT    PTR(31),   /* PTR TO UPT.                        */         
*       3 TSTECT    PTR(31),   /* PTR TO ECT.                        */         
*       3 TSTCPECB  PTR(31),   /* PTR TO CP ECB.                     */         
*       3 TSTANSPL  PTR(31),   /* ANSWER PLACE FOR PARSE SERVICE                
*                                 ROUTINE.                           */         
*     2 TSTVSMAD    PTR(31),   /* ADDRESS OF AREA REQUIRED FOR                  
*                                 VSMLIST INVOCATIONS        @E2115B8*/         
*     2 TSTVSML     FIXED(31), /* LENGTH OF AREA PASSED TO VSMLIST              
*                                                            @E2115B8*/         
*     2 TSTRTYCD    FIXED(8),  /* SUBCOMMAND ID.             @E2115B8*/         
*     2 TSTPSWCC    CHAR(1),   /*The problem programs CC     @PEI0810*/         
*     2 *           CHAR(2),   /* *** Reserved Space ***     @PEI0810*/         
*     2 INBUF       PTR(31),   /* PTR TO BUFFER CONTAINING SUBCMD.   */         
*     2 TSTIODSN    PTR(31),   /* HEAD OF DSNAME CHAIN FOR IKJEGIO              
*                                 'PRINT'.                           */         
*     2 TSTIO       PTR(31),   /* ENTRY POINT OF GET ROUTINE IKJEGIO.*/         
*     2 TSTFLGSX,              /* WORD OF FLAGS FOR TEST     @E2115B8*/         
*       3 TSTAMODE  CHAR(1),   /* IF HIGH ORDER BIT IS ON    @E2115B8*/         
*                              /*  THEN TESTED PROGRAM IS IN @E2115B8*/         
*                              /*  31-BIT ADDRESSING MODE.   @E2115B8*/         
*       3 TSTFLGSA  CHAR(1),   /*  TEST Flags A              @PEI0661*/         
*         5 RUNSW2  BIT(1),    /*   RUN process complete     @PEI0661*/         
*         5 TSTLOOP  BIT(1),   /* BIT TO INDICATE THAT IKJEGLST IS              
*                         VALIDITY CHECKING AN ADDRESS RANGE @YA16440*/         
*         5 TREQACTV BIT(1),   /*   APPC test requset active         */         
*         5 TKEEPTP  BIT(1),   /*   whether to keep TP when test                
*                                   ends                     @E23D2D9*/         
*       3 TSTFLGSB  CHAR(1),   /*  RESERVED FOR TEST FLAGS.  @E2115B8*/         
*       3 TSTFLGSC  CHAR(1),   /*  RESERVED FOR TEST FLAGS.  @E2115B8*/         
*     2 *           PTR(31),   /* RESERVED                           */         
*     2 TSTCONVT    PTR(31),   /* ENTRY POINT OF IKJEGCVT.           */         
*     2 TSTADDR     PTR(31),   /* ENTRY POINT OF ADDRESS BUILD                  
*                                 SUBROUTINE.                        */         
*     2 TSTSTAE     PTR(31),   /* ENTRY POINT OF STAE EXIT RTN                  
*                                 (IKJEGSTA).                        */         
*     2 TSTFLGS,               /* NAME FOR 4 BYTES FLAGS     @E2115B8*/         
*       3 TSTFLGS1    BIT(8),  /* TEST FLAGS, BYTE 1.                */         
*         4 PCHLSTVL  BIT(1),  /* PATCH LIST SWITCH.                 */         
*         4 FORGOUSE  BIT(1),  /* USED BY IKJEGGO ONLY       @E211533*/         
*         4 TSTPRINT  BIT(1),  /* PRINT SWITCH.                      */         
*         4 TSTFIRST  BIT(1),  /* FIRST TIME SWITCH.                 */         
*         4 RANGESW   BIT(1),  /* INDICATES PDE IS FOR ADDRESS RANGE.*/         
*         4 TSTBUILD  BIT(1),  /* 'AT' SWITCH FOR DEFER CHECK.       */         
*         4 ENDSW     BIT(1),  /* INDICATES 'END' TO MAINLINE.       */         
*         4 RUNSW     BIT(1),  /* INDICATES 'RUN' TO MAINLINE.       */         
*       3 TSTFLGS2    BIT(8),  /* TEST FLAGS, BYTE 2.                */         
*         4 TSTLDF    BIT(1),  /* IKJEGLDF TASK-SWITCH INDICATOR.    */         
*         4 TSTXCTL   BIT(1),  /* STAE XCTL INDICATOR.               */         
*         4 TOFFDEF   BIT(1),  /* NO ACTIVE BREAKPOINTS.             */         
*         4 TSTLDFX   BIT(1),  /* ALET addr checking         @E21D2S6*/         
*         4 TADDROUT  BIT(1),  /* LOAD MODULE FOUND UNDER TCB.       */         
*         4 TWHRLOAD  BIT(1),  /* VALID LOAD MODULE CHECK.           */         
*         4 TSTQUAL   BIT(1),  /* QUALIFICATION IS IN PROCESS        */         
*         4 TMYIOMSG  BIT(1),  /* IKJEGIO MESSAGE SWITCH.            */         
*       3 TSTFLGS3    BIT(8),  /* TEST FLAGS, BYTE 3.                */         
*         4 TSTGOSW   BIT(1),  /* SPECIAL BREAKPOINT TYPE SWITCH.    */         
*         4 TSTSTAI   BIT(1),  /* PROBLEM PROGRAM ABEND INDICATOR.   */         
*         4 SYMMESG   BIT(1),  /* SYM 'NO DIAGNOSTIC' SWITCH.        */         
*         4 TCSECTCK  BIT(1),  /* CSECT ONLY DEFER QUEUE CLEAR.      */         
*         4 TDUPNAME  BIT(1),  /* DEFER QUEUE DUPLICATE NAME BIT.    */         
*         4 TSTLINK   BIT(1),  /* SUB-CMD 'LINK FAILED' INDICATOR.   */         
*         4 TSTHELP   BIT(1),  /* INDICATES THAT A TSO COMMAND IS               
*                                   ATTACHED BY TEST         @E2115B8*/         
*           5 TSTTSOC   BIT(1),  /* INDICATES THAT A TSO COMMAND IS             
*                                   ATTACHED BY TEST         @E2115B8*/         
*         4 NOPARMS   BIT(1),  /* INDICATES NO PARAMETERS WITH CMD.  */         
*       3 TSTFLGS4    BIT(8),  /* TEST FLAGS, BYTE 4.                */         
*         4 TSTA      BIT(1),  /* TEST'S INPUT IS NOT FROM A STACK.  */         
*         4 TSTB      BIT(1),  /* A STACKED TERMINAL ELEM. IS PRESENT*/         
*         4 TSTFLUSH  BIT(1),  /* FORCE TCLEARQ AND POSSIBLE STACK              
*                                 FLUSH.                             */         
*         4 TSTRERTN  BIT(1),  /* A RETRY IS IN PROCESS.             */         
*         4 TSTESTAE  BIT(1),  /* ESTAE IS INVOKING I/O FOR MESSAGE. */         
*         4 TSTSVCAB  BIT(1),  /* SVC ABEND IS IN PROCESS            */         
*         4 TSTPERC   BIT(1),  /* THIS RETRY ROUTINE WAS PERCOLLATED */         
*         4 TSTVALCK  BIT(1),  /* INDICATES PARSE VALIDITY CHECK IN             
*                                 PROCESS.                           */         
*     2 BREAKTAB    PTR(31),   /* PTR TO FIRST BREAK ELEMENT.        */         
*     2 DEFERTAB    PTR(31),   /* PTR TO DEFERRED CMD LIST.          */         
*     2 PPLOAD      PTR(31),   /* PTR TO CURRENT BASE FOR RELATIVES. */         
*     2 PPTEMP      PTR(31),   /* TEMPORARY BASE FOR RELATIVES.      */         
*     2 SUBCHAIN    PTR(31),   /* PTR TO BREAKPOINT SUBCOMMAND CHAIN.*/         
*     2 TSTGO       FIXED(32), /* RESUME ADDRESS AFTER BREAKPOINT.   */         
*       3 TSTGOPSW  FIXED(32), /* SECOND WORD OF RBOPSW FIELD.       */         
*     2 TSTGOWCF    FIXED(8),  /* WAIT COUNT FROM RBWCF FIELD.       */         
*     2 TSTFLGS5    BIT(8),    /* TEST FLAGS, BYTE 5.        @ZA92954*/         
*       3 SKIPATTN  BIT(1),    /* BYPASS ATTENTION PROCESSING@ZA92954*/         
*       3 TSTNOALT  BIT(1),     /* Suppress ALET on an address                  
*                                                            @E21D2S6*/         
*       3 TSTALETY  BIT(1),    /* ALET associated with address                  
*                                                            @E21D2S6*/         
*       3 TSTMSGL2  BIT(1),    /* Bypass message for next occurrence of         
*                            conversion of an address in CVT @E21D2S6*/         
*       3 TSTSYMAL  BIT(1),    /* ALET Associated W/ symbol  @E21D2S6*/         
*       3 TSTRESCC  BIT(1),    /*Restore problem programs CC @PEI0810*/         
*       3 TSTFOUND  BIT(1),    /* Command found flag         @E21D2MP*/         
*       3 TSTPARM   BIT(1),    /* Parmlib support is enabled @E21D2C7*/         
*     2 TSTSVC      FIXED(15), /* AN SVC 97 INSTRUCTION (0A61).      */         
*     2 PPRB        PTR(31),   /* CURRENT PROBLEM PROGRAM RB ADDRESS.*/         
*     2 TSTIODCB    PTR(31),   /* PTR TO OPEN PRINT DCB.             */         
*     2 CALLPARM    PTR(31),   /* HEAD OF CHAIN FOR PARMS BUILT BY              
*                                 'CALL'.                            */         
*     2 *           PTR(31),   /* *** RESERVED SPACE ***             */         
*     2 INTSTDDN    CHAR(8),   /* DDNAME FOR DATA SET SPECIFIED ON              
*                                 THE TEST COMMAND - USED BY IKJEGINT           
*                                 AND IKJEGLDR.                      */         
*       3 TSTCURLD  CHAR(8),   /* CURRENTLY QUALIFIED LOAD NAME.     */         
*     2 TERMDD      CHAR(8),   /* DDNAME FOR TERMINAL USED BY                   
*                                 OS LOADER.                         */         
*       3 TSTCURCT  CHAR(8),   /* CURRENTLY QUALIFIED CSECT NAME.    */         
*     2 TSTSYMBA    PTR(31),   /* CURRENTLY QUALIFIED SYMBOLIC                  
*                                 ADDR BASE.                         */         
*     2 TSTTRN      PTR(31),   /* HEAD OF SAVE INFORMATION CHAIN.    */         
*     2 SICHAIN     PTR(31),   /* HEAD OF SYMBOL INFORMATION CHAIN.  */         
*     2 TSTSYMWK    PTR(31),   /* PTR TO SYMBOL PROCESSING WORK AREA.*/         
*     2 SYMTABLE    PTR(31),   /* PTR TO IN-CORE SYMBOL TABLE.       */         
*     2 PPEXIT      FIXED(32), /* BREAKPOINT & EXIT SVC'S FOR PP TERM*/         
*       3 PPEXIT1   FIXED(15), /* AN SVC 97 INSTRUCTION (0A61).      */         
*       3 PPEXIT2   FIXED(15), /* AN SVC 3 INSTRUCTION (0A03).       */         
*     2 TSTDCB      PTR(31),   /* HEAD OF OVLY DCB CHAIN.            */         
*     2 OPCODTAB    PTR(31),   /* PTR TO TABLE OF VALID OPERATION               
*                                 CODES.                             */         
*     2 TSTOPCD2    PTR(31),   /* PTR TO TABLE FOR TWO BYTE S/370               
*                                 OPERATION CODES.                   */         
*     2 TSTCADDR    PTR(31),   /* CURRENT ADDRESS BEING VALIDITY                
*                       CHECKED BY IKJEGLST 'LSTBPT' ROUTINE @YA16440*/         
*     2 TSTOPCD3    PTR(31),   /* Address of E5 Opcode table @PHN0013*/         
*     2 TSTHTCB     PTR(31),   /* POINTER TO THE TCB FOR AN ATTACHED            
*                                 TSO COMMAND.               @E2115B8*/         
*       3 TSTOTCB     PTR(31),   /* POINTER TO THE TCB FOR AN ATTACHED          
*                                 TSO COMMAND.               @E2115B8*/         
*     2 TSTAQUAL    CHAR(8),   /* EBCDIC LOAD MODULE NAME.   @E2115B8*/         
*     2 TSTAQEP     PTR(31),   /* ENTRY POINT OF LOAD MODULE.        */         
*     2 TSTRSTRT    PTR(31),   /* RESTART ADDRESS FOR STAE PROCESSING*/         
*     2 TSTSRHRT    PTR(31),   /* ADDRESS OF RESIDENT ADDRESS                   
*                                 VALIDITY CHECK ROUTINE.            */         
*     2 TSTSTAX     CHAR(20),  /* STAX PARAMETER LIST                */         
*     2 TSTDSECB    FIXED(31), /* TEST DISPATCHABILITY ECB.          */         
*     2 TSTMNLWK    CHAR(56),  /* WORK AREA FOR EXCLUSIVE    @E2115B8*/         
*                              /* USE OF MNL                 @E2115B8*/         
*     2 TSTIOPRM    CHAR(84),  /* IO PARAMETER BLOCK         @E2115B8*/         
*     2 TSTSVCM1    CHAR(4),   /* SVC FIRST LEVEL MESSAGE NO.        */         
*     2 TSTSVCM2    CHAR(4),   /* SVC SECOND LEVEL MESSAGE NO.       */         
*     2 TSTOPCD4    PTR(31),   /* ADDRESS OF A4 OPCODE TABLE @E1402C4*/         
*     2 TSTOPCD5    PTR(31),   /* ADDRESS OF A5 OPCODE TABLE @E1402C4*/         
*     2 TSTOPCD6    PTR(31),   /* ADDRESS OF A6 OPCODE TABLE @E1402C4*/         
*     2 ABNDTCB     PTR(31),   /* ABENDING TCB  ADDR         @E2115B8*/         
*     2 TSTECTSV    CHAR(56),  /* ECT SAVE AREA.             @E2115B6*/         
*     2 TSTOPCD7    PTR(31),   /* ADDRESS OF E4 OPCODE TABLE @E1402C4*/         
*     2 TSTVPARM    FIXED(31), /* VECTOR FACILITY PARAMETERS @E1402C4*/         
*       3 TSTVSS    FIXED(15), /* VECTOR SECTION SIZE        @E1402C4*/         
*       3 TSTVPS    FIXED(15), /* VECTOR PARTIAL SUM NUMBER  @E1402C4*/         
*     2 TSTALET1    FIXED(32), /* ALET value for address     @E21D2S6*/         
*     2 TSTALET2    FIXED(32), /* ALET value for second address of a            
*                                 range                      @E21D2S6*/         
*     2 TSTMSGCD,              /* Message code fields        @E21D2S6*/         
*       3 TSTMSG1N  FIXED(32), /* First level message number @E21D2S6*/         
*       3 TSTMSG2N  FIXED(32), /* Second level message number                   
*                                                            @E21D2S6*/         
*     2 TSTEGARM    PTR(31),   /* Address of IKJEGARM        @E21D2S6*/         
*     2 TSTEGCOM    PTR(31),   /* Address of IKJEGCOM        @E21D2S6*/         
*     2 TSTEGAR1    PTR(31),   /* Address of IKJEGAR1        @E21D2B1*/         
*     2 TSTEGAR2    PTR(31),   /* Address of IKJEGAR2        @E21D2B1*/         
*     2 TSTEGAR3    PTR(31),   /* Address of IKJEGAR3        @E21D2B1*/         
*     2 TSTGEN      FIXED(32), /* Current Parmlib generation number             
*                                                            @E21D2MP*/         
*     2 TSTCBLK,               /* Pseudo-command entry generated by             
*                                 last command scan          @E21D2MP*/         
*       3  TSTCBCL   FIXED(8), /* Length of command name = 8 @E21D2MP*/         
*       3  TSTCBCN   CHAR(8),  /* Storage for command name   @E21D2MP*/         
*       3  TSTCBAL   FIXED(8), /* Length of alias name = 0   @E21D2MP*/         
*       3  TSTCBLN   CHAR(8),  /* Name of command load module@E21D2MP*/         
*       3  TSTCBCI   FIXED(8), /* ID of command name         @E21D2MP*/         
*     2 *            FIXED(8), /* *** Reserved space ***     @E21D2MP*/         
*     2 TSTTSOCD     PTR(31),  /* Pointer to local copy of IKJEGTCT             
*                                                            @E21D2MP*/         
*     2 TSTSUBCD     PTR(31),  /* Pointer to local copy of IKJEGSCT             
*                                                            @E21D2MP*/         
*     2 TSTTSOLN     FIXED(16),/* Length of local IKJEGTCT   @E21D2MP*/         
*     2 TSTSUBLN     FIXED(16),/* Length of local IKJEGSCT   @E21D2MP*/         
*     2 TSTPDECM    PTR(31), /* PDE ptr returned from prompt @E21D2S6*/         
*     2 TSTALERC    CHAR(4),   /* ALET addr check RC         @E21D2S6*/         
*     2 TSTS9G01    CHAR(20),  /* S9G macro workarea         @E21D2S6*/         
*     2 REGSAVE7    PTR(31),   /* Save area ptr              @E21D2S6*/         
*     2 REGSAVE8    PTR(31),   /* Save area ptr              @E21D2S6*/         
*     2 REGSAVE9    PTR(31),   /* Save area ptr              @E21D2S6*/         
*     2 TSTFTPRT    CHAR(48),  /* TEST Footprint Area        @E21D2S6*/         
*       3 TSTFTCUR  CHAR(24),  /* Current module             @E21D2S6*/         
*       3 TSTFTOLD  CHAR(24),  /* Previous module            @E21D2S6*/         
*     2 TSTOPCD8    PTR(31),   /* Address of 01 OPcode table @PE10170*/         
*     2 TSTFTTMP    CHAR(24),  /* Footprint Temporary Save   @PEI0220*/         
*     2 TSTECOMB    ,          /* Exit Command buffer ptr    @PEI0136*/         
*     2 TSTESUBB    ,          /* Exit SubCommand buffer ptr @PEI0136*/         
*     2 TSTUWENT    ,          /* Exit Communication word entry                 
*                                                            @PEI0136*/         
*       3 TSTUWKEY  FIXED(32), /* Exit Communication word Key                   
*                                                            @PEI0136*/         
*       3 TSTUWLEN  FIXED(32), /* Exit Communication word Length                
*                                                            @PEI0136*/         
*       3 TSTUWORD  FIXED(32), /* Exit Communication word Data                  
*                                                            @PEI0136*/         
*     2 TSTSWENT    ,          /* Exit SubCmd UserWord Entry @PEI0136*/         
*       3 TSTSWKEY  FIXED(32), /* Exit SubCmd UserWord Key   @PEI0136*/         
*       3 TSTSWLEN  FIXED(32), /* Exit SubCmd UserWord Len   @PEI0136*/         
*       3 TSTSWORD  FIXED(32), /* Exit SubCmd UserWord Data  @PEI0136*/         
*     2 TSTORIGI  FIXED(32),   /* Original INBUF save area   @PEI0431*/         
*     2 TSTCPAGE    PTR(31),   /* CURRENT PAGE ADDRESS USED BY                  
*                                 IKJEGLST 'LSTBPT' ROUTINE  @YA16440*/         
*     2 TCOMTPID    CHAR(8),   /* TPID for the TP being tested       */         
*     2 TSTMNLW2    PTR(31),   /* ADDR of second part MNL workarea              
*                                                            @E24D2B1*/         
*     2 SMSPDSE     CHAR(8),   /* PDSE STARTD/ENDD Token     @E24D2B1*/         
*     2 TSTFLGS6    BIT(8),    /* TEST flags, byte 6.        @PMH0149*/         
*       3 INITEINV  BIT(1),    /* Initialization exit invokd @PMH0149*/         
*     2 *           CHAR(3),   /* *** Reserved Space ***     @PMH0149*/         
*     2 *           CHAR(20);  /* *** Reserved space ***     @E21D2C7*/         
* DCL 1                                                                         
*   TCOM   BASED(ADDR(TCOMTAB)-LENGTH(TCOMID)), /* NAME FOR                     
*                                 TCOMTAB INCLUDING PREFIX   @E2115B8*/         
*     2 TCOMPREF,              /* TCOMTAB PREFIX             @E2115B8*/         
*       3 TCOMID CHAR(8),      /* TCOMTAB ID: 'TCOMTAB'      @E2115B8*/         
*     2 * CHAR(LENGTH(TCOMTAB));/* TCOMTAB PROPER            @E2115B8*/         
* DCL TCOMPREL FIXED(31) CONSTANT(LENGTH(TCOMPREF)); /* LENGTH OF               
*                                 TCOMTAB PREFIX             @E2115B8*/         
* DCL TCOMLTH FIXED(31) CONSTANT(LENGTH(TCOMTAB)+LENGTH(TCOMPREF)); /*          
*                               LENGTH INCLUDING PREFIX AREA @E2115B8*/         
* DCL OUTBUFRL FIXED(31)       /* LENGTH OF                          */         
*              CONSTANT(256);  /* OUTPUT BUFFER.                     */         
* DCL CONAREAL FIXED(31)       /* LENGTH OF                          */         
*              CONSTANT(72);   /* CONVERT WORK AREA                  */         
* DCL REGSAVEL FIXED(31)       /* LENGTH OF                          */         
*              CONSTANT(432);  /* 6 REGISTER SAVE AREAS.             */         
* DCL TREQAOFF BIT(8) CONSTANT('11011111'B); /*              @E23D2D9*/         
