// JOB   GS.NET
// EXEC CATSCR,PARM='WYL.GS.NET.MAILEXEC.OLD'
// EXEC IOPROGM
//INPUT DD DSN=WYL.GS.NET.MAILEXEC,DISP=SHR
//OUTPUT DD DSN=WYL.GS.NET.MAILEXEC.OLD,VOL=SER=SYS101,UNIT=DASD,
// DISP=(,CATLG),SPACE=(TRK,(10,5,5),RLSE)
