// JOB GS.NET,'MAILEXEC TO SYSB',TIME=(,15)
//$$SCR   EXEC PGM=IEHPROGM
//SYSPRINT DD SYSOUT=A
//SYSB02   DD VOL=SER=SYSB02,UNIT=SYSALLDA,DISP=OLD
//SYSIN    DD *
 SCRATCH DSNAME=WYL.GS.NET.MAILEXEC.OLD,VOL=SYSALLDA=SYSB02
 RENAME  DSNAME=WYL.GS.NET.MAILEXEC,VOL=SYSALLDA=SYSB02,               *
               NEWNAME=WYL.GS.NET.MAILEXEC.OLD
//COPY EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=A
//IN  DD DSN=WYL.GS.NET.MAILEXEC,DISP=SHR
//OUT DD DSN=WYL.GS.NET.MAILEXEC,
//        UNIT=SYSALLDA,VOL=SER=SYSB02,DISP=(,KEEP),
//        SPACE=(TRK,(10,5,10))
//SYSIN  DD *
  COPY INDD=IN,OUTDD=OUT
